[
  {
    "slug": "caishen-zhushou",
    "title": "菜谱：一年一度的仪式感 正月初五的财神猪手（1.5h）",
    "desc": "今天正月初五，接财神，每年今天的仪式感都是做只猪手哈哈哈哈，发财就手～今天是高压锅版，如果没有高压锅也可以用隔水炖或者电饭煲来炖猪手。",
    "cover": "https://cdn.chengpeiquan.com/img/2024/02/202402180015053.jpg?x-oss-process=image/interlace,1",
    "content": "年前在看 2011 年的 TVB 电视剧《真相》，陈展鹏主演的，好好看！里面马明是演大 BOSS ，比较巧的是马明在里面的角色叫 “江洛汶” ，结果他去年结婚老婆是汤洛雯，然后弹幕都好好笑哈哈哈，后面还搜了一下他俩的维基百科，居然籍贯都是潮州，怎么这么巧啊哈哈哈我也是潮州～看完《真相》又继续找剧，发现去年上映了一部新剧《隐门》，没想到现在还有熟悉的演员在演，也是陈展鹏和汤洛雯，还有吴岱融，演技都好好！也好好看，刚好昨晚看到凌晨三点多看完大结局！安利！今天正月初五，接财神，每年今天的仪式感都是做只猪手哈哈哈哈，发财就手～今天是高压锅版，如果没有高压锅也可以用隔水炖或者电饭煲来炖猪手。成品图：财神猪手## 主要食材猪手半只（约一斤，不过猪手比较重秤，所以又添了一块猪腿肉大约半斤），加起来差不多 800 克。猪手半只和一块猪腿肉其他配料：姜一块（飞水用）葱一根（飞水用）花椒粒一小把（大料）八角三四粒（大料）桂皮一根（大料）香叶三片（大料）草果一粒（大料）老抽酱油（卤水上色）冰糖或者白砂糖（卤水提鲜）大料都可以自由搭配，比如还可以搭配几个干辣椒～准备好的大料有条件的话准备一个过滤袋，将它们装起来就很方便了，这东西很便宜，家里可以常备，平时煲东西用来装一些散料，或者卤东西装大料都很实用！装到过滤袋里好方便另外提前烧一电热壶的热水备用。## 处理食材猪手本身就切块了，洗净，装水淹没，加入姜片和葱，冷水下锅直接大火煮到沸腾即可，刮走浮沫，捞干净到高压锅里，加热水淹没。洗净，装水淹没，加入姜片和葱大火煮到沸腾即可，刮走浮沫猪手飞水的时候把大料都洗干净，草果用刀背敲碎，桂皮也折小块，一起装过滤袋里。两个环节都好了之后，把猪手和大料包一起放高压锅里炖个 20 分钟（这是软糯版，喜欢有嚼劲一点可以缩短时间）。准备进高压锅高压锅炖好的猪手，软糯糯皮都差点抖一抖就掉出来啊哈哈如果是隔水炖，大约 1 小时，电饭煲也是按煮饭的时间差不多 40 分钟，不过高压锅也要等 20 分钟才能开锅，所以整体时间其实差不多哈哈哈哈。## 卤水猪手猪手炖好后，全部转移到炒锅里，大料包也一起哦。加入 2.5 锅铲的老抽酱油，还有 2.5 汤勺的白糖（我主要忘记买冰糖了啊哈哈哈），不喜欢甜口的可以少加，加糖的目的是辅助老抽更好的上色，并且也可以在卤的过程中更好的收汁，口感方面也可以适当提鲜。记得用老抽，才能更好的上色加入老抽，这是一锅铲的量加入白糖，这是一汤勺的量电磁炉开 800 度慢慢卤，基本上不用管它，偶尔过来翻一下就行。慢慢卤期间可以去煮饭，等饭煮熟了，猪手也就卤好了，刚好吃饭哈哈哈哈。时间差不多就会上色的很漂亮了## 成品图软糯好好吃的猪手！！！！！软糯好好吃的猪手！！！！！"
  },
  {
    "slug": "chaoshan-xiyangcai-roupian-tang",
    "title": "菜谱：西洋蔡同奀妹，简单的潮汕促肉汤（5min）",
    "desc": "今天来一个西洋菜焯肉片汤，潮汕人很爱吃的“促肉”汤（焯肉），除去把水煮开的时间，中间真正煮食材的时间也就不到 2 分钟，真的很快哈哈哈哈。至于今天这个名字，《七十二家房客》都看过吧？每次看到西洋菜，我就想到里面的“西洋蔡”，然后西洋蔡又和奀妹在一起，所以这道汤我就起名“西洋蔡同奀妹”啦（奀妹：？？？）",
    "cover": "https://cdn.chengpeiquan.com/img/2023/08/20230827164050.jpg?x-oss-process=image/interlace,1",
    "content": "我好久没有更新了啊哈哈哈哈，工作日是完全没做饭了，最近几个周末又都是一直在包饺子，也没什么新的可以发，结果上一篇已经是 6 月份发的了，不过我倒是每天都在，上下班路上总在别人的笔记下面发“哈哈哈哈哈哈哈哈哈哈哈哈”…今天来一个西洋菜焯肉片汤，潮汕人很爱吃的“促肉”汤（焯肉），除去把水煮开的时间，中间真正煮食材的时间也就不到 2 分钟，真的很快哈哈哈哈。至于今天这个名字，《七十二家房客》都看过吧？每次看到西洋菜，我就想到里面的“西洋蔡”，然后西洋蔡又和奀妹在一起，所以这道汤我就起名“西洋蔡同奀妹”啦（奀妹：？？？）成品图：西洋菜焯肉片汤## 主要食材1、西洋菜一把，今天这把差不多 6 两，别看这一大盆西洋菜很多，煮的时候一下子就软了，就没多少了2、瘦肉或者梅头肉一块，今天这块梅头肉是 4 两，我都拿来下了哈哈哈3、鱼露4、胡椒粉## 处理食材食材的处理会稍微费点时间，主要是西洋菜要浸泡一下。1、西洋菜先洗几次，再重新在洗菜盆里装满水，加一勺盐，把西洋菜在盐水里泡上 10 分钟，然后再冲洗干净2、洗西洋菜的时候，掉落的小小的散叶不要，掐一下根茎，感觉很老很韧的也择掉3、猪肉切片备用准备好的西洋菜和肉片## 准备煮汤1、电磁炉先开 1000w ，对，温度比平时高一些，汤锅煮水，水可以多一点2、在大碗里面先加鱼露和胡椒粉，水开了先兑一点汤底碗里面先加鱼露和胡椒粉3、肉片先下锅（可以放在笊篱里），就着沸腾的水温，用筷子快速打散，变白了就是熟了，可以用笊篱马上捞出来，因为煮久了肉会变老，潮汕人爱“食促”就是烫熟即可，不煮久，这样肉还是很嫩很好吃水完全开了才下肉片烫熟了就捞出来4、这个时候水还要再继续煮一会直到再次沸腾，转 800w 平时炒菜煮东西的温度，再把西洋菜放下去，筷子稍微弄一下让菜都浸入水里，可以滴入一点食用油一起煮，盖上锅盖煮个差不多一分半钟煮西洋菜5、时间到了就开盖，把西洋菜捞到碗里，再补足菜汤直到碗满即可搞定"
  },
  {
    "slug": "chaozhou-roudong",
    "title": "菜谱：潮汕凉菜之潮州肉冻（1.5h）",
    "desc": "哈哈哈哈哈天气热就想吃凉菜，潮汕地区也有自己的凉菜（虽然在广州和深圳的外卖基本上买不到…），今天的潮州肉冻也是其中之一，我妈妈时不时会买，有时她也会自己做，我这次也是凭着十几岁那会帮她打下手时留下的记忆把潮州肉冻做了出来，竟然没有记错哈哈哈…",
    "cover": "https://cdn.chengpeiquan.com/img/2023/06/20230618212009.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈哈天气热就想吃凉菜，潮汕地区也有自己的凉菜（虽然在广州和深圳的外卖基本上买不到…），今天的潮州肉冻也是其中之一，不知道其他潮汕有没有这个，我从小在潮州市区是经常见到，我妈妈也时不时会买，有时她也会自己做，我这次也是凭着十几岁那会帮她打下手时留下的记忆把潮州肉冻做了出来，竟然没有记错哈哈哈…成品图：潮汕凉菜之潮州肉冻可以搭配芫荽和豆酱一起吃## 主要厨具难得我要特地交代一下厨具…1、汤锅（用来飞水）2、高压锅（如果没有的话也得准备一个能炖肉的炖锅，如果炖的不够软烂，汤底里熬出来的胶质太少，很难凝固）3、电热水壶（煮壶热水备用，飞水后，进高压锅之前是加热水）4、两个保鲜盒（因为一顿吃不完，我分两顿吃，所以我准备了两个保鲜盒单独储存）。5、冰箱（这个需要冰箱冷藏，所以租房如果没有冰箱可能不太适合做这个）## 主要食材在潮州老城区这边的肉冻都是猪皮猪脚冻，所以我也是用了这两种原材料。1、小猪脚一只（吐槽一下现在的猪脚都是不怎么带肉的…要肉多的话可能得再单独买一份猪腿肉）2、猪皮小半斤（肉冻要成型，得有很多胶质的食材一起熬，猪皮真的是绝佳）3、姜（飞水用）4、葱（飞水用）5、鱼露（汤底调味用）6、生抽（汤底调味用）其他备选调味辅料，吃的时候才用：1、普宁豆酱（如果鱼露下少点，吃的时候可以搭配豆酱蘸着吃）2、芫荽（也就是香菜在潮州的叫法，潮州的卤鹅、卤猪脚、蚝烙、肠粉都有搭配芫荽的习惯，这个也不例外哈哈哈哈）普宁豆酱## 处理食材猪皮和猪脚在档口一般都会先处理干净，回家不太需要干啥准备工作，一般都是这样处理：1、猪脚烧掉毛、剁成小块猪脚剁成小块2、猪皮烧掉毛，刮掉皮上脂肪，切成大片（不要太小，太小一煮就缩没了 - - ）猪皮切成大片然后洗净，加入葱和切片的姜，一起在汤锅里下锅后冷水淹没，开大火煮到差不多沸腾就完成飞水的准备工作。准备飞水## 制作步骤1、飞水后的猪脚和猪皮都弄干净（不要带飞水后的浮沫，飞水的姜葱也不要），放入高压锅的内锅里2、加入热水淹没食材，按蹄筋之类的能炖比较久的功能，让它慢慢炖（高压锅这个过程大概 40 分钟，等开锅要 20 分钟）加入热水淹没食材按蹄筋之类的能炖比较久的功能3、炖好后，先把猪脚和猪皮捞到大碗里稍微晾凉，然后给猪脚去骨头，再码到保鲜盒里猪皮好软烂猪蹄好容易就去骨把猪脚和猪皮捞到大碗里稍微晾凉4、高压锅里的猪脚高汤先用勺子把上面的油脂尽量去掉，然后加入一大勺鱼露和半勺生抽（用的是盛汤的小汤勺，不是平时那种小餐勺），搅拌均匀后倒入保鲜盒里淹没食材即可把上面的油脂尽量去掉加入一大勺鱼露和半勺生抽，用的是盛汤的小汤勺搅拌均匀食材先在保鲜盒里码好倒入保鲜盒里淹没食材即可5、最后放入冰箱冷藏一个晚上，第二天就有凝固成型的肉冻吃啦！放入冰箱冷藏一个晚上第二天就有凝固成型的肉冻吃啦我是吃的时候会蘸豆酱，所以鱼露没有加太多，直接吃会有点淡。如果打算不蘸调料的话可以下多一点（可以试味道，觉得比平时喝汤要咸了的时候，做出来就刚刚好）。## 取出食用最后取出来的时候也容易，先用盛饭的饭勺把四周稍微切一下。用盛饭的饭勺把四周稍微切一下然后倒扣在熟食砧板上一拍就下来了（嗯嗯，我的砧板是生熟分开的，如果只有一块砧板可以垫个保鲜袋隔一下）。倒扣在熟食砧板上一下子就取下来了因为胶质足够多，所以切的时候不会散也不容易融化！切的时候不会散## 最终成品切好码盘里，整整齐齐。切好码盘里一块块的特别好看，很 Q 弹！一块块的特别好看蘸普宁豆酱吃哈哈哈哈！蘸普宁豆酱吃还可以搭配芫荽和豆酱一起吃！搭配起来好好看更有潮汕风味！"
  },
  {
    "slug": "nanru-kaorou-juan-shengcai",
    "title": "省钱菜谱：5.4元的南乳烤肉卷生菜（20min）",
    "desc": "今天搞个南乳烤肉，之前几次我叫它腐乳的时候老是被问不是白色才是腐乳吗，这个其实也是啊，有红色也有白色，像我家那边说腐乳汁就是指这种红色的，当然有的地方更习惯叫它南乳，我也用南乳来叫它吧，减少歧义哈哈哈哈~",
    "cover": "https://cdn.chengpeiquan.com/img/2023/05/20230430234407.jpg?x-oss-process=image/interlace,1",
    "content": "昨天放假的第一天，买下了心念念很久的三位字母的 .dev 域名（面向开发者的一个顶级域名， development / developer 的缩写），从 2019 年开放注册后，很多我喜欢的技术大佬和常用的技术栈官网都从 com 和 org 转向使用 dev 域名，加上最近连最火的前端框架 React 也启用了新的 react.dev 官网，我终于也憋不住了… 开心！！！今天搞个南乳烤肉，之前几次我叫它腐乳的时候老是被问不是白色才是腐乳吗，这个其实也是啊，有红色也有白色，像我家那边说腐乳汁就是指这种红色的，当然有的地方更习惯叫它南乳，我也用南乳来叫它吧，减少歧义哈哈哈哈\\~成品图：南乳烤肉卷生菜## 主要食材1、鸡腿约 5.4 元（大约半斤）2、南乳两块，还有两三勺南乳汁3、白砂糖（约一勺）4、我用来卷着生菜吃的，所以还准备了生菜，非必须5、孜然粉（装盘后撒上）6、辣椒粉（装盘后撒上）## 处理食材1、鸡腿处理成小块，洗干净备用2、加入南乳和白砂糖，全部抓匀，放冰箱冷藏一个晚上腌入味加入南乳和白砂糖全部抓匀3、生菜叶子洗干净备用## 烤肉1、空气炸锅里铺上锡纸，码好肉丁，恒温 200 度先烤 10 分钟码好肉丁准备烤2、第一次烤好后用筷子翻匀，再次烤 10 分钟如果觉得火候还不够（比如量比较多），可以再拿出来翻匀后再稍微烤 2\\~3 分钟。烤好的肉肉装盘后可以再撒上孜然粉和辣椒粉、白芝麻等烧烤侧的调味料，生菜叶卷着烤肉吃好好吃哈哈哈哈！好好吃哈哈哈哈"
  },
  {
    "slug": "qincai-xianggu-xianrou-yuntun",
    "title": "省钱菜谱：3.25元/碗的芹菜香菇鲜肉云吞（20min）",
    "desc": "今天这个菜谱是上周的，上周末包了芹菜香菇云吞，今天才来整理哈哈哈哈哈。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/04/20230402223302.jpg?x-oss-process=image/interlace,1",
    "content": "广州快连续半个月阴雨天气了，这段时间每天下班回到家第一件事不再是喂猫，而是先把衣服收下来扔进烘干机里去烘干，看了天气预报，未来十天还是这种天气，今年有点离谱哈哈哈哈哈哈，往年印象中没有这样连续这么多天的（因为烘干机是去年双十一才买的，之前在广州没有烘干机我都觉得问题不是很大…我在新公司不知不觉也快上班一个月了，现在每天通勤要一个半小时，不过好在地铁出行，地铁上的时间可以拿来碎片阅读，加上做的都是自己喜欢的工作，每天还是过的蛮开心的，倒是没有因为通勤问题觉得累，就是更没有多少时间自己做饭了，今天这个菜谱是上周的，上周末包了芹菜香菇云吞，今天才来整理哈哈哈哈哈。成品图：芹菜香菇鲜肉云吞## 主要食材1、猪肉约六两（300 克）2、云吞皮大约七两（350 克）3、干香菇抓多几朵（我直接抓一大把，毕竟是主角）4、芹菜两棵（比较长的大芹菜）5、虾皮一小把6、鱼露7、花椒粉8、五香粉猪肉有打折是 7 块钱，云吞皮 4 块钱，其他材料家里有就算多 2 块钱吧，13 块钱包了 64 个云吞，16 个一碗，一碗大概 3.25 元。其实猪肉和云吞皮不用固定这么多哈哈哈哈，看你想包多少随便买，然后处理食材之前先提前煮一电热壶热水备用。## 处理食材1、芹菜洗干净后切碎，有拉蒜器这种小工具的话更好，丢进去拉几下就搞定买的是这种大芹菜用拉蒜器弄成芹菜末2、干香菇也是洗干净，再用热水泡，等会这个香菇水还要再利用一下，处理成香菇末备用泡好的香菇也是处理成香菇末3、猪肉先处理成肉馅，加入鱼露调味（我这个分量加了 1.5 勺），再撒上一层五香粉和花椒粉，边剁边翻让调味入味4、给肉馅加入虾皮，还有香菇末和芹菜末，用压刀法慢慢剁匀加入虾皮加入香菇末和芹菜末5、期间加入几勺香菇水一起剁，这样肉馅会更有黏性加入一些香菇水可以看出这个肉馅很有黏性哈哈哈哈。剁好的肉馅## 包云吞跟包饺子一样，准备一碗清水，用来粘合云吞。1、先拿一张云吞皮，放上适量的馅放上适量的馅2、拎起对角往自己这边盖过来拎起对角往自己这边盖过来3、再往自己的反方向稍微推一下再往自己的反方向稍微推一下4、再往自己的方向卷一下5、用右手食指沾点清水，点在左上角再往自己的方向卷一下，并沾点清水在左上角6、右手拉起右侧，往左侧粘合，就搞定了右手拉起右侧，往左侧粘合包的时候可以根据馅料和皮的余量动态调整云吞的大小，不过包熟悉了就能很好控制每个云吞都差不多大。就搞定了## 煮云吞因为芹菜比较多，所以汤底是用了芹菜粒 + 胡椒粉 + 鱼露。用芹菜粒 + 胡椒粉 + 鱼露做汤底水开了先兑好汤底，再把云吞下锅煮，煮到沸腾并且云吞皮变得透明就熟了，就可以用笊篱捞出来。煮熟的云吞这一碗真是好看又好吃！好看又好吃"
  },
  {
    "slug": "yuntun-dabao-cunchu-xiaojiqiao",
    "title": "包好近百个云吞后，打包存储的小技巧",
    "desc": "每次包云吞动不动就是六七十个，一个人肯定一顿吃不完，要放冰箱速冻起来。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/03/20230312234446.jpg?x-oss-process=image/interlace,1",
    "content": "分享一个生活小妙招，可以很好的存储包好的云吞。## 事情起因每次包云吞动不动就是六七十个，一个人肯定一顿吃不完，要放冰箱速冻起来。包好的云吞## 巧用道具平时买虾皮啊猪肉脯啊之类的，包装里会有一个塑料垫板，洗干净后留着，包好的云吞码上去整整齐齐的，尺寸又刚好是一个保鲜袋的尺寸，套上去简直完美。码好的云吞刚好套进保鲜袋折好保鲜袋的口子就可以叠起来放速冻层保存了！折好保鲜袋的口子堆起来也不怕了煮的时候水开了直接下锅就行，因为码的时候不会叠在一起，所以下锅的时候可以独立回来一个一个的，不会黏在一起也不会弄破！"
  },
  {
    "slug": "muer-chaorou",
    "title": "菜谱：简易版木耳炒肉（5min）",
    "desc": "今天分享一个木耳炒肉，过年的时候好朋友兼好邻居送了我一袋木耳，好好吃哈哈哈哈！",
    "cover": "https://cdn.chengpeiquan.com/img/2023/02/20230303145446.jpg?x-oss-process=image/interlace,1",
    "content": "最近拿到了新 Offer ，准备去新公司上班啦！虽然现在大环境不好，但还是得到了薪资上的一些上浮，并且新的团队做的事情我感觉会让我继续成长不少。刚好金三银四了，也分享一下自己的小心得：1、有内推优先走内推，内推的大部分都会比较认真看简历，因为平台收到的实在太多了，之前自己招人也是2、如果已经有了一些工作经历，简历上建议多量化自己的业绩，多体现自己的个人价值，例如负责什么业务做到了什么样的成绩，而不是只写自己会做什么，否则看简历时很难评估 5 年经验和 2 年经验的两个人到底有多大差别3、简历上太低级的技能就不用写了，例如工作多年后，还在写一些岗位上要求的基础技能就没有必要，因为本身就必须会的，写上去只是占篇幅（我是做开发的，像一些工作多年的工程师还在写会用 AJAX 与服务端联调 API 就很没必要了），可以多写一些和自己年限匹配的经历和个人能力4、面试前除了一些必要的知识准备外，对自己的个人介绍，从业经验介绍也要准备，让自己在沟通的过程中保持自信和语言流畅，如果开口就磕磕巴巴，也会给对方留下不太好的印象希望在找工作的朋友们可以顺利拿到自己满意的 Offer ！然后今天分享一个木耳炒肉，过年的时候好朋友兼好邻居送了我一袋木耳，好好吃哈哈哈哈！成品图：木耳炒肉## 主要食材1、干的黑木耳一小把，千万不要多哈哈哈哈，真的一小把就够！这么一小把就可以了2、瘦肉一小块3、蒜头拿个两三瓣4、指天椒也拿拿两颗5、盐6、玉米淀粉一小勺（就调料盒的小勺子，兑水淀粉勾芡用）## 处理食材1、木耳用温水提前浸泡（我大约泡 40 分钟），刚浸泡虽然很少，等下泡好就一大堆了，泡好后多冲几次水，抓几下再捞出来，可以把残留的一些杂质和少量沙子之类的去掉刚浸泡虽然很少等下泡好就一大堆了2、用厨房剪刀把木耳的小柄和根部略为硬硬的边缘去掉，再适当剪小块，用笊篱装好放小碗上滴干水份，有厨房纸巾可以拿出来吸一下水处理木耳3、肉切片、指天椒去头切圈、蒜头拍碎去皮再切碎4、淀粉加一点清水搅拌均匀兑成水淀粉处理好的所有食材## 烹饪过程1、比平时炒菜稍微多点油，蒜末和椒圈先放下去爆香爆香配料2、肉片也下锅一起炒熟，加盐调味，再一起盛出来备用炒熟肉片3、木耳下锅，滴干水分后基本不会炸锅，期间多翻炒，一分多钟后加盐调味，图片是木耳刚下锅时和木耳炒熟后的对比木耳刚下锅时木耳炒熟后4、把肉片和椒蒜一起下锅，淋上水淀粉勾芡，全部翻炒均匀就可以出锅啦！全部翻炒均匀肉和木耳是分开调味的，所以每次下盐不用太多哦，不然整道菜就太咸了！最终的成品图"
  },
  {
    "slug": "gali-chaofan",
    "title": "菜谱：超简单的咖喱炒饭（5min）",
    "desc": "咖喱炒饭也是我很喜欢吃的一个炒法，过程超简单！就是在普通蛋炒饭的基础上，上色步骤将生抽酱油换成咖喱粉就行！",
    "cover": "https://cdn.chengpeiquan.com/img/2023/02/20230204204833.jpg?x-oss-process=image/interlace,1",
    "content": "咖喱炒饭也是我很喜欢吃的一个炒法，过程超简单！就是在普通蛋炒饭的基础上，上色步骤将生抽酱油换成咖喱粉就行！## 主要食材1、提前一晚上煮好米饭，放保鲜盒冷藏一晚上2、鸡蛋 2\\~3 个3、鱼露（平时喜欢用生抽酱油也可以，或者盐，不过鱼露更鲜）4、咖喱粉煮饭的时候水少一点，电饭煲如果有柴火饭这种煮出来比较干的模式就用这种模式，颗粒分明太适合炒饭了！颗粒分明的隔夜饭## 制作步骤1、鸡蛋打散，加鱼露调味鸡蛋打散，加鱼露调味2、炒锅加一点点油润锅，开 800W 等温度上来后蛋液倒进去，来回炒散直到炒熟，装碗里备用蛋液倒进去来回炒散炒熟变成蛋碎3、重新加一点油热锅，也是 800W ，温度上来后再下米饭，用锅铲切小块后，继续用锅铲压散，只要米饭煮的好，不会压成糊，依然颗粒分明，完全不带怕的用锅铲切小块后，继续用锅铲压散4、等米饭都压好后，撒上咖喱粉，继续翻炒，如果上色不均匀就稍微补刀再撒一些撒上咖喱粉继续翻炒上色5、最后把蛋碎到进去翻炒均匀就 OK 了颗粒分明很好吃哈哈哈至于鸡翅根，那不是重点哈哈哈哈，我随便搭配的，也是提前一晚上用盐焗鸡粉腌制后，空气炸锅垫锡纸烤 10 分钟，再翻面烤 10 分钟，用新奥尔良腌料也可以。"
  },
  {
    "slug": "chaoshan-baicai-xianrou-jiaozi",
    "title": "菜谱：口感细腻的白菜鲜肉饺子v2版（1h）",
    "desc": "祝大家新年快乐！新的一年身体健康，事事如意！今天除夕，中午包顿饺子！前段时间研究了馅料的新的加工方式，虽然花的时间比平时的饺子馅要多一点，但做出来的饺子有薄皮小笼包的感觉，口感非常细腻，特别好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230121233847.jpg?x-oss-process=image/interlace,1",
    "content": "祝大家新年快乐！新的一年身体健康，事事如意！今天除夕，中午包顿饺子！前段时间研究了馅料的新的加工方式，虽然花的时间比平时的饺子馅要多一点，但做出来的饺子有薄皮小笼包的感觉，口感非常细腻，特别好吃！！！食材和之前的白菜饺子是一样的，但需要额外准备一个笊篱和拉蒜器，如果需要购入拉蒜器的话建议买大一点，除了处理蒜末，平时葱末、姜末、辣椒末、香菇末都很方便，现在还拿来弄饺子食材，所以我现在觉得我手里这个太小了，等年后快递可以送了我再买一个大的。成品图：包好的所有饺子成品图：白菜鲜肉饺子## 主要食材1、黄心白菜一颗，我喜欢黄心白，好甜！2、干香菇若干，抓一把3、老姜一大块，驱寒，搭配白菜提鲜4、猪肉馅，优先选肥瘦相间的，搭配起来口感更好5、虾皮一把6、鱼露7、盐8、芝麻香油9、五香粉10、花椒粉## 处理馅料1、白菜掰叶洗净，切丝切粒，放到拉蒜器里，拉几下，很快就变得非常细腻，先放到大碗里备用白菜掰叶洗净切丝切粒放到拉蒜器里处理好的白菜末2、处理完白菜后，加入两平勺盐，不断抓匀，把白菜抓出水，用笊篱压走大部分水，捞到炒锅里加入两平勺盐抓到出水用笊篱压走大部分水3、生姜切片切粒后，也是用拉蒜器拉成姜末，倒到炒锅里处理好的姜末4、给白菜末和姜末撒上一层花椒粉和一层五香粉，加入一勺芝麻香油，拌匀撒上花椒粉和五香粉，加入香油5、干香菇用热水提前泡开，也是切丝切粒后用拉蒜器拉成香菇末，倒到白菜馅里6、猪肉也是弄成肉末，加入鱼露调味，倒到白菜馅里7、最后撒上一把虾皮，把所有馅料拌匀就搞定把其他材料也加进去拌匀## 包饺子1、需要准备一碗清水，手指沾清水把饺子皮涂一圈2、舀一勺馅料放在饺子皮中间手指沾清水把饺子皮涂一圈3、拎起中间对折捏紧舀一勺馅料放在饺子皮中间4、右下角捏紧拎起中间对折捏紧5、右上角用食指中指无名指一起收拢合起来捏紧右上角也捏紧6、左边也是一样，就包好啦左边也是一样就包好啦包好的所有饺子## 蒸饺子1、汤锅煮水，水开了放入蒸架和蒸片，铺上弄湿了的蒸布，码好饺子，盖上锅盖开 800W 倒计时蒸 10 分钟2、饺子蒸好后开盖让蒸汽透一下，大约 2\\~3 分钟再去拿，造型更好看蒸好的饺子翻过来好像薄皮小笼包！好像薄皮小笼包咬开也好好吃！细腻的肉馅细腻的肉馅口感很不一样！细腻的肉馅## 煎饺子包好之后可以把所有饺子都蒸好，留一部分放到保鲜盒里冷藏，下一顿煎饺子吃嘿嘿嘿今晚是煎饺"
  },
  {
    "slug": "fenou-paigu-tang",
    "title": "菜谱：18.5元的粉藕猪肘汤（30min）",
    "desc": "这两天看到猪肘打了个 5 折，半个猪肘 12 块钱，买了份回来煲汤，不过看评价的晒图很明显分量不太大，又机智的买了一份打折的猪腿肉，搭配起来也不错，煲汤的步骤都差不多，这次简单写一写。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230120171422.jpg?x-oss-process=image/interlace,1",
    "content": "去年写的《一个人的过年指南》分享了一些异地过年的心得，又被不少人翻出来了，希望大家都能准备好东西过个好年！我这两天一直忙着大扫除，又买了富贵竹和银柳摆起来，还挂了两个中国结，年味就起来了，真不错！家里的猫还挺乖，没有去搞我的花哈哈哈哈哈！银柳富贵竹这两天看到猪肘打了个 5 折，半个猪肘 12 块钱，买了份回来煲汤，不过看评价的晒图很明显分量不太大，又机智的买了一份打折的猪腿肉，搭配起来也不错，煲汤的步骤都差不多，这次简单写一写。还是用的电高压锅，如果没有高压锅的话可以用电饭煲或者隔水炖锅；隔水炖时间会比较久，但一样很软烂；电饭煲的话我是先煲一段时间再用电磁炉汤锅慢慢煨，这样就不影响煮饭（电饭煲版本可以看我之前的排骨汤，说明比较详细）。成品图：粉藕猪肘汤## 主要食材1、猪肘半个，12 块钱（当时打 5 折，现在又是原价 24 了， 350 克，不过重量都在骨头）2、猪腿肉约二两， 5 块钱（买的这一份是 200 克 9.9 元，留了一半第二天煮面条）3、粉藕一节，约 1.5 元4、红枣拿个 8 \\~ 10 粒，汤甜甜5、我爱花生，拿了一把6、姜一块（用来飞水）## 处理食材先煮一电热壶的热水备用。1、猪肘块和猪腿肉洗净，放汤锅里加冷水淹没，加入切片的姜片，大火煮到接近沸腾就关火，捞走浮沫和姜片，把飞好水的肉块捞到高压锅里，水倒掉不要（猪手飞水后水比较脏，不太适合继续煲汤）猪肘焯水2、粉藕去皮，切滚刀块，放汤锅里加热水淹没，加入一勺盐，倒计时煮 2 分钟焯一下，这样藕不容易变黑粉藕焯水3、花生提前用凉水浸泡一下，捞出来加到高压锅里4、红枣洗净，剪开一个口子，也放锅里## 煲汤过程食材都已经在高压锅里了，加入热水淹没食材。码好食材加入热水开煲汤键或者猪蹄键，定时结束就可以了，我的锅炖猪蹄是大约半小时，等到高压锅可以打开大约 25 分钟，刚好煲汤后去煮饭，时间刚刚好。煲好的汤炖出来的猪肘很软糯，汤也很甜，好吃！软糯好吃"
  },
  {
    "slug": "baitang-zheng-jidan",
    "title": "食疗菜谱：用白糖蒸鸡蛋治疗感冒鼻音（1min）",
    "desc": "我在圣诞节那天弱阳，在元旦节那天阳康，但我的鼻音一直迟迟不好，然后我老妈教了我这招，试了几天真的好了！网上搜了一下确实有这个说法，分享一下有同样困扰的人，可以试试。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230112231503.jpg?x-oss-process=image/interlace,1",
    "content": "我在圣诞节那天弱阳，在元旦节那天阳康，但我的鼻音一直迟迟不好，然后我老妈教了我这招，试了几天真的好了！网上搜了一下确实有这个说法，分享一下有同样困扰的人，可以试试。成品图：白糖蒸鸡蛋可以提前煮一壶开水，蒸蛋用开水蒸。## 主要食材1、鸡蛋 1 个2、白砂糖3、清水## 处理食材1、盛饭的碗就可以，碗底加一点清水，摊平大约半公分高碗底加一点清水2、打入鸡蛋，直接整个，不用打散打入鸡蛋3、撒上薄薄一层白砂糖撒上薄薄一层白砂糖## 蒸蛋步骤1、我用的是电高压锅，高压锅里装半碗热水，把碗放进去把碗放进高压锅2、盖好盖子，随便哪个模式都可以（我习惯按蒸蛋模式）3、然后等高压锅开始 “咻” ，在 “咻” 结束后就可以取消并断电（这个过程只需要几十秒，算 1 分钟吧）4、等到锅里的压力自然消失，可以开锅了就可以吃啦！（我的锅大约等 20 分钟）超快搞定普通的蒸锅也可以，看到鸡蛋凝固了就可以关火，焖一下再开。## 最终成品吃完马上睡觉，我第一天吃的时候，第二天起来马上就恢复了一大半，然后吃了两三天就完全恢复正常了。很好吃豁哈哈高压锅超方便，鸡蛋全熟了"
  },
  {
    "slug": "shacha-roupi-men-fensi",
    "title": "省钱菜谱：7.68元的沙茶肉皮焖粉丝（10min）",
    "desc": "这是前几天的晚餐了，今天才有时间来发哈哈哈哈，我好爱沙茶！变着法子玩一下肉皮的新做法，好吃！但是会有点干，建议搭配个汤一起吃，或者准备点 AD 钙奶啥的饮料嘿嘿。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230111232706.jpg?x-oss-process=image/interlace,1",
    "content": "这是前几天的晚餐了，今天才有时间来发哈哈哈哈，我好爱沙茶！变着法子玩一下肉皮的新做法，好吃！但是会有点干，建议搭配个汤一起吃，或者准备点 AD 钙奶啥的饮料嘿嘿。成品图：沙茶肉皮焖粉丝## 主要食材1、潮汕肉皮（学名应该叫“油炸猪皮”或“砂暴猪皮”，对应两种不同的制作工艺），巴掌大的分量，大约 6 块钱2、龙口粉丝一把，买的时候是一包，折算下来一把是 1.68 元3、老抽半勺4、鱼露半勺5、沙茶一大勺（或者大约 1.5 平勺）6、虾皮一小把7、香葱一根## 处理食材1、肉皮先用开水浸泡十几二十分钟，时间不固定，泡软就好，这个过程除了泡软，还有一个目的是把杂质或者油脂泡出来，然后再次洗干净浸泡好的肉皮2、把泡好的肉皮切小块或者切丝备用3、粉丝用温水泡软，也捞干备用切好的肉皮和泡好的粉丝4、把沙茶酱加两勺开水化开（不然太稠），再加入老抽、鱼露，拌匀备用拌匀的酱料5、葱用厨房剪刀剪的细碎细碎的，或者切成葱花## 烹饪过程1、炒锅里倒一点点点油，然后开火热锅，把肉皮先倒进去翻炒，加入没过肉皮的开水，盖上盖子慢慢焖，期间不定时翻一下在焖的肉皮2、大约 6\\~7 分钟后汤汁已经被肉皮吸收的差不多了，把肉皮向四周拨开，把粉丝加到中间的汤里煮熟焖好的肉皮放入粉丝进去煮3、加入调好的酱料，虾皮，翻炒均匀，这个阶段会彻底收汁，最终会变成很干的煸炒的感觉，注意手速，避免糊锅！撒上虾皮倒入酱料4、装盘后撒上葱花，搞定！撒上葱花沙茶风味我超爱！好好吃"
  },
  {
    "slug": "shacha-dansi-chao-mifen",
    "title": "省钱菜谱：2.6元的沙茶蛋丝炒米粉（10min）",
    "desc": "中午起来有点晚，冰箱里只有生菜和鸡蛋，家里还有米粉，炒个半斋的米粉吃哈哈哈，因为没有肉，所以今天没加辣椒酱，用的沙茶酱炒。",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230107154722.jpg?x-oss-process=image/interlace,1",
    "content": "中午起来有点晚，冰箱里只有生菜和鸡蛋，家里还有米粉，炒个半斋的米粉吃哈哈哈，因为没有肉，所以今天没加辣椒酱，用的沙茶酱炒。成品图：沙茶蛋丝炒米粉## 主要食材1、潮州细米粉，我妈寄给我的，所以没花钱2、鸡蛋 2 个，买的一盘 30 个鸡蛋，算下来 8 毛一个3、干香菇拿 2 \\~ 3 朵4、生菜掰了 3 片，和香菇算一起 1 块钱吧5、葱一棵6、沙茶酱7、盐8、鱼露## 处理食材1、细米粉是晒干的，煮一电热壶开水，淋上去烫一下就软了，就可以捞干备用，不用煮2、干香菇也是用热水泡开，切成细丝备用3、鸡蛋打散，加入适量鱼露调味（没有鱼露换成生抽酱油这种液体调味料也可以的）4、生菜洗净，适当切碎备用5、葱也是切寸段备用，葱管太粗的话可以再破开对切## 炒米粉过程电磁炉全程都是开了 800W 的温度。1、炒锅先加一点点油热锅，先把蛋液倒进去，旋转炒锅让鸡蛋尽量摊开变成蛋皮（因为是电磁炉，所以没办法和我妈用煤气炉那样晃的超薄，所以蛋液也可以分两次倒），熟了就可以卷起来切成蛋丝备用2、炒锅继续加点油，油温上来后倒入香菇爆香，炒个十几二十秒就可以加一点盐调味，然后盛出来备用处理好的食材3、炒锅再加一点油，油温热了倒入米粉翻炒，如果锅铲不能把米粉弄散，可以用筷子辅助，炒散后倒入沙茶酱，再次翻炒均匀先把米粉炒散再加入沙茶酱一起炒4、把刚才准备好的蛋丝、葱丝、香菇丝、生菜碎一起倒下去翻炒均匀就可以出锅啦倒入食材翻炒均匀半斋的炒粉也好吃哈哈哈。好吃"
  },
  {
    "slug": "hongzao-yumi-gouqi-paigu-tang",
    "title": "菜谱：高压锅版红枣枸杞玉米排骨汤（25min）",
    "desc": "我中午下去买了玉米土豆还有排骨猪肉，然后就回来啦！哈哈哈要做一个遵纪守法的花臂小哥！今晚煲了个玉米排骨汤！（步骤和莲藕排骨汤差不多其实…",
    "cover": "https://cdn.chengpeiquan.com/img/2023/01/20230102224858.jpg?x-oss-process=image/interlace,1",
    "content": "我对厨具的购入一直很克制，能不买就不买，有的用就代替着用，不过前段时间为了炖药材，隔水炖锅要炖 9 个小时我一个人实在守不住了，终于在我妈的安利下入手了个电高压锅，厨房里终于多了个新成员。之前分享过一个电饭煲做排骨汤的版本，今天分享下高压锅版，步骤操作差不多，但时间缩短了很多，虽然高压锅煮的过程中没有翻滚沸腾，但一样很好喝哈哈哈。成品图：红枣枸杞玉米排骨汤## 主要食材1、排骨 1 条，买回来已经是剁好的小块2、甜玉米 1 根3、红枣若干，这次家里的枣比较小粒，加上冬天了，我就抓了 12 粒，汤会甜甜甜4、枸杞一小把5、花生米一小把（可不加，是我爱花生！6、葱 1 根7、姜 1 小块8、盐## 处理食材1、排骨先冲洗干净，再用清水浸泡大约 30 \\~ 40 分钟，泡掉血水和杂质2、花生米也提前浸泡几分钟，然后倒掉水备用排骨浸出血水3、泡干净的排骨放到汤锅里准备飞水，加入洗净切好的姜片，放入洗净的葱段，加水没过排骨，电磁炉开大火煮到接近沸腾就可以关火，捞走表面的浮沫，夹走葱段和姜片，转移到高压锅里准备飞水飞水完毕4、红枣洗净，用剪刀剪 1\\~2 个小口（枣太小粒就不单独去核了 -0-5、玉米洗净，用刀切成小段## 煲汤步骤把焯好的排骨、花生米、红枣、玉米都放到高压锅里，开煲汤键就可以了。煲汤之前整个过程等 25 分钟就煲好（枸杞不耐炖，等出锅再下）。25 分钟就搞定## 开锅注意事项虽然高压锅煲汤很快，但是等开锅挺慢的，锅里是液体所以不能去拨动限压阀排气，不然放气的时候水会喷出来。正确的做法是先拔掉电源，弄两条湿抹布盖上去降温，加快浮子落下，这个过程大约 20 分钟。盖上两条湿抹布降温出锅的汤盛汤的时候，碗底先加盐，还有枸杞，用汤勺先舀几勺汤把盐化开，再盛汤。汤很甜哈哈哈哈"
  },
  {
    "slug": "nanru-jiang-jichi",
    "title": "菜谱：鸡翅和酱都很下饭的南乳酱鸡翅（20min）",
    "desc": "今晚做了个南乳酱鸡翅，做法有点像可乐鸡翅，喜欢腐乳味的话可以尝试下！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/12/20221203233821.jpg?x-oss-process=image/interlace,1",
    "content": "我差不多一个半月没冒泡了，这段时间真的是一次饭都没有做，因为我之前写的一本开源的技术书被出版社看上了，签了合同准备出版，最近几个月特别忙就是在补充新内容和全书检查，并按出版社的作者手册改稿，早赶晚赶终于在合同约定的截稿时间前给过去了，粗略算了一下大概 32 万字吧，改完的那一瞬间内心只有一个想法： (:з)∠) 我再也不想写字了…我感觉我这段时间很有天时地利人和：上个月因为广州的疫情影响不能出门，公司干脆给我们放了几天假，所以我也有了充足的时间写东西，不至于晚上开夜车早上还要六点多起床（黄埔回天河上班好远哈哈哈哈），这是天时人和；然后我在黄埔一直是安全区，所以周边买东西还有快递上门什么的也没有影响，居家真舒服，这是地利。今晚做了个南乳酱鸡翅，做法有点像可乐鸡翅，喜欢腐乳味的话可以尝试下！成品图：南乳酱鸡翅## 主要食材1、鸡翅中若干个2、蒜头三四瓣3、红腐乳（广东这边也叫南乳4、白砂糖或冰糖5、老抽酱油（上色用另外准备厨房纸巾用来吸干鸡翅的水份，还有提前煮一壶开水备用。## 处理食材1、鸡翅洗干净，两面各划两刀，腐乳味道重所以没有额外做其他处理，怕腥可以再加点料酒先抓一抓2、蒜头去皮备用处理好的鸡翅和蒜头3、今晚鸡翅比较多，所以我取了三块腐乳，先捣碎，再加入三平勺的白砂糖，继续拌匀（鸡翅比较少就两块腐乳和两勺糖就可以啦取了三块腐乳捣碎后加入白砂糖最终弄好的南乳酱## 烹饪过程1、炒锅倒一点油，电磁炉 800W 开火热锅，等油温上来才可以下鸡翅，不然会粘锅（可以伸手到锅上方感受下温度试探油温2、鸡翅用厨房纸吸干水份再下锅，先慢慢煎到两面金黄，再倒入开水，没过鸡翅就行煎鸡翅3、把腐乳酱倒进去，再加入半勺老抽酱油，扔入蒜瓣，翻炒均匀之后慢慢熬刚开始熬4、等水差不多收干了，转 1300W 进行大火收治，就可以出锅了！准备收汁出锅鸡翅和锅里的酱汁都可以装盘，酱汁淋饭也好吃哈哈哈！搞定出锅哈哈哈哈"
  },
  {
    "slug": "chaoshan-caitou-jiaozi",
    "title": "菜谱：鲜甜可口的潮式菜头饺（60min）",
    "desc": "“菜头”在潮州话里是指萝卜，不带颜色就默认是白色，像胡萝卜就会带上颜色称为“红菜头”，所以来潮州看到说“白菜头”不要以为是白菜的头哈哈哈哈，两者毫无关系~",
    "cover": "https://cdn.chengpeiquan.com/img/2022/10/20221023212711.jpg?x-oss-process=image/interlace,1",
    "content": "“菜头”在潮州话里是指萝卜，不带颜色就默认是白色，像胡萝卜就会带上颜色称为“红菜头”，所以来潮州看到说“白菜头”不要以为是白菜的头哈哈哈哈，两者毫无关系\\~其实比较常见的还是“菜头粿”，就是传说中的萝卜糕，“菜头饺”比较少见，我是没有买过，我家里都是自己包，所以也说不上什么正不正宗之类的，看个人喜好吧！菜头饺我没有用很多香料，所以吃起来会有白萝卜本身的鲜甜感，特别是煎饺，更好吃！成品图：包好的菜头饺## 主要食材1、白萝卜一大条，称了一下是一斤多点2、干香菇几朵3、猪肉约半斤4、饺子皮一斤5、姜一大块6、香葱两颗7、虾皮一大把8、盐9、胡椒粉10、鱼露（肉馅调味用）饺子皮本来想买散装的可以刚好一斤，结果没了，只好买了这种包装的饺子皮， 330克 一盒，买了两盒，实际上也就用了差不多一斤的量，一共包了 60 个饺子，我自己刚好吃三顿，一顿平均下来大概 8 块钱。## 处理萝卜干香菇先用开水泡发，然后处理萝卜：1、白萝卜削皮，先用擦丝器擦成萝卜丝，洗净后控干水份用擦丝器擦成萝卜丝2、给萝卜丝加入两调味盒小勺子的盐，揉搓出多余的水份，萝卜本身的腥气也会在这个步骤去掉不少加入两调味盒小勺子的盐揉搓出多余的水份3、挤干萝卜丝的水份，在砧板上再切细腻一些（可以用“压刀法”很好切，就是右手握刀把，左手靠住刀背，压着切）萝卜丝可以挤出很多水份这个时候香菇也泡好了，切成香菇粒备用。香菇切粒拿出炒锅，倒入平时炒菜用量的油，可以偏少一点，开火热锅，油温上来了先把香菇爆香。爆香香菇倒入已经挤干水份并切好的萝卜丝，翻炒几十秒就可以关火，在炒锅里摊开冷却。萝卜丝炒熟后摊开冷却## 处理其他食材1、把姜和葱都切小，丢入拉蒜器弄成姜葱泥（如果没有就用刀剁\\~），倒在炒锅里弄成姜葱泥2、抓一把虾皮，撒上一层胡椒粉，把萝卜和这些配料拌匀，继续摊开冷却撒上虾皮和胡椒粉拌匀继续冷却其实这个时候也可以当斋饺子馅包了！3、接下来弄肉馅，猪肉剁成肉末，加入鱼露调味，这个时候萝卜也冷却好了，猪肉弄散后和萝卜拌匀，馅料就调好了最终的馅料## 包饺子包饺子要准备一碗清水，用来黏合饺子皮。先拿一张饺子皮，用手指头给它四周刷一圈清水，用勺子盛适量的馅料放中间。准备包先提起中间并黏合在一起。先提起中间并黏合在一起右下角用手指和拇指捏起来，形成一个封闭的角。右下角用手指和拇指捏起来右上角用食指、中指、无名指一起，从外往内推，大拇指则同时从内往外，将其闭合。闭合右上角另外一边也是这样包起来，饺子就包好了！包好的饺子## 最终成品我是用的蒸架和蒸笼布，电磁炉开 800 瓦蒸 10 分钟就可以，这是出锅的蒸饺：刚出锅的蒸饺蒸好后晾一下，让饺子皮更韧，好吃！蒸菜头饺酥脆的煎饺也好好吃！煎菜头饺"
  },
  {
    "slug": "tudouli-kao-xinaoerliang-paigu",
    "title": "菜谱：土豆粒烤新奥尔良排骨（30min）",
    "desc": "做完卤肉实在没忍住哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈，切了一块卤肉，吃个宵夜！！！这个点最好的搭配就是潮汕粿汁了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/10/20221003221155.jpg?x-oss-process=image/interlace,1",
    "content": "我的脚终于可以好好走路了，也可以正常吃喝了，捱了大半个月的白粥和麦片的清淡饮食，今天才正式开火做饭…今天是认识7年之久的女兄弟来家里探望我，妹子昨天点名要吃烤土豆，所以搞个土豆粒烤新奥尔良排骨，好好吃！今天的午餐## 主要食材1、排骨一条2、土豆一颗3、新奥尔良腌料## 处理排骨排骨要提前一晚上准备，因为要腌制入味。1、排骨先洗净，用清水浸泡 30 到 40 分钟，把血水和杂质浸出来，再次洗净漂亮的排骨浸出血水2、撒上一层新奥尔良腌料，抓匀，再撒上一层腌料再抓匀就可以了3、放到保鲜盒里冷藏一晚上抓匀了腌料的排骨## 处理土豆土豆洗净，削皮，切滚刀块即可## 烤制过程1、空炸炸锅的炸篮先铺上锡纸，尺寸是可以大约包住食材又不会全包，不用特别大，用熟悉的厨具应该很好控制尺寸哈哈哈2、土豆先铺在底部，再码上一层排骨，先半包状态恒温 200 度烤 15 分钟先铺土豆再码排骨第一次先半包烤3、第一轮烤好后，给排骨翻一下面，这一次不包住，烤 10 分钟第一轮出炉的样子翻一下面，这样敞开了烤4、第二轮烤好后排骨就可以先装盘了，剩下的土豆再烤它 5 分钟就搞定！土豆再继续烤一下平时都是在我的电脑桌拍照，有落地灯打光，今天在饭桌上就随便拍了哈哈哈，请不要在意今天的风格不同…搞定装盘"
  },
  {
    "slug": "chaoshan-yuwan-mian",
    "title": "菜谱：简简单单的潮汕鱼丸面（10min）",
    "desc": "昨天打边炉还剩了一些丸子，今晚煮个鱼丸面，潮汕的鱼丸也很好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/09/20220912203715.jpg?x-oss-process=image/interlace,1",
    "content": "昨天打边炉还剩了一些丸子，今晚煮个鱼丸面，潮汕的鱼丸也很好吃！成品图：潮汕鱼丸面## 主要食材1、鱼丸2、面条今天的汤底是：1、鱼露2、胡椒粉3、芹菜（一棵就够用，洗净切碎）汤底搭配其他调味品是：1、蒜头朥（我的调味品收藏夹有做法）2、芝麻香油## 制作过程1、汤锅的水先不用很多，大概能淹没面条就可以，把水煮开了下面条第一次水不用多2、煮到沸腾了再加一碗冷水，继续沸腾了就再加一碗，一共加两次冷水，目的是让面条可以煮的更软3、加第二碗冷水的时候可以把鱼丸也一起放下去煮（如果是冷冻的可以提前解冻下）把鱼丸也一起放下去煮4、沸腾后不定期用筷子划几下，再煮个两三分钟就可以了煮的时候一直是盖着锅盖，这样东西才容易熟\\~兑好汤底装碗后把面条和汤底拌匀，再淋上香油和蒜头朥，搞定！Q弹的鱼丸好好吃"
  },
  {
    "slug": "baocaisi-chao-guotiao",
    "title": "省钱菜谱：3.5元的包菜丝炒粿条（5min）",
    "desc": "下午物业在小区里举办了一个沙井盖美化的活动，好多小朋友画了很可爱的图案，有我喜欢的哆啦A梦和海绵宝宝哈哈哈哈，居然还有滑稽表情，也解决了我住了三个月以来的疑惑，哈哈哈哈我就说怎么看到有一些沙井盖还有图案，是有人偷偷去画的还是咋地，原来是物业组织的，好玩！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/08/20220827223411.jpg?x-oss-process=image/interlace,1",
    "content": "下午物业在小区里举办了一个沙井盖美化的活动，好多小朋友画了很可爱的图案，有我喜欢的哆啦A梦和海绵宝宝哈哈哈哈，居然还有滑稽表情，也解决了我住了三个月以来的疑惑，哈哈哈哈我就说怎么看到有一些沙井盖还有图案，是有人偷偷去画的还是咋地，原来是物业组织的，好玩！然后两三周前一位北方的小姐姐问我网购的真空包装的粿条好吃吗，我当时跟她说我买过一次美团买菜的粿条，口感不如菜市场档口的，她说好可惜那边的菜市场买不到，今天刚好美团买菜的免费菜有粿条可以选，我就又选了它，其实再试了一下也还可以吧，虽然始终不如菜市场档口现做的，但也不是完全不能接受，就是做法上需要注意一些区别，今天整理一下用这种粿条的做法。成品图：包菜丝炒粿条## 主要食材1、粿条一包，今天是真空的包装版，0 元，有条件就直接买菜市场现做的，也就 2 \\~ 3 元一大把，除非像我这种情况不花钱才选择包装版2、平包菜，今天这个 4.4 元，比较大我就分成了三次，今天是 1.5 元3、瘦肉，分切了大约 2 块钱的分量4、老抽酱油 1 勺5、沙茶酱 1 勺白嫖的粿条## 准备食材1、这种真空包装的粿条要先轻轻拆开，不能够像菜市场买的新鲜粿条一样直接下锅，拆的时候可以稍微抖一抖，让它自然松散2、平包菜切细丝，然后洗净，可以用笊篱捞出来挂在小碗上滴干水3、瘦肉切薄片4、老抽加入一勺热水稀释，这样粿条容易均匀挂色，也不会因为用量太多炒出来太黑5、沙茶酱也加入一勺热水化开，拌匀准备好的食材## 炒菜过程材料分开调味，所以每一种不需要加很多盐。1、炒锅热油，先把瘦肉炒熟，加一点点盐调味后盛出来备用先把瘦肉炒熟2、继续热锅，把包菜丝炒熟，因为我们切了细丝，所以不到一分钟就变软变得很翠绿，就熟了，也是加一点点盐调味，盛出备用下包菜丝炒到变软又翠绿把锅洗干净，用厨房纸擦干净水，重新倒油热锅，准备炒粿条。1、油锅很热了才下粿条，这样就不会粘锅，翻炒的时候可以用锅铲轻轻把粿条来回的继续推松散，这种真空包装的粿条受热后也会自己散开先把粿条弄散2、只要动作不是很大，或者是前面拆碎了，粿条还是可以保持原来的造型的，都散开之后，下老抽，翻炒均匀上色均匀上色3、然后把瘦肉和包菜丝倒下去，沙茶酱也倒进去，所有材料都倒进去翻炒均匀就可以出锅了！翻炒均匀炒出来很好吃哈哈哈！粿条搭配包菜丝很赞！粿条搭配包菜丝很赞！"
  },
  {
    "slug": "wawacai-fensi-men-roupi",
    "title": "娃娃菜粉丝焖肉皮（15min）",
    "desc": "今晚做个娃娃菜粉丝焖肉皮，也是潮州老家的特色做法，最近买了砂暴肉皮（之前是油炸的），虽然贵了好多，但确实是更好吃！这道菜做法简单，就是备料的时间比较久，都是需要花时间提前浸泡。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/08/20220814001629.jpg?x-oss-process=image/interlace,1",
    "content": "安利一部今年 5 月份的新电影《远山淡影》，根据公安部刑侦八虎之一的张欣前辈的真实事迹改编的（张欣前辈 2018 年因劳累过度逝世了…），我平时的碎片时间除了刷些技术资料，最喜欢看的就是法医和刑侦的案件了，看的时候自己也是一身正气无所畏惧，对刑侦八虎的破案记录尤其喜欢（之前的电视剧《开端》也是根据他们的破案记录改编的！今晚做个娃娃菜粉丝焖肉皮，也是潮州老家的特色做法，最近买了砂暴肉皮（之前是油炸的），虽然贵了好多，但确实是更好吃！这道菜做法简单，就是备料的时间比较久，都是需要花时间提前浸泡。成品图：娃娃菜粉丝焖肉皮## 主要食材1、肉皮 1 片（买整张的话要掰碎，比巴掌大的一片就够一盘）2、娃娃菜 1 颗3、干香菇几朵4、龙口粉丝 1 把5、虾皮 1 把6、蚝油 1 勺7、鱼露 1 勺一块完整的肉皮## 处理食材1、备料和做菜过程需要用到比较多的热水，电热壶提前烧好水。2、肉皮买回来是硬邦邦的，因为这次是砂暴做法的肉皮，成品更硬，所以要用热水泡软，我是泡了大约 1 小时，然后挤掉大部分水份，切滚刀块备用肉皮提前泡水泡到很软3、龙口粉丝用温水浸泡约 15 分钟，然后捞干备用4、干香菇用热水浸泡约 10 分钟，然后挤掉水份，切丝备用5、娃娃菜掰叶子，然后洗净，切去根部然后再顺着叶子对半切今天是周末有空哈哈哈，其实肉皮泡半小时左右也可以的，如果买的是油炸的肉皮时间还可以更短一些，然后我明天还想吃，所以泡多了一块。准备好的食材## 焖制过程1、炒锅加一点点油，把香菇丝爆香，然后盛出来备用香菇爆香2、锅里的油继续用，把娃娃菜放进去翻炒几下，倒入半碗热水，煮到娃娃菜变软翻炒娃娃菜加水炒到变软3、然后把肉皮、香菇丝、粉丝、虾皮都加进去加入各种材料4、蚝油用小半碗热水化开，也倒进去倒入蚝油5、翻炒均匀，如果水不够就继续加热水淹没食材，盖上锅盖焖盖上锅盖焖6、期间不定期翻一下，水差不多被收干了的时候，倒入鱼露翻炒均匀，就可以出锅了可以出锅了因为食材比较多，而且吸汁能力比较强，所以调味品都是用液体调味品，有鱼露用鱼露更鲜美，或者是生抽也不错，如果用盐的话我建议也是先用水化开，不然怕味道不均匀！好吃哈哈哈哈"
  },
  {
    "slug": "baizhou-lin-jiangyou",
    "title": "😂难受时最爱的晚餐：潮州特色·南时油",
    "desc": "hhhhh “南时油” 是潮州话的读音，实际上就是白粥淋酱油，超级简单！煮碗白粥，淋上两勺酱油就超级无敌美味！！！特别适合身体不舒服的时候吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/08/20220814004625.jpg?x-oss-process=image/interlace,1",
    "content": "🤣🤣🤣hhhhh “南时油” 是潮州话的读音，实际上就是白粥淋酱油，超级简单！煮碗白粥，淋上两勺酱油就超级无敌美味！！！特别适合身体不舒服的时候吃！昨晚睡觉的时候空调忘记定时，然后今天又被公司的中央空调吹了一天，就头很晕，晚上实在不想吃饭，还是饿着肚子从天河坐一个小时地铁回萝岗，到家再自己煮粥！到家先煮粥，喂了美国佬和英国佬还有俄国佬，然后去洗了个舒服的热水澡，吹完头发粥刚好好了，吃完好舒服！！！！！我好了哈哈哈哈哈哈哈哈哈哈复活了！！！！做法超级简单，煮一碗白粥。白粥淋上两勺酱油（我用的味极鲜酱油）淋上酱油就可以吃了！潮汕的小孩应该都吃过！好好吃！"
  },
  {
    "slug": "donggua-paigu-tang",
    "title": "天热消暑！煲个冬瓜排骨汤（1h）",
    "desc": "-0- 今天感觉有点上火，可惜附近没有凉茶店（也不是完全没有，配送费 7 块钱实在太贵…），不然一瓶癍痧凉茶就很爽了！所以今晚煲个冬瓜汤来吃吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/08/20220807205511.jpg?x-oss-process=image/interlace,1",
    "content": "-0- 今天感觉有点上火，可惜附近没有凉茶店（也不是完全没有，配送费 7 块钱实在太贵…），不然一瓶癍痧凉茶就很爽了！所以今晚煲个冬瓜汤来吃吃！成品图：冬瓜排骨汤## 主要食材1、排骨一条2、冬瓜半圈下面是排骨焯水用的：1、葱一棵2、姜一小块下面是用来做汤底的：1、虾皮一小撮2、冬菜一小撮3、香菜一颗4、葱一颗5、胡椒粉6、鱼露这个是冬菜，潮汕这边常用的一种调味品。这个是冬菜## 处理食材1、排骨提前用清水浸泡半小时到 40 分钟，然后倒掉浸出的血水和杂质，再次洗净浸泡排骨2、排骨放汤锅，加清水淹没，放入葱和姜片，大火煮开到沸腾就关火，把姜葱夹出来，浮沫去掉，然后排骨和汤倒进炖锅里排骨焯水3、刚才在给排骨焯水的时候可以切冬瓜，把皮和瓜瓤去干净，切小块然后洗净半圈冬瓜去皮和瓜瓤，切小块4、冬瓜和排骨一起在炖锅里，开煲汤模式炖 1 小时放炖锅里这个时候可以去煮饭了，然后顺便下楼测个核酸…## 出锅汤底炖好了再弄汤底，掀开炖锅盖子就会闻到一股冬瓜的清香好棒！1、切葱花、香菜叶弄碎，把冬菜、虾皮、鱼露、胡椒粉都一起放大碗里汤底材料先准备好2、先用汤勺把汤底兑好，再把排骨和冬瓜捞出来兑汤底舀匀，done!很好吃"
  },
  {
    "slug": "jinzhengu-feiniu-fanqie-tang",
    "title": "金针菇肥牛番茄汤（10min）",
    "desc": "这个周末热到开着空调也要打赤膊了…然后因为长发贴着后背，才发现我的头发已经过腰了！！！虽然只有最中间的那一撮…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/07/20220731213919.jpg?x-oss-process=image/interlace,1",
    "content": "这个周末热到开着空调也要打赤膊了…然后因为长发贴着后背，才发现我的头发已经过腰了！！！虽然只有最中间的那一撮…因为当初决定留长发的时候还是莫西干发型，就是中间留长，两侧推光，所以两侧都还比较早，最短的才刚过肩膀 5 公分左右，任重道远啊！成品图：金针菇肥牛番茄汤## 主要食材1、肥牛卷若干2、金针菇 1 把3、爆汁番茄 2 个4、番茄酱5、盐6、白砂糖## 处理食材先煮一电热壶的开水备用。1、番茄洗干净，对半切，把番茄汁都挤大碗里，然后切小块再剁的很细腻（有拉蒜器就更方便了）剁好的番茄2、在汤锅先把肥牛卷烫熟，捞掉浮沫后，把金针菇也焯水 2 分钟，都捞干备用（菌菇类焯水后的水不要再用，所以我都是先烫肥牛）准备好的食材## 煮汤过程1、炒锅加一丁点的油热锅，番茄先倒进去翻炒几下，加入一碗开水，再挤入番茄酱番茄先倒进去翻炒几下挤入番茄酱汤底就很棒了！2、煮开了就放入金针菇和肥牛放入金针菇和肥牛3、再次煮开就加入一丁点的盐和糖调味，翻匀出锅准备出锅## 最终成品很开胃的番茄汤！肥牛配番茄好好吃！很开胃的番茄汤肥牛配番茄好好吃"
  },
  {
    "slug": "shajiang-shousi-jitui",
    "title": "省钱菜谱：11.5元的沙姜手撕鸡腿（35min）",
    "desc": "今晚做个沙姜鸡腿，沙姜的味道和普通的生姜是不一样的，粤菜挺常用的，沙姜鸡、沙姜猪手啥的，因为冰箱里有上周买的冷冻琵琶腿，所以先搞个鸡来吃吃~",
    "cover": "https://cdn.chengpeiquan.com/img/2022/07/20220723213517.jpg?x-oss-process=image/interlace,1",
    "content": "今晚做个沙姜鸡腿，沙姜的味道和普通的生姜是不一样的，粤菜挺常用的，沙姜鸡、沙姜猪手啥的，因为冰箱里有上周买的冷冻琵琶腿，所以先搞个鸡来吃吃\\~今晚这餐是 11.5 元，说贵也不算贵吧，所以还是归类到省钱菜谱里面去，好久没更新这一系列了，这两个月太忙了，所以没有太花精力去对比采购食材，只想躺着然后玩玩游戏哈哈哈…成品图：沙姜手撕鸡腿## 主要食材琵琶腿 4 个（刚好 1 包就是 4 个主要是），折后 9.5 块钱下面是用来做蘸料的：1、沙姜约一两，约 2 块钱这是沙姜2、葱一颗3、指天椒一颗4、白砂糖少许（提鲜用的，不用多）5、盐少许（提鲜用的，不用多）6、老抽酱油约 0.3 勺7、生抽酱油 1 勺另外准备芝麻香油用来抹鸡腿\\~## 处理鸡腿1、鸡腿因为是冷冻的，所以泡水解冻，软了之后用牙签扎几个孔，继续泡出血水2、然后洗净，用刀划成扇型，装盘上锅，开 800W 蒸 30 分钟划开呈扇形哈哈哈皮朝上呗上锅蒸3、时间到了就夹出来，抹上香油，冷却了之后去掉骨头，撕成小块装盘撕小块装盘## 制作蘸料1、鸡腿快蒸好了的时候就可以弄弄蘸料，把沙姜、指天椒、葱都洗净，切小块之后处理成末状2、把姜末、葱末 、椒末放碗里，撒上上面提到的调味料备用姜末、葱末 、椒末3、这个时候鸡腿也蒸好了，换上炒锅，起锅热油（油量不用多，大概能 Hold 住你的姜末葱末分量就可以）4、油温上来了就关火（可以伸手感受温度），淋上去把姜末葱末这些烫熟，拌匀，搞定！伸手感受温度烫熟拌匀搞定## 最终成品这个真的很好做，没有什么难度，又好吃！蘸料和鸡哈哈哈哈哈我是为了拍照所以淋了一些沙姜酱上去，蘸着吃更好吃！淋了点沙姜酱上去非常好吃！"
  },
  {
    "slug": "yangcongsi-chao-feiniu",
    "title": "黑椒蚝油洋葱丝炒肥牛（15min）",
    "desc": "话说我现在住的这层楼和楼上楼下的邻居，我感觉素质都是相当的好，回广州这一个多月非常非常非常的安静，住的非常的清心！虽然我知道有好几个家庭还有小孩子（有一天上班在电梯里还被邻居小妹妹碰了碰我的文身然后问我，叔叔你手上是一只猫猫吗，我说是，我养了三只大猫猫），但真的很安静。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/07/20220717214257.jpg?x-oss-process=image/interlace,1",
    "content": "话说我现在住的这层楼和楼上楼下的邻居，我感觉素质都是相当的好，回广州这一个多月非常非常非常的安静，住的非常的清心！虽然我知道有好几个家庭还有小孩子（有一天上班在电梯里还被邻居小妹妹碰了碰我的文身然后问我，叔叔你手上是一只猫猫吗，我说是，我养了三只大猫猫），但真的很安静。所以我买了一个拉蒜器，想着做饭能安静点也一起保持安静点好（也不是说剁东西不好，还是看周围的情况吧，像我之前在深圳住的那个城中村公寓就很吵闹，所以就无所谓啦！），平时像做蒜蓉什么的，我就不自己剁了，今天第一次用，感觉还不错！成品图：黑椒蚝油洋葱丝炒肥牛## 主要食材1、肥牛卷若干2、洋葱一个3、蒜头 4\\~5 瓣4、蚝油一勺5、生抽酱油大半勺6、老抽酱油约 0.3 勺7、黑椒粉大约 0.3 勺8、淀粉约 0.3 调味盒的小勺子## 处理食材1、先煮水把肥牛烫熟，夹出来备用把肥牛烫熟2、蒜头去皮，然后处理成蒜末用拉蒜器很方便哈哈哈超级快最主要的是很安静3、和蚝油、酱油、黑椒粉一起放小碗里，加三勺热水搅拌均匀做好调料汁做调料汁4、洋葱去掉外衣和头尾，纵向对半切，再放平切，拆散后就变成洋葱丝了，然后洗干净滤干水5、淀粉加一点点水做成水淀粉备用准备好的所有食材## 烹饪过程1、炒锅倒点油，开 800W 热锅，油温上来了倒入洋葱丝翻炒倒入洋葱丝翻炒2、翻炒到洋葱丝变软快熟了，倒入肥牛和调料汁，翻炒均匀洋葱丝变软快熟了倒入肥牛和调料汁3、等食材和调料汁都上色均匀之后，倒入水淀粉，开大火快速翻炒（我开到 1300W ）做一个大火收汁大火收汁4、汤汁快收干了就可以关火装盘了装盘"
  },
  {
    "slug": "liangban-shacha-feiniu",
    "title": "凉拌沙茶肥牛（5min）",
    "desc": "今晚还是吃肥牛！不过换了一个做法，做成了凉拌！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/07/20220717214204.jpg?x-oss-process=image/interlace,1",
    "content": "今晚还是吃肥牛！不过换了一个做法，做成了凉拌！成品图：凉拌沙茶肥牛## 主要食材1、肥牛卷若干2、沙茶酱一勺3、生抽酱油半勺4、芝麻香油一勺5、黑椒粉6、葱一根7、香菜一颗8、白芝麻## 处理食材先煮一电热壶开水备用\\~1、肥牛卷先烫熟，夹出来备用（就跟吃火锅一样烫熟就可以了，然后我是用笊篱捞）烫熟的肥牛2、沙茶酱先用开水弄稀，然后撒上适量的黑椒粉，还有生抽，再次拌匀3、葱和香菜都洗净弄碎## 简单凉拌哈哈哈哈哈哈超级简单的步骤！1、把葱碎和香菜碎撒在肥牛卷上面撒上葱碎2、撒上白芝麻撒上香菜碎和白芝麻3、淋上沙茶酱和香油淋上沙茶酱还有香油拌匀！done！美味！！！"
  },
  {
    "slug": "jinzhengu-fanqie-feiniu-mian",
    "title": "金针菇番茄肥牛面（15min）",
    "desc": "在“失踪”了三周之后，我终于又有点时间做饭了… 忙飞了最近，上周末本来想做饭的，结果又回公司加了一天班，所以又没做哈哈哈哈 -0-",
    "cover": "https://cdn.chengpeiquan.com/img/2022/07/20220717215801.jpg?x-oss-process=image/interlace,1",
    "content": "在“失踪”了三周之后，我终于又有点时间做饭了… 忙飞了最近，上周末本来想做饭的，结果又回公司加了一天班，所以又没做哈哈哈哈 -0-感谢我师妹 @奶茶今天运动了没 让我肥牛自由！一大早的山姆配送！分量真的好大啊！好好吃！！！因为还吃了杂粮包（也好好吃！），所以中午煮了个面！成品图：金针菇番茄肥牛面## 主要食材1、肥牛卷若干2、爆汁番茄一个3、金针菇一把4、番茄酱（对\\~ 要搭配一起提高番茄味！）5、芝麻香油6、葱一根山姆的肥牛一盒好多啊啊啊## 处理食材1、先煮一电热壶的开水备用（哈哈哈因为我的电热壶煮水比汤锅快多了），煮水的时候可以去洗金针菇2、开水倒到汤锅里，开 800W 继续煮着，先把肥牛放下去烫熟，然后夹出来到盘子里备用3、用勺子捞走汤锅里的浮沫（煮完肥牛会有很多浮沫），然后把金针菇倒进去，还是开 800W 倒计时 3 分钟焯水金针菇焯水4、焯水期间可以去切番茄，先对半切，把番茄汁挤到小碗里，然后切成小块备用切番茄5、焯好水的金针菇也是夹出来到盘子里备用## 煮面条1、换上炒锅，倒一点点油（非常少就可以，主要我的是铁锅，没油不行，防粘锅）2、番茄和小碗里的番茄汁一起倒进去，翻炒几下翻炒一下番茄3、倒入一碗开水，挤入适量的番茄酱（看个人口味加，我挤了好多哈哈哈）挤番茄酱4、翻炒均匀后，把面条也放进去煮，煮软了就盖上锅盖焖，期间不定期用筷子拨一下避免粘锅，顺便适量加水丢面条进去先煮软盖上锅盖焖5、等面条快煮好了，金针菇也放进去一起再煮一下，比较有味道金针菇也放进去一起再煮一下6、然后就可以装大碗里了，最后码上肥牛，淋一点芝麻香油，撒上葱碎（今天的葱是先切细丝，再用厨房剪刀剪碎的，所以造型比较别致）调味方面只需要番茄酱就可以了，番茄肥牛特别好吃！！！特别好吃！"
  },
  {
    "slug": "shachajiang-bian-jiding",
    "title": "省钱菜谱：6.5元的沙茶酱煸鸡丁（6min）",
    "desc": "上周末买的鸡胸肉，今天才有时间做哈哈哈哈… 我现在工作日做不了饭了，虽然新公司还是一如既往的可以 6 点半下班，但从天河回到黄埔，怎么快也要差不多 8 点到家，加上最近赶 App 版本开发，每天也会再加加班，所以现在都是在公司先吃完饭再回来了。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/06/20220625180935.jpg?x-oss-process=image/interlace,1",
    "content": "上周末买的鸡胸肉，今天才有时间做哈哈哈哈… 我现在工作日做不了饭了，虽然新公司还是一如既往的可以 6 点半下班，但从天河回到黄埔，怎么快也要差不多 8 点到家，加上最近赶 App 版本开发，每天也会再加加班，所以现在都是在公司先吃完饭再回来了。安利一首天谴乐队的新歌《湮灭之城》，6 月 20 号才发的新单曲，喜欢旋律死亡金属音乐的可以听听哈哈哈！国内一支很有实力但还比较小众的旋死乐队\\~成品图：沙茶酱煸鸡丁## 主要食材1、鸡胸肉一块2、沙茶酱两大勺（鸡胸肉比较小块就适量减少）3、老抽半勺4、生粉（玉米淀粉）5、姜一小块6、蒜头两三瓣7、葱一根## 处理食材1、鸡胸肉解冻洗净，切成小丁，加一勺生粉抓匀腌制约 5 分钟（调味盒勺子）抓匀腌制2、姜切片，蒜头拍碎去皮3、沙茶酱加一勺热水化开后拌匀，再加入老抽再次拌匀，这样就不会太过于粘稠（也不要太稀，挂不住，提起勺子能顺畅滑下来就刚好）这个浓稠度就差不多4、葱切葱花（洗净刀再单独切，在砧板干净的角落切）准备好的食材## 烹饪过程1、油不用多，开 800W 热锅，油温上来了先下姜蒜下去爆香油不需要很多先爆香姜蒜2、鸡丁倒下去翻炒，先炒到变色，再继续慢慢煸先翻炒变色变白色说明熟了3、等到鸡丁表面都有焦焦的样子，再把沙茶酱倒下去继续翻炒继续炒到表面焦黄倒入沙茶酱4、翻炒均匀后就可以开大火（我开到 1300W ），走一轮大火收汁## 最终成品最后装盘，撒上葱花，done.很好吃哈哈哈潮汕特色风味"
  },
  {
    "slug": "tian-qiugualao",
    "title": "省钱菜谱：3块钱的潮州甜款秋瓜烙（10min）",
    "desc": "今天做个秋瓜烙，做法还是之前在潮州跟我妈学的，秋瓜烙有甜口味也有咸口味，今天做个甜的，配杯茶一起吃很赞哈哈哈哈哈哈哈…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/06/20220625183437.jpg?x-oss-process=image/interlace,1",
    "content": "今天做个秋瓜烙，做法还是之前在潮州跟我妈学的，秋瓜烙有甜口味也有咸口味，今天做个甜的，配杯茶一起吃很赞哈哈哈哈哈哈哈…吃的时候你可以夹一块然后用筷子稍微推成球，所以有时候我们也会叫它秋瓜丸，里面有花生碎，再沾上白芝麻，超级香！我最爱的 “酥、香、甜”三个味道它同时具备！成品图：潮州甜款秋瓜烙## 主要食材1、秋瓜一条2、花生一小把3、白砂糖4、红薯淀粉秋瓜是潮州对水丝瓜、肉丝瓜的统称，今天对标的是肉丝瓜这个品种，稍微贵点，买的时候要 3 块钱\\~用了这个大小的秋瓜## 先炸花生1、花生米先泡水，泡到用手可以直接把皮搓开，还可以把花生米直接用手指搓成两半轻松去皮搓成两半2、搓两半是为了省油，做秋瓜烙不需要很多油，并且等下好切（还要切碎），然后炒锅倒一点油，冷油下锅，开 300W 慢慢炸冷油下锅慢慢炸3、炸到稍微金黄就可以关火，靠预热继续加热到完美，装碗里冷却备用炸好了## 处理其他食材1、秋瓜洗净去皮，去头尾之后，用刮丝器把秋瓜肉拓成丝，中间那条带籽的白芯不要，拓好的秋瓜丝装大碗里备用去皮后拓成丝2、炸好的花生米也不烫手了，倒在砧板上，用狗头铡的姿势去把花生米切碎（这样就不会乱跳，也可以用我之前说的压刀法），切好之后撒在秋瓜丝上面切碎花生撒在一起3、撒上一层白砂糖，刚好一层就行，不需要特别多撒上一层白砂糖4、那个盛饭的小碗，我这个丝瓜分量刚好小半碗红薯淀粉，然后慢慢加水搅拌成浆（慢慢加，不要一次加太多，一开始筷子会搅不动，就继续加水，如果搅拌很顺畅，说明水刚好，就不能再加了，继续用加就太稀）这个分量差不多准备好的粉浆5、把搅拌好的粉浆倒入大碗里，跟丝瓜一起拌匀倒进去拌匀## 煎秋瓜烙1、刚才炸花生米的油继续加热，用手伸上去试探油温，油温很热就可以下刚才弄好的食材（不要热到冒烟）试油温2、倒下去的时候用筷子稍微把它们拨弄一下摊薄摊均匀（这个时候不要用锅铲，等下把锅铲粘的不成样子，用筷子就不会）烙秋瓜烙3、期间可以适当转一下锅晃一下，但先不要用锅铲去碰，红薯粉真的会很粘4、大概一分钟左右再用锅铲稍微试探，沿着四周慢慢铲一下，确认定型了再翻面煎5、另外一面也是如此，都定型了就可以装盘了翻面了## 最终成品撒上一层白芝麻就可以吃啦！哈哈哈甜款也很好吃！搞定！哈哈哈卷成秋瓜丸"
  },
  {
    "slug": "chaozhou-sunjiao",
    "title": "在广州新家做的第一顿晚餐：潮州笋饺",
    "desc": "回广州刚好半个月了，回来的第二天就被抓去新公司上班，所以收拾新家收拾了一周，上周端午假期也是一直在收拾，这个周末才开始正式在新家做饭了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/06/20220612015709.jpg?x-oss-process=image/interlace,1",
    "content": "回广州刚好半个月了，回来的第二天就被抓去新公司上班，所以收拾新家收拾了一周，上周端午假期也是一直在收拾，这个周末才开始正式在新家做饭了！！！还是广州适合生活，新家的环境好舒服，厨房台面也比深圳大了好多，照明也更好了！第一顿饭还是包饺子，看到有卖笋，今天包笋饺！也是我家乡的特色小吃！提前煮一电热壶的热水备用，需要准备一个笊篱用来捞笋粒，还有蒸饺子的三件套（蒸笼布、蒸架、蒸片）。## 主要食材1、笋，买大个点或者直接拿两三个，不然剥完壳没多少肉2、猪肉我今天买了一块梅头肉3、干香菇拿几朵4、虾皮，撒了三大把5、盐6、鱼露7、五香粉## 处理食材1、先把干香菇用热水泡着2、把笋肉切成笋粒，可以稍微剁一下细腻一些，然后把电热壶剩下的热水倒进汤锅里，笋粒倒进去，加一勺盐，电磁炉开 800W 倒计时 2min ，盖上盖子让它焯水3、期间把泡软的香菇控干水份，然后切成香菇粒，也可以稍微剁一下4、笋粒焯好水之后，去掉浮沫，用笊篱捞干到大碗里备用，焯水后的笋粒不会发苦了焯完水的笋粒5、换上炒锅，倒点油，还是开 800W 热锅，油温上来了就把香菇粒先倒进去爆香，再把笋粒也倒进去翻炒香菇粒先放下去爆香然后笋粒也倒进去炒6、笋粒炒熟之后，加一勺盐调味翻炒均匀（具体按照笋的分量是平时做菜的分量的几倍去控制加多少盐）7、撒上一层五香粉，撒上两三把虾皮（笋饺配虾皮或者虾米真的好好吃！多加点！！！）加多多多虾皮8、翻炒均匀后摊开降温晾凉降温晾凉9、然后就去剁肉馅了，肉馅还是加鱼露调味10、处理好肉馅之后，笋粒也降温的差不多了，一起拌匀就可以包饺子了！处理好的饺子馅## 饺子蘸料蘸料的话可以用浙醋 + 蒜头朥拌匀做饺子醋，笋饺配饺子醋很好吃！！！## 最终成品饺子的包法之前分享了很多次，老粉应该都不陌生了！今天不重复步骤了哈哈哈\\~包好的饺子## 蒸饺子因为笋已经处理过了，所以跟平时的韭菜饺子那些一样的温度和时间就可以，电磁炉 800W 蒸 10min 。蒸之前蒸好了稍微晾一下，让饺子皮再收缩一下再夹出来！蒸好了好好吃哈哈哈！！！好吃！"
  },
  {
    "slug": "heiyu-qiugua-tang",
    "title": "菜谱：黑鱼秋瓜汤（8min）",
    "desc": "上个周末回了趟广州，一下高铁就感觉回到了家一样，毕竟是我的第二故乡，这次回去是去看了下房子，然后准备回广州工作和生活啦！所以接下来这一个多星期会比较忙，笔记估计不太有时间整理（忙着工作和收拾东西hhh），不过评论和私信我都会回的哈哈哈…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220523233152.jpg?x-oss-process=image/interlace,1",
    "content": "上个周末回了趟广州，一下高铁就感觉回到了家一样，毕竟是我的第二故乡，这次回去是去看了下房子，然后准备回广州工作和生活啦！所以接下来这一个多星期会比较忙，笔记估计不太有时间整理（忙着工作和收拾东西hhh），不过评论和私信我都会回的哈哈哈…今晚的秋瓜也是上周买的，那天想着当天消灭掉，结果聚了个餐就打乱计划了，拿来煲个汤！成品图：黑鱼秋瓜汤## 主要食材1、秋瓜一条2、黑鱼片一盒（买的处理好的成品鱼片，做酸菜鱼的那种，无骨不腥，不用自己再加工）3、盐4、葱一根5、蒜头朥一勺6、香油一勺## 处理食材1、秋瓜刮掉皮，切成偏长条的滚刀块，洗净备用2、鱼片买来是冷冻的，解冻后过一下水冲一下备用3、切葱花主要食材## 煮汤过程今天用的炒锅煮的汤\\~1、倒一点点油，电磁炉开 800W 热锅，秋瓜先倒进去翻炒一下简单翻炒一下2、然后倒入水，淹没秋瓜就可以，盖上锅盖焖煮大约 5 分钟，不定期看一下秋瓜是不是软了，如果提前好就不用焖那么久加水盖上盖子焖3、等秋瓜都煮到很软嫩了，加入鱼片，拨弄一下不要黏在一起，也让鱼片淹没在汤里，再盖上盖子焖煮大约 2 分钟，鱼片很快熟秋瓜很软嫩了加入鱼片再焖一会就熟碗里加一点盐调味，然后汤倒到碗里，撒上葱花，淋上香油和蒜头朥，啧啧，搞定！出炉啦超简单！"
  },
  {
    "slug": "roumo-chao-qiugua",
    "title": "省钱菜谱：4块钱的秋瓜炒肉末（3min）",
    "desc": "我潮州家里是在顶楼，所以楼顶天台也是自家的一部分，我爸妈在楼顶除了种花，还砌了几个瓜斗搭了瓜棚，每年都会种秋瓜，虽然最开始是想着有个瓜棚可以避暑，后面种出来的秋瓜好甜真是意外收获哈哈哈，是我从小吃到大的一种瓜了！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220520232541.jpg?x-oss-process=image/interlace,1",
    "content": "本来想查一下学名，突然发现水瓜和丝瓜还不是同一种瓜吗？哈哈哈哈不管了，那就按照我大潮州的土话叫“秋瓜”吧…我潮州家里是在顶楼，所以楼顶天台也是自家的一部分，我爸妈在楼顶除了种花，还砌了几个瓜斗搭了瓜棚，每年都会种秋瓜，虽然最开始是想着有个瓜棚可以避暑，后面种出来的秋瓜好甜真是意外收获哈哈哈，是我从小吃到大的一种瓜了！成品图：秋瓜炒肉末## 主要食材1、秋瓜一条，刚好 1 块钱2、切点猪肉，大概 3 块钱3、鱼露 1 勺4、虾皮一小撮5、蒜头朥 1 勺（自己做的，在调味品菜谱分类里可以找到做法）## 处理食材1、秋瓜刮掉皮，切掉头尾，然后切成滚刀块，再洗净秋瓜2、猪肉切小片然后剁成肉末切好的秋瓜和剁好的肉末## 烹饪过程1、倒点油热锅（电磁炉我开 800W ），油温上来了就下秋瓜秋瓜下锅2、先翻炒着，等它慢慢变色，会变得翠绿翠绿很鲜艳开始变得很翠绿3、秋瓜炒的时候大部分会出水，如果买到不怎么出水的，可以自己适量加点水进去4、等秋瓜出水了，就可以下肉末炒熟下肉末炒熟5、最后加入一勺鱼露调味，再下点虾皮炒匀就搞定！加入鱼露和虾皮蒜头朥在装盘后再淋上去，吃饭的时候拌匀就可以了！嚯哈哈哈哈…最终成品"
  },
  {
    "slug": "chiyou-jiangcong-zhanliao",
    "title": "豉油姜葱蘸料 搭配白切鸡葱油鸡都好好吃！",
    "desc": "今晚做了个清蒸三黄鸡，搭配白切鸡的姜葱酱也很好吃，不过今晚搭配的酱料用了另外的做法，平时可以交叉换口味试试！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220514004419.jpg?x-oss-process=image/interlace,1",
    "content": "这个是蘸料的做法，搭配清蒸三黄鸡、白切鸡之类的比较清口的鸡一起做，等鸡好了的时候，将鸡汁或者鸡汤拿来兑制这个蘸料。成品图：豉油姜葱蘸料## 主要食材1、姜一小块2、葱一颗3、白砂糖4、生抽酱油## 处理食材提前先把姜葱都剁成末，放碗里备用。把姜葱都剁成末## 调制蘸料1、调料碗里加一点点白砂糖，加入 3 \\~ 4 勺生抽酱油2、等鸡蒸熟了或者炖好了，会有很多鸡汁或鸡汤，倒进调料碗里拌匀，就做好了蘸料最终做好的蘸料## 最终成品然后就开吃了哈哈哈，虽然时间会比较长，但跟煲汤一样其实很省事，整个过程只需要等就可以了，而且时间和煮饭差不多，刚好可以同时出锅开饭！绝美搭配这个蘸料好好吃"
  },
  {
    "slug": "qingzheng-sanhuangji",
    "title": "菜谱：清蒸三黄鸡（30min）",
    "desc": "今晚做了个清蒸三黄鸡，搭配白切鸡的姜葱酱也很好吃，不过今晚搭配的酱料用了另外的做法，平时可以交叉换口味试试！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220514003235.jpg?x-oss-process=image/interlace,1",
    "content": "没想到我不到三个星期的时间就看了 155 集《皆大欢喜》哈哈哈哈哈真是太好看了！！！还好一二两部加起来有七百多集，够我看好久，里面廖碧儿演的公主真的好可爱！笑起来好甜！今晚做了个清蒸三黄鸡，搭配白切鸡的姜葱酱也很好吃，不过今晚搭配的酱料用了另外的做法，平时可以交叉换口味试试！成品图：清蒸三黄鸡成品图：清蒸三黄鸡## 主要食材处理鸡肉的：1、三黄鸡半只（差不多一斤）2、盐焗鸡粉处理蘸料的：1、姜一小块2、葱一颗3、白砂糖4、生抽酱油## 处理鸡肉1、三黄鸡剁小块，然后在水里浸泡半小时左右，浸出血水和杂质，然后洗净2、用盐焗鸡粉抹匀，提前腌制一两个小时，时间方面不太要紧，因为最终靠蘸料提味的腌制鸡肉## 蒸鸡肉汤锅倒入适量的水烧开，把鸡肉在盘子里码好。把鸡肉在盘子里码好水开了就放入三脚蒸架，把鸡肉放进去蒸，开 800W 倒计时 30 分钟慢慢蒸。水开了就放进去蒸慢慢蒸时间到了就可以出锅啦！蒸的过程鸡会慢慢变黄，好好看！熟了！## 调制蘸料蒸的时间快到了就可以准备酱料了：1、先把姜葱都剁成末，加一点点白砂糖，加入 3 \\~ 4 勺生抽酱油把姜葱都剁成末2、等鸡肉蒸好了，盘里会有很多鸡汁，倒进调料碗里拌匀，就做好了蘸料最终做好的蘸料## 最终成品然后就开吃了哈哈哈，虽然时间会比较长，但跟煲汤一样其实很省事，整个过程只需要等就可以了，而且时间和煮饭差不多，刚好可以同时出锅开饭！有颜值的鸡肉绝美搭配这个蘸料好好吃"
  },
  {
    "slug": "douchilingyu-chao-youmaicai",
    "title": "省钱菜谱：6.5元的豆豉鲮鱼炒油麦菜（3min）",
    "desc": "前几天逛超市的时候罐头打折 10 块钱一罐，买来做个油麦菜刚好！这是我们之前小组聚餐最喜欢点的一道菜哈哈哈哈哈，但是很可恶的是外面吃的豆豉鲮鱼炒油麦菜，鲮鱼永远都是只有一滴滴… 还是自己做大满足！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220514005832.jpg?x-oss-process=image/interlace,1",
    "content": "\\= = 这两天的短信一直预告大暴雨、最强雷电，还好没有来，虽然我远程办公不用出门…前几天逛超市的时候罐头打折 10 块钱一罐，买来做个油麦菜刚好！这是我们之前小组聚餐最喜欢点的一道菜哈哈哈哈哈，但是很可恶的是外面吃的豆豉鲮鱼炒油麦菜，鲮鱼永远都是只有一滴滴… 还是自己做大满足！成品图：豆豉鲮鱼炒油麦菜## 主要食材1、豆豉鲮鱼半罐， 5 块钱2、油麦菜一把， 1.5 元3、蒜头 3 瓣买的是甘竹罐头鱼## 处理食材1、油麦菜洗净，把水抖干，记得要抖干，不要湿漉漉的2、然后把油麦菜摘成寸长小段，梗那部分和叶子部分分开放，跟炒芥兰一样，等会要分先后下锅3、豆豉鲮鱼就简单了，撕小块或者丝，一罐罐头我分成两次用，所以鱼和豆豉都是对半分，罐头里的油也是，炒菜一起下很香！把鱼肉夹出来撕好然后对半分4、另外的半罐豆豉鲮鱼可以装回罐头里，用保鲜袋扎紧冷藏，留着下次炒。另外半罐保存好5、蒜头拍碎去皮，稍微切小块就可以准备好的食材## 炒菜步骤1、油麦菜也是要宽油炒才好吃，而且不会出很多汤汤水水，炒锅下多点油，然后开 800W 热锅2、等到油温很热很热了才开始炒菜，先把蒜头倒下去爆香，然后把鲮鱼块和豆豉也一起加进去爆香，香味马上就出来了！！！爆香蒜头爆香豆豉和鲮鱼3、然后把油麦菜梗那部分先下锅，翻炒变软就下叶子再一起炒，全部炒软了就可以出锅了先下梗翻炒再下叶子炒好了！## 最终成品超好吃超下饭哈哈哈！"
  },
  {
    "slug": "huaishan-hongzao-paigu-tang",
    "title": "淮山红枣排骨汤（2h）",
    "desc": "五一因为打了疫苗，安慰自己要休息，然后就没有运动哈哈哈哈，所以今天才出去爬山，下山的时候还下雨了，累死！还好出门前先处理好了食材，定时煲汤，回到家洗个热水澡舒舒服服的喝汤，好爽啊！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220514010919.jpg?x-oss-process=image/interlace,1",
    "content": "五一因为打了疫苗，安慰自己要休息，然后就没有运动哈哈哈哈，所以今天才出去爬山，下山的时候还下雨了，累死！还好出门前先处理好了食材，定时煲汤，回到家洗个热水澡舒舒服服的喝汤，好爽啊！今天食材的体积都不大，隔水炖的锅够用，加上要定时，所以用的隔水炖锅来煲汤的，整个过程需要手动处理的只有食材准备环节。成品图：淮山红枣排骨汤## 主要食材1、排骨一条，剁小块2、红枣 6 粒3、淮山 3 片4、花生一小把5、枸杞几粒6、姜一小块（飞水用）7、葱一根（飞水用，有葱就加，没有也可以不用）我是家里有之前我妈妈寄给我的干淮山片，药店应该可以买到，中药材来的，没有就不加哈哈哈。## 处理食材1、排骨提前浸泡大约 40 分钟，浸出里面的血水2、葱扎一圈，姜切片，和排骨一起冷水下锅，没过排骨的水量，大火到沸腾就关火，夹出葱姜扔掉，刮掉浮沫排骨焯水3、花生提前冷水浸泡一下，然后洗净4、红枣也洗净，有厨房剪刀可以去一下核，用剪刀比较方便，嫌麻烦就划一刀开个口就行5、淮山洗净，弄成小片就可以准备好的配料## 煲汤所有食材放在炖锅里，连汤和排骨一起转移到炖锅。煲汤之前煲汤模式定时 2 小时就可以了。煲好了！## 盛汤出锅前丢几粒枸杞进去焖一下，然后就可以盛出来了，先加点盐调味就搞定！排骨炖的很软嫩很甜很甜的汤"
  },
  {
    "slug": "huanggua-zhan-baitang",
    "title": "黄瓜蘸白糖真好吃哈哈哈哈哈哈哈哈哈哈哈哈",
    "desc": "从小吃到大的一个吃着玩的吃法，黄瓜先冷藏，然后洗净，直接蘸白糖，超好吃！！！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220514011945.jpg?x-oss-process=image/interlace,1",
    "content": "从小吃到大的一个吃着玩的吃法，黄瓜先冷藏，然后洗净，直接蘸白糖，超好吃！！！！！这种黄瓜好脆蘸点白糖超好吃的！"
  },
  {
    "slug": "suzha-heiyupian",
    "title": "菜谱：酥炸黑鱼片（15min）",
    "desc": "做个炸鱼片，今天这个黑鱼片是成品包装，本来是用来做酸菜鱼水煮鱼的，好像是处理过的，所以我没有再另外加工，感觉不腥，如果是菜市场买的鱼，可以用姜葱抓匀腌制一下去掉腥味。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/05/20220502172218.jpg?x-oss-process=image/interlace,1",
    "content": "做个炸鱼片，今天这个黑鱼片是成品包装，本来是用来做酸菜鱼水煮鱼的，好像是处理过的，所以我没有再另外加工，感觉不腥，如果是菜市场买的鱼，可以用姜葱抓匀腌制一下去掉腥味。蘸料方面，这次用的是之前买烧鸭给多了的酸梅酱，以前在家我家是用桔油来搭配，那是一种酸酸甜甜的果酱，不知道是不是潮汕特产哈哈哈，在外面几乎没见到，如果感兴趣也可以搜一下金桔油或者金橘油看看。成品图：酥炸黑鱼片## 主要食材1、免浆黑鱼片 1 盒， 250g 也就是半斤，那天打折后是 9 块钱2、新鲜生菜拿几片，算 5 毛钱吧3、盐4、生粉（玉米淀粉）## 处理食材1、黑鱼片是冻品，提前一晚上放到冰箱冷藏室解冻，然后拆包装，放入大碗里，加入一点点盐（平时做菜分量的一半或者更少），一调味盒勺子的生粉，抓匀即可（鱼片加生粉可以炸出酥脆的口感）加一勺生粉2、生菜洗净，甩干水滴，铺盘底备用准备好的食材## 炸鱼片1、倒油，开 800W 热锅，一定要油温上来了才能下锅，不然会粘锅油温上来了下锅炸2、几片几片炸，尽量不要粘在一起，定型了就可以翻面定型了就翻面3、两面金黄了就可以先夹出来，直到全部炸完炸好的先夹出来## 最终成品最后淋上酸梅酱或者桔油就可以吃啦！最终成品好香好好吃"
  },
  {
    "slug": "kaorou-shengcai-shala",
    "title": "省钱菜谱：6块钱的烤肉生菜沙拉（25min）",
    "desc": "写下标题的时候，我点开了温拿乐队的《Sha La La La》哈哈哈哈…今晚吃个沙拉，自己做也不贵，大概 6 块钱…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220502151910.jpg?x-oss-process=image/interlace,1",
    "content": "🤣🤣🤣写下标题的时候，我点开了温拿乐队的《Sha La La La》哈哈哈哈…今晚吃个沙拉，自己做也不贵，大概 6 块钱…成品图：烤肉生菜沙拉## 处理烤肉鸡腿肉和上次的干煸那次一起买的，也是 5.1 元，洗净切丁，加新奥尔良腌料提前腌制一晚上，空气炸锅恒温 200 度先烤 15 分钟，拿出来用筷子拌匀翻一下，再烤 10 分钟。烤之前## 处理生菜生菜一颗，约 1 块钱，洗净，加一点盐泡水 10 分钟，然后洗净，用厨房剪刀剪成丝（切丝也可以哈哈哈）…生菜泡水## 处理玉米粒玉米粒是免费菜，要焯一下水，先洗净，然后水开了下玉米粒，加一点点盐，开 800W 倒计时 5 分钟，然后捞干出来…玉米粒焯水## 处理小番茄本来准备了黄瓜想拓个黄瓜丝，结果生菜弄完发现已经一大碗了，所以只弄了几颗小番茄，小番茄洗净，对半切。小番茄对半切## 准备好的食材最后肉烤好了就可以挤上沙拉酱拌匀开吃！！！全部食材## 做成沙拉所有材料放大碗里。所有材料放大碗里挤上沙拉酱。挤上沙拉酱全部拌匀。全部拌匀好好吃哈哈哈！好好吃哈哈哈"
  },
  {
    "slug": "honghuban-cuipi-safen-zhajitui",
    "title": "省钱菜谱：红虎斑脆皮撒粉炸鸡腿（25min）",
    "desc": "中午吃炸鸡腿哈哈哈哈哈，起这个名字纯粹是因为，小朋友很喜欢在我吃饭的时候要我抱抱，他是一只红虎斑缅因猫（图9），刚好发现他的颜色和炸鸡腿的颜色一毛一样，所以用猫的品种名字给鸡腿起名了笑死…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220426145918.jpg?x-oss-process=image/interlace,1",
    "content": "中午吃炸鸡腿哈哈哈哈哈，起这个名字纯粹是因为，小朋友很喜欢在我吃饭的时候要我抱抱，他是一只红虎斑缅因猫，刚好发现他的颜色和炸鸡腿的颜色一毛一样，所以用猫的品种名字给鸡腿起名了笑死…今天是用挂面糊的方式炸的，还是用的空气炸锅，我觉得主要注意事项在于调制面糊的浓稠度上，像我这个浓稠度炸出来的效果刚刚好，外脆里嫩，超好吃！！！成品图：红虎斑脆皮撒粉炸鸡腿哈哈哈哈这是我家小朋友，是不是颜色好像！小朋友：红虎斑缅因猫## 主要食材下面是腌制鸡腿用的：1、鸡腿 3 \\~ 4 个，这次的鸡腿个头比较小，所以拿了 4 个，今天是冰鲜鸡腿 4 个一袋 8 块钱，如果是冷冻鸡腿更便宜2、五香粉3、花椒粉4、盐5、芝麻香油下面是炸鸡之前挂面糊用的：1、五香粉2、面粉3、生粉（玉米淀粉）4、鸡蛋 1 个下面是吃鸡之前的撒粉：1、孜然粉2、辣椒粉## 腌制鸡腿1、鸡腿泡水一段时间，用牙签扎几个孔，让鸡腿的血水渗透出来，这样熟了之后里面也不会黑黑的2、鸡腿控水，可以用厨房纸吸干水份，3、两面各自均匀的撒上一层盐、一层五香粉、一层花椒粉，抹匀4、淋上一圈芝麻香油抓匀后，放在保鲜盒里冷藏一晚上，让它腌入味腌制鸡腿## 制作面糊1、把生粉和面粉按照 1:1 的分量准备好，用量看你的鸡腿多少准备，不需要特别多准备的粉量2、五香粉一丢丢就可以，然后加水，把所有粉用筷子打成面糊，水一点点加，不要一次性加太多了，直到面糊可以沿着筷子头缓慢又顺滑的滴落就刚刚好，太稠了烤出来很硬，太稀了挂不住打好的面糊3、鸡蛋打散即可鸡蛋直接打散即可## 炸鸡腿1、因为我的碗太小，所以把蛋液倒进保鲜盒了，先给鸡腿挂满一层蛋液，然后再挂满一层面糊，摆到空气炸锅的炸篮里把蛋液倒进保鲜盒里裹上一层蛋液挂上一层面糊2、空气炸锅恒温 200 度先烤 15 分钟，取出炸篮，用筷子给鸡腿翻一下面准备烤之前3、再次 200 度烤 10 分钟，就搞定了！第二次烤完的样子## 最终成品出锅后直接吃也好吃，这是刚出锅的样子，还没撒粉，已经很诱人了！炸好的鸡腿好香了！！！可以撒上孜然粉和辣椒粉搭配更美味！撒粉后的鸡腿搭配个娃哈哈，哈哈哈哈哈哈哈哈哈哈哈哈…搭配娃哈哈，哈哈哈哈哈哈哈这样做出来的鸡腿造型好看！真的好好看哈哈哈外脆里嫩！这个脆皮好赞！超级好吃！很好吃！直接脱骨！可以直接脱骨"
  },
  {
    "slug": "ganbian-jitui-ding",
    "title": "省钱菜谱：5.1元的干煸鸡腿丁（5min）",
    "desc": "今晚做这个干煸鸡腿丁和我之前发的孜然蒜香鸡胸粒做法有点接近，稍微调整了一下，风味和口感又不一样呢哈哈哈。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220425001034.jpg?x-oss-process=image/interlace,1",
    "content": "我这两天居然在 YouTube 找到了 20 年前 TVB 的古装电视剧《皆大欢喜》！作为一个 95 前的广东人，同地区的同龄人可能有点印象吧，再小点估计不知道了哈哈哈哈，毕竟我当时看的时候我自己都还是个小学生… 可惜只有国语版，这部电视剧要看粤语更搞笑，好多都是粤语的梗，比如主角一家开的食肆叫 “洞蜜园” ，白话就是 “动物园”，皇宫里的 “嘉仁宫” 就是 “加人工”，还有各种人名都是白话里各种接地气的名词，笑死…今晚做这个干煸鸡腿丁和我之前发的孜然蒜香鸡胸粒做法有点接近，稍微调整了一下，风味和口感又不一样呢哈哈哈。成品图：干煸鸡腿丁## 主要食材1、鸡腿，这次是买的处理好的冷冻鸡腿丁， 300 克一袋，折后 5.1 元，买冷冻鸡腿剔骨成本也差不多2、蒜头 4 瓣3、指天椒 2 根4、葱 1 根## 调味品1、柱侯酱 1 勺（腌制用）2、料酒 0.5 勺（腌制用）3、生抽酱油 0.5 勺（腌制用）4、生粉 1 勺（调味盒的小勺子，也是腌制用）5、老抽酱油 0.5 勺（干煸的时候下）6、孜然粉（出锅前下）## 处理食材1、鸡腿丁泡水解冻，然后尽量滤干水2、加入柱侯酱、料酒、生抽、生粉一起抓匀，腌制 10 分钟腌制鸡肉3、蒜头拍碎去皮，剁成蒜末4、指天椒去头切圈5、切葱花准备好的食材## 烹饪过程1、炒锅倒油，今天是干煸，油少一点，先开 800W 热锅，然后把蒜末和指天椒圈一起下锅爆香爆香蒜末和椒圈2、把腌制好的鸡腿丁倒进去（因为泡水解冻的，如果腌制的时候还会出水的话，水尽量不要下锅，只抓鸡丁放进去就可以）翻炒鸡腿丁3、鸡丁炒到变色之后，把火开到 1000W ，用来更好的逼干水份，然后加入半勺老抽酱油，快速翻炒均匀给鸡肉上色转大火4、等到锅里没什么水份了，鸡腿丁也有焦香扑鼻的感觉，就可以关火了上色5、撒上葱花，看自己的喜好撒上孜然粉，然后翻炒均匀就可以装盘了准备出锅好好吃！最终成品"
  },
  {
    "slug": "neizhidoufu-jidangeng",
    "title": "省钱菜谱：0.66元的内酯豆腐鸡蛋羹（15min）",
    "desc": "哈哈哈哈今天这一餐纯属白嫖，是拿的美团买菜的免费菜里面的内酯豆腐，最近几次买东西都选了它，配合鸡蛋羹一起，口感真的很不错，好像豆腐花，超级嫩！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220422233257.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈今天这一餐纯属白嫖，是拿的美团买菜的免费菜里面的内酯豆腐，最近几次买东西都选了它，配合鸡蛋羹一起，口感真的很不错，好像豆腐花，超级嫩！工具方面需要准备一个笊篱，还有保鲜膜，还有一根牙签，还有蒸东西的蒸架，然后提前煮一壶电热壶的热水备用。成品图：内酯豆腐鸡蛋羹## 主要食材1、内酯豆腐一盒，白嫖的免费菜哈哈哈哈，0元白嫖的快乐2、鸡蛋一个，一段时间前买的一盘， 19.9 元 30 个，所以一个 6 毛 63、鱼露一点点，大约图片里勺子的半勺，用来提鲜4、生抽酱油，三分之二锅铲5、少许淀粉兑成水淀粉（大约三分之一调味盒的勺子）6、家里有葱就拿根葱## 备料过程1、内酯豆腐取出来后冲一下水，特别嫩，水流不要太大，然后切片，摆盘里（放进去后稍微推一下就可以这样旋一个多米诺骨牌造型啦！）内酯豆腐切片摆盘2、鸡蛋用筷子打散，然后按照 蛋液：水 大约 1：0.8 的比例加水，加入鱼露，再次打匀鸡蛋打散加水和鱼露再次打匀3、拿着笊篱在装豆腐的盘子上方，把蛋液用笊篱过滤一下倒进盘子里，这样蒸出来的鸡蛋羹口感比较细腻准备笊篱过滤蛋液过滤后很细腻4、葱切成葱花备用## 蒸鸡蛋羹1、拿出保鲜膜，拉紧盖好盘子，用牙签轻轻的戳若干个小洞用来透气，可以用钻孔的方式去戳，这样保鲜膜就不会被压到碰到蛋液包好保鲜膜并扎孔2、汤锅倒入比较多的热水，放入蒸架，盘子摆上去，盖上盖子蒸鸡蛋羹3、开 800W 的温度，倒计时 15 分钟慢慢蒸## 制作酱汁等鸡蛋羹蒸好了就取出来，换上炒锅，加入大约三分之二锅铲的生抽酱油。加入大约三分之二锅铲的生抽酱油倒入水淀粉，开 300W 的低温煮到沸腾。倒入水淀粉一起然后倒入葱花进去烫熟。加入葱花就可以淋到鸡蛋羹上面了。淋上酱汁## 最终成品口感方面很细腻，鸡蛋羹和内酯豆腐真是好搭配！好嫩好嫩好嫩"
  },
  {
    "slug": "hongzao-yimi-wujitang",
    "title": "红枣薏米乌鸡汤（1.5h）",
    "desc": "想着明天再出去爬山，今晚继续放纵一下哈哈哈哈，煲个乌鸡汤来吃吃！我记得过年的时候我朋友问我，为什么我的鸡汤那么清澈，当时也简单跟她分享过，今晚再煲汤我就在这里记录下过程。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220416235437.jpg?x-oss-process=image/interlace,1",
    "content": "这两天村里终于解除封锁，靠近山脚下那边的出口终于可以出入了，时隔三个月终于又出去爬山了！好久没亲近大自然，感觉真怀念！！！出门前定时炖了乌鸡汤，回来刚好能吃，煲汤跟我上次写的茶树菇红枣乌鸡汤的过程是一样的，只不过这次我把茶树菇换成了薏米。红枣薏米乌鸡汤"
  },
  {
    "slug": "wujitangmian",
    "title": "乌鸡汤面（1.5h）",
    "desc": "想着明天再出去爬山，今晚继续放纵一下哈哈哈哈，煲个乌鸡汤来吃吃！我记得过年的时候我朋友问我，为什么我的鸡汤那么清澈，当时也简单跟她分享过，今晚再煲汤我就在这里记录下过程。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220416235525.jpg?x-oss-process=image/interlace,1",
    "content": "这两天村里终于解除封锁，靠近山脚下那边的出口终于可以出入了，时隔三个月终于又出去爬山了！好久没亲近大自然，感觉真怀念！！！出门前定时炖了乌鸡汤，回来刚好能吃，光喝汤不太饱，又不想煮饭太久了，煮几根面条还是很快的！搭配也很棒哈哈哈哈！煲汤跟我上次写的茶树菇红枣乌鸡汤的过程是一样的，只不过这次我把茶树菇换成了薏米。乌鸡汤面乌鸡汤面"
  },
  {
    "slug": "puningdoujiang-liangban-jisi",
    "title": "省钱菜谱：潮汕特色凉菜 2.7元的普宁豆酱凉拌鸡丝（20min）",
    "desc": "最近的菜谱又主打我家乡潮汕的口味了，上次发豆酱炒番薯叶的时候有小姐姐评论说不会用豆酱，所以最近几次就以豆酱为主角，多分享点玩法。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220413234520.jpg?x-oss-process=image/interlace,1",
    "content": "最近的菜谱又主打我家乡潮汕的口味了，上次发豆酱炒番薯叶的时候有小姐姐评论说不会用豆酱，所以最近几次就以豆酱为主角，多分享点玩法。凉拌菜不仅仅是辣口味专属的，潮汕也有自己的凉拌，今天还是用普宁豆酱来做个凉菜，哈哈哈哈其实步骤跟之前的凉拌没啥差别，就是调味方面很潮汕了！关键是，它超级简单！！！还鲜美可口！！！（豆酱真的很美味啊！！！）成品图：普宁豆酱凉拌鸡丝## 主要食材1、鸡胸肉一块，折扣完 8.13 元一大包，有 3 块鸡大胸，所以今晚 2.7 元2、香菜一把， 0 元，美团买菜的免费菜，不吃香菜请忽略3、普宁豆酱 1 勺（普宁是潮汕地区的一个城市名）4、白芝麻 1 小把5、芝麻香油 1 勺6、姜一小块（飞水用）7、葱一根（飞水用）8、凉白开一碗（降温用）## 准备食材1、鸡胸肉冷水下锅，姜切片，和葱一起放进去，水淹没鸡胸，电磁炉开 800W 倒计时煮 10 分钟先飞水2、等鸡胸肉的时间里，去洗香菜，捋叶子3、鸡胸肉煮好了，在凉白开里冷却，大约 10 分钟就可以煮熟了4、把鸡胸肉手撕成鸡丝准备好的食材## 凉拌过程要拌东西最好在大碗里比较方便，加入一勺豆酱…加入豆酱倒入香菜，撒入白芝麻，香油…加入香菜、芝麻、香油拌匀即可装盘开饭！拌好了## 最终成品很好吃，很鲜美！搞定的样子好吃超好吃"
  },
  {
    "slug": "jinzhengu-roupi-men-doufu",
    "title": "省钱菜谱：6.5元的金针菇肉皮焖豆腐（20min）",
    "desc": "有一段时间没吃肉皮了，今晚搞一搞，我没有砂锅，所以用炒锅焖，有砂锅的话可以直接做成肉皮豆腐煲。然后这次我没有用蚝油，昨天新买的豆酱就炒了个番薯叶，还有一整瓶，今晚继续用豆酱调味也很好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220410214038.jpg?x-oss-process=image/interlace,1",
    "content": "有一段时间没吃肉皮了，今晚搞一搞，我没有砂锅，所以用炒锅焖，有砂锅的话可以直接做成肉皮豆腐煲。然后这次我没有用蚝油，昨天新买的豆酱就炒了个番薯叶，还有一整瓶，今晚继续用豆酱调味也很好吃！成品图：金针菇肉皮焖豆腐## 所需食材1、肉皮，潮汕这边的一种食材，本质是炸猪皮，之前买的一大袋子，今天抓了几片大概4块钱2、老豆腐 1 块，1.5元3、金针菇 1 小把，1 块钱4、指天椒 2 根5、葱 1 根6、蒜头 4 瓣7、普宁豆酱 1 勺（用蚝油也可以，也是 1 勺）这个是豆酱8、生抽酱油 1.5 勺9、生粉大约 0.5 调味盒勺子（最后兑成水淀粉用）先煮一电热壶的开水，等会要用到好几次。## 准备食材1、把肉皮提前泡软（下午有空我就泡了半个多小时，平时的话看到软了就可以了），然后切成条状或者块状都可以提前泡软泡出很多油脂泡好之后很软了2、金针菇切掉根部，洗净，然后汤锅倒入适量开水，加一勺盐，倒计时3分钟焯一下水，然后捞干备用金针菇焯水3、豆腐切成均等的小块4、切葱花5、指天椒去头切圈6、蒜头拍碎去皮，剁成蒜末准备好的食材## 烹饪过程1、先煎豆腐，因为豆腐有点水，先用厨房纸吸一下再下去煎，这样就不会溅油，煎到两面金黄就可以装盘备用先吸掉豆腐上的水再下锅煎两面金黄的就可以先盛出来全部煎好了2、留一点底油（不用很多），蒜末和椒圈下去爆香，然后下肉皮炒匀先爆香蒜末和椒圈3、倒入一碗热水（盛饭的碗），然后加入 1 勺豆酱，1.5 勺生抽酱油，翻炒均匀加水加调味4、金针菇先码上去，再把豆腐码上去，盖上锅盖焖大约 5 分钟（期间适当翻一下，顺便看下里面的水是不是收干了，快收干了就可以了）金针菇先码上去码好食材盖上盖子焖5、汤汁快收干的时候，兑一点水淀粉淋上去，葱花也撒进去，跟食材翻炒均匀再煮一小会就可以出锅加入水淀粉撒入葱花炒匀即可出锅！"
  },
  {
    "slug": "puning-doujiang-chao-fanshuye",
    "title": "省钱菜谱：4块钱的普宁豆酱炒番薯叶（2min）",
    "desc": "我不仅喜欢烤番薯、炸番薯片、糕烧番薯、反沙番薯，对番薯叶也是超爱！今天分享来自我妈的经典做法，哈哈哈哈感觉这 3 个食材搭配特别好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220410014947.jpg?x-oss-process=image/interlace,1",
    "content": "我不仅喜欢烤番薯、炸番薯片、糕烧番薯、反沙番薯，对番薯叶也是超爱！今天分享来自我妈的经典做法，哈哈哈哈感觉这 3 个食材搭配特别好吃！成品图：普宁豆酱炒番薯叶## 主要食材1、番薯叶半斤，也就是大约 250 克，4 块钱带茎的番薯叶，半斤大概这么多2、蒜头拿 4 \\~ 5 瓣3、豆酱 1 勺，是潮汕的豆酱，不是辣的“豆瓣酱”，一般买到的都是普宁豆酱普宁豆酱番薯叶别看好像很多，实际上一炒就没多少了，像极了我之前烫头发之后平时很蓬松，但是洗头一碰水就打回原形那样子哈哈哈哈哈哈哈…这一大盆实际上也就只能炒出刚好一盘。豆酱很咸，所以不需要再额外加盐了，也不用加很多，我觉得 1 勺刚好够味。## 处理食材1、番薯叶买的时候一般都是带着很长的茎，茎超级硬，所以不要，只摘嫩叶部分下来，具体的长度需要自己感受，掐起来软嫩嫩的地方就可以留下来，一般都是很靠近叶子的地方择好的番薯叶2、择好菜之后，洗干净，多洗几次，洗菜水看起来没什么杂质了就可以，滤干水放着备用3、蒜头拍碎，去皮，然后稍微剁一下剁成蒜丁，不需要很细的蒜蓉剁成这样就可以了4、豆酱一般都是一瓶，等会直接用干燥的勺子去舀就可以## 炒菜番薯叶多点油炒更好吃，所以我油下的比较多1、先开 800W 热锅，油温上来了就把蒜头倒进去，半煎半炒到开始呈现金黄色蒜头先下锅开始呈现金黄色2、这个时候就可以把番薯叶倒进去了，稍微翻炒一下就软了番薯叶下锅炒一下就软了3、番薯叶很容易熟，等叶子都开始变色变软就可以把火关到最小，或者直接关掉（我的炉子最小是 120W ）4、勺子舀一勺豆酱放进去，锅铲把番薯叶和豆酱翻炒均匀就可以出锅了舀一勺豆酱把番薯叶和豆酱翻炒均匀## 最终成品很好吃的搭配！而且番薯叶对减肥好像很有效果哦！超级好吃！"
  },
  {
    "slug": "zhacai-roupian-tangmifen",
    "title": "省钱菜谱：2.5元的榨菜肉片汤米粉（5min）",
    "desc": "今晚煮个米粉吃，简简单单的，大学的时候经常跟舍友去校门口的沙县吃榨菜肉丝粉，不过都是汤河粉，今晚用潮汕特色的细米粉来做也很不错！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220405214237.jpg?x-oss-process=image/interlace,1",
    "content": "放假这三天休息的好充足，还把之前开源的电子书追加了一章新的内容，从 2 月初就跟读者预告了一下说要写，结果忙着忙着又懒着懒着就拖了两个月哈哈哈哈，总算搞定一件事。今晚煮个米粉吃，简简单单的，大学的时候经常跟舍友去校门口的沙县吃榨菜肉丝粉，不过都是汤河粉，今晚用潮汕特色的细米粉来做也很不错！成品图：榨菜肉片汤米粉## 主要食材1、瘦肉切一小块，大约 2 块钱2、榨菜半包， 5 毛钱3、葱 1 根4、细米粉一把，之前家里寄过来的潮州细米粉，所以这个不用钱嘿嘿潮州细米粉5、鱼露6、胡椒粉7、蒜头油8、芝麻香油## 处理食材先煮一电热壶的热水备用。1、瘦肉切薄片或者切丝2、切葱花3、榨菜如果是榨菜丝就直接用了，我这个是榨菜片，所以我改刀切丝了一下家里有两块砧板的话就用熟食的砧板来切，没有的话就先切好榨菜和葱花，装碗里备用，再去切肉，不要生熟放一起切。## 煮米粉1、碗底先加鱼露和胡椒粉，加适量的开水兑个汤底兑汤底2、电热壶剩下的热水倒进汤锅，开 800 瓦的档次，下米粉，煮到水沸腾就可以捞出来到碗里，和调味好的汤底拌匀下锅水开就可以了捞出来拌匀3、期间不用关火，水继续沸腾的时候，最后把瘦肉“触熟”就可以（潮州土话，意思就是肉放笊篱里一起下锅，用筷子来回拨动让肉烫熟，这样“触”出来的肉很嫩）触肉把肉片、榨菜码在汤粉上面，撒上葱花，淋上一勺蒜头油、一圈香油，搞定！## 最终成品很适合清淡人士哈哈哈哈，好吃！最终成品好喜欢这个米粉"
  },
  {
    "slug": "xinaoerliang-kaorou-juanbing",
    "title": "菜单分享：新奥尔良烤肉卷饼（20min）",
    "desc": "今天天气好好，中午又搞了一波烤肉卷饼，这次换成了新奥尔良烤鸡腿肉。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220405215403.jpg?x-oss-process=image/interlace,1",
    "content": "今天天气好好，中午又搞了一波烤肉卷饼，这次换成了新奥尔良烤鸡腿肉。成品图：新奥尔良烤肉卷饼## 烤肉过程鸡腿剔骨切小块，提前用新奥尔良腌料腌一晚上。烤之前锡纸半包烤 10 分钟，拿出来用筷子拌匀翻一下，再放进去烤 10 分钟就好。烤好后## 其他搭配搭配点青瓜丝和沙拉酱，也是美滋滋！全部搭配## 卷饼过程铺好饼，然后随意夹上青瓜丝和烤肉，再挤点沙拉酱。随意搭配再盖上一层青瓜丝然后折一折，叠一叠…折一折叠一叠就搞定了！很好看哈哈哈很好吃哈哈哈，媲美外卖点的烤肉卷！很好吃哈哈哈主要是中间也不需要啥操作，卷饼是超市买的现成的，适合懒觉睡到中午的日子。"
  },
  {
    "slug": "ziran-suanxiang-jixiongli",
    "title": "省钱菜谱：3块钱的孜然蒜香鸡胸粒（2min）",
    "desc": "这周补多一天班搞得我总觉得今天是单休，然后终于才进入假期模式，本来前几天就想发这个菜谱的，结果一看电影一拖再拖哈哈哈哈哈…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/04/20220404011855.jpg?x-oss-process=image/interlace,1",
    "content": "这周补多一天班搞得我总觉得今天是单休，然后终于才进入假期模式，本来前几天就想发这个菜谱的，结果一看电影一拖再拖哈哈哈哈哈…这几天一直在翻看狄龙和姜大卫年轻时的武打电影，张彻大导演安排的双主角太帅了哈哈哈哈，狄龙年轻的时候真的超帅！姜尊也是痞帅痞帅的！不知道你们还记不记得这些演员了，我感觉广东地区90后男生应该对香港老电影都比较情有独钟…成品图：孜然蒜香鸡胸粒## 主要食材1、鸡胸肉 1 块，最近买的是 8.8 元一斤，三大块，所以这里算它 3 块钱吧，其他辅料没几个钱就略了…2、蒜头 4 瓣3、葱 1 根4、白芝麻一小把## 调味品1、柱侯酱 1 勺2、料酒 0.5 勺3、生抽酱油 1 勺4、盐一点点（大约平时炒菜用量的四分之一）5、生粉（玉米淀粉）1 勺6、辣椒粉7、孜然粉## 处理食材1、鸡胸肉买来的是冻的，泡水解冻，然后切丁2、加入柱侯酱、料酒、生抽、盐、生粉，抓匀，腌制 10 分钟腌制鸡胸肉3、蒜头拍碎，去皮4、葱切成葱粒所有食材## 烹饪过程1、炒锅倒油，开 800 瓦的温度热锅，温度上来了先把蒜瓣放进去半煎半炒先爆香蒜瓣2、等蒜瓣开始变金黄了，就把鸡丁倒进去翻炒下鸡丁3、大约 1 分钟左右鸡丁就熟了，并且我们腌制的时候抓了生粉，会有收汁的效果4、等到锅底几乎没有很多汁了，关火，撒上辣椒粉、孜然粉、白芝麻、葱花，利用余温翻炒均匀就可以出锅了！最终炒匀阶段## 最终成品最后出锅装盘的时候并不会很多汤汁，都收干了，口感还不错哈哈哈！装盘好吃"
  },
  {
    "slug": "chaoshan-shacha-jielan-chaomian",
    "title": "省钱菜谱：3.4元的潮汕沙茶芥兰炒面（10min）",
    "desc": "中午做了个芥兰炒面，大潮州的口味，面条也是用的潮州特色的 “面薄”，做炒面也特别好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/03/20220327163501.jpg?x-oss-process=image/interlace,1",
    "content": "感觉今年好像特别潮湿，之前都没买过除湿盒，今年不得不买了一堆，屋里几个角落都放了一个…这几天的衣服也完全没干，还好我有个晒被子的晾衣架子，然后昨晚晾到屋里吹空调才终于干了，不然一直湿漉漉的 = = ，还是喜欢大夏天……中午做了个芥兰炒面，大潮州的口味，面条也是用的潮州特色的 “面薄”，做炒面也特别好吃！成品图：沙茶芥兰炒面## 主要食材1、芥兰一小把，抓了几根 0.9 元2、瘦肉切了大概 2 块钱的分量3、香菇干拿 3 \\~ 4 朵，大约 0.5 元4、面条，今天其他材料比较多，所以比平时份量少一点，因为家里有所以没算钱5、沙茶酱挖一大勺6、老抽酱油 1 勺7、芝麻香油 1 勺8、盐9、一大碗凉白开再煮一壶开水备用。## 处理食材1、芥兰洗干净，折小段，长一点的叶子也是对半折，基本都在一寸多的长度2、芥兰梗切成滚刀块，和叶子分开放，等会要先下锅3、瘦肉切成薄片## 准备酱料1、沙茶酱加 2 \\~ 3 勺热水化开并拌匀2、老抽酱油也是加 2 勺热水兑匀## 准备面条1、汤锅把水煮开，面条放下去煮软，然后用笊篱捞干到凉水里浸一下煮面条捞干放进凉水里浸一下2、几十秒后捞干，淋上一圈芝麻香油，拌匀，可以有效防止面条变坨捞干，淋上香油拌匀准备好的所有食材## 制作炒面1、倒点油热锅，香菇先放下去爆香，十几秒后下瘦肉一起炒熟，加一点点盐调味，盛出来备用香菇先爆香瘦肉一起炒熟2、芥兰梗先下锅，十几秒后把芥兰叶子也倒下去，炒到芥兰变软变得油光亮泽的绿油油就熟了，加一点点盐调味，盛出来备用先炒芥兰梗再下叶子一起炒这个时候先去洗锅，锅洗干净了等会炒面不会粘锅。先洗一下锅3、重新倒点油热锅，油温上来了再下面条，下锅打散面条炒散4、淋上老抽酱汁，快速炒匀，给面条上色炒面上色5、把刚才炒好的香菇瘦肉芥兰都倒进去，沙茶酱汁也倒进去食材酱料一起倒进去6、炒匀即可出锅。炒匀出锅## 成品图我超爱这个炒面哈哈哈哈，沙茶和芥兰绝配，面条也是一根根的完全不会坨！一大碗好够吃沙茶和芥兰绝配面条也是一根根的完全不会坨"
  },
  {
    "slug": "zhuhou-kaorou-pei-qingguasi-juanbing",
    "title": "菜谱：柱侯烤肉配青瓜丝卷饼（15min）",
    "desc": "封村之前逛超市的时候看到有卖卷饼，当时买了两袋想试一下，然后拖到了现在才试哈哈哈，还蛮不错的！这东西还蛮好玩的，应该怎么搭配都好吃，这次是刚好做个烤肉消耗掉家里的柱侯酱，你也可以用奥尔良腌料啊沙茶酱啊之类的去做烤肉。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/03/20220320160858.jpg?x-oss-process=image/interlace,1",
    "content": "封村之前逛超市的时候看到有卖卷饼，当时买了两袋想试一下，然后拖到了现在才试哈哈哈，还蛮不错的！这东西还蛮好玩的，应该怎么搭配都好吃，这次是刚好做个烤肉消耗掉家里的柱侯酱，你也可以用奥尔良腌料啊沙茶酱啊之类的去做烤肉。成品图：柱侯烤肉配青瓜丝卷饼## 主要食材1、卷饼一袋，我买的是一袋 6 张饼2、青瓜一根3、瘦肉一大块，看你食量准备今天的肉和青瓜分量刚好卷了 5 张，吃的挺饱哈哈哈。## 腌肉调味这些都是用来腌制烤肉用的，看你的肉量适当微调，除了生粉，其他都是用的普通餐勺。普通餐勺1、柱侯酱 1 勺2、老抽酱油 0.5 勺3、白砂糖 0.5 勺4、芝麻香油 1 勺5、料酒 0.3 勺6、生粉 1 勺，用调味盒自带的小勺子（注意这个不是餐勺了哦\\~）瘦肉切丝，过一下水，然后控干，加入上面列的调味料，抓匀，放保鲜盒冷藏腌制一晚上。## 烤肉过程1、空气炸锅 200 度恒温，锡纸铺底半包，烤肉和酱料都倒进去，先烤 10 分钟。放进去烤之前2、然后取出来用筷子把烤肉和酱料再次拌匀，再烤 5 分钟准备烤第二次3、最后烤肉再跟酱料再次拌匀就可以装盘了。最终装盘## 处理青瓜青瓜洗净，去皮，用刮丝器拓成丝，再次过水洗净就可以。青瓜丝## 卷饼步骤卷饼默认是常温存放的，有微波炉可以微波炉叮一下加热，我是用空气炸锅的余温放进去加热的，有试了一下不加热也挺好吃。桌上铺两个保鲜袋用来放饼，洗手，然后就看你喜欢的方式卷着吃了哈哈。我是先铺好一张饼。铺好一张饼夹上一筷子的青瓜丝。夹上一筷子的青瓜丝夹上一筷子的烤肉。夹上一筷子的烤肉再夹上一筷子的青瓜丝。再夹上一筷子的青瓜丝烤肉和青瓜丝都放在饼的一侧就可以，然后掀起另外一侧盖上去。掀起另外一侧盖上去一角折起来。一角折起来另外一角也折起来。另外一角也折起来就卷好了！正面背面这个搭配很好吃哈哈哈！我感觉有烤肉的酱汁就足够了，所以没有另外加酱，可以根据你的喜好加蛋黄酱、千岛酱、沙拉酱之类的一起搭配。好吃好吃好吃"
  },
  {
    "slug": "roupian-qingchao-tudousi",
    "title": "省钱菜谱：3块钱的肉片清炒土豆丝（2min）",
    "desc": "玉米的价格看来下不去了，最近看好土豆哈哈哈，来做个潮汕做法的清炒土豆丝，口感清脆又好吃。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220319224341.jpg?x-oss-process=image/interlace,1",
    "content": "玉米的价格看来下不去了，最近看好土豆哈哈哈，来做个潮汕做法的清炒土豆丝，口感清脆又好吃。成品图：肉片清炒土豆丝## 主要食材1、土豆 1 个， 1 块钱，不需要很大个，普通大小的土豆拓成丝就有一大盘2、瘦肉切了大约 2 块钱的分量，不要瘦肉也可以，做成素菜3、葱 1 根4、盐## 处理食材1、土豆洗净去皮，用刮丝器拓成土豆丝，再次在洗菜盆里泡水洗净，洗 2 \\~ 3 次水后基本就清澈了。先拓成土豆丝2、这个时候继续用清水泡大约 10 分钟，这样处理后土豆自带的淀粉和粘液会去的比较干净，口感会很脆，等下炒的时候也不容易糊锅。清水浸泡3、瘦肉切成肉片备用4、葱切称大约 1 寸长的葱段，跟土豆丝差不多长哈哈。准备好的食材## 炒菜过程1、这个菜要用宽油炒才好吃，所以我们热锅的时候要倒多一些油，先开到 1000 瓦的温度热锅。宽油热锅2、油温上来了，把肉片倒下去炒，十几秒就可以熟了，加一点盐调味，然后关火，用锅铲控油后，盛到盘子里备用。先炒肉片3、再次开火，这次 800 瓦就可以，土豆丝先倒下去，先炒到开始变软。土豆丝下锅炒到开始变软4、下葱段，再次翻炒，直到土豆丝都软软的，晶莹剔透了，就说明熟了。5、这个时候加盐调味，翻炒均匀后，关火。下葱段继续翻炒到土豆丝熟6、最后，把肉片倒进去翻炒均匀就可以装盘了。最后炒均匀## 最终成品一般这种 “多段式” 炒菜法我都是分开调味，会更好吃，所以每个阶段的盐稍微少一点，自己把握好总的用量是平时单独炒菜的用量就可以。出锅装盘清脆爽口"
  },
  {
    "slug": "mijiang-kao-paigu",
    "title": "省钱菜谱：10块钱的蜜酱烤排骨（23min）",
    "desc": "居家办公的第五天，一周结束啦耶耶耶！今天中午和晚上都是吃烤排骨，好好吃哈哈哈哈哈！而且做法超级简单！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220318234526.jpg?x-oss-process=image/interlace,1",
    "content": "居家办公的第五天，一周结束啦耶耶耶！今天中午和晚上都是吃烤排骨，好好吃哈哈哈哈哈！而且做法超级简单！昨天测完核酸在菜市场买了 2 条排骨，不是很大条，不过 1 条配一顿饭还是刚刚好的！档主阿姨给我抹零后刚好 20 块钱，所以这一餐是 10 块。成品图：蜜酱烤排骨## 主要食材我腌制的时候是按照 2 餐的分量准备的，这一大碗排骨是 2 次的用料，只做一餐就 1 条排骨就可以，然后各种调料看你的分量适当减少噢！1、排骨 2 条2、叉烧酱 2 勺3、蚝油 1 勺4、生抽 2 勺5、老抽 1 勺6、白砂糖 2 勺（有蜂蜜的话可以用蜂蜜，现在家里没有，就用了白砂糖）## 腌制排骨1、剁好的排骨提前用清水浸泡，浸出血水杂质，今天排骨比较多，我泡了 1 个半小时，像平时煲汤 1 条排骨的分量就 40 分钟就差不多浸泡排骨2、中间换几次水，然后洗净沥干3、加入上面提到的各种调味酱料，抓匀加入上面提到的调料抓匀腌制装进保鲜盒里放在冰箱冷藏室，提前腌制一晚上。放保鲜盒里冷藏腌制一晚上## 烤排骨空气炸锅烤的， 200 度恒温是固定的，所以我分了 2 个阶段：### 第一阶段取比较大的锡纸，铺在烤篮底部，排骨裹一下酱汁再放进去，码好排骨后，锡纸全包，先烤 15 分钟码好排骨全包放进去烤第一阶段出炉的效果，主要是烤熟。第一阶段的效果### 第二阶段时间到了，取出烤篮，把锡纸掀开，周围卷起来，呈半包状态，用勺子舀几勺腌制排骨时碗底的料汁，均匀的淋上去，锡纸半包状态下再烤 8 分钟。第二阶段出炉的效果，外表焦香焦脆更好吃！第二阶段的效果## 最终成品整个过程没什么特别需要操作的，非常的简单哈哈哈哈，超级下饭超级好吃！！！这是今天中午烤的：中午烤的这是今天晚上烤的：晚上烤的呜呜呜敲好吃！！！好吃！## 烤箱版做法如果没有空气炸锅，你们也可以试试漂亮妹妹说的这个烤箱做法，我在她的做法上调整的哈哈哈哈…烤箱版本做法"
  },
  {
    "slug": "xianggu-tudou-zhurou-jianjiao",
    "title": "省钱菜单：6块钱一大碗的香菇土豆猪肉煎饺（10min）",
    "desc": "哈哈哈哈昨晚的饺子，留了一份21个，中午拿出来煎！好香好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220317140121.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈昨晚的饺子，留了一份21个，中午拿出来煎！好香好吃！## 成品图成品图：香菇土豆猪肉煎饺蘸辣椒酱好吃## 煎饺步骤前一晚先保鲜盒装一份饺子冷藏，中午拿出来煎。先倒油热锅，油温上来了再下饺子，用筷子控制就可以，不需要用到锅铲。放下去煎不定期翻一下，避免煎焦，如果一面金黄了就可以翻还没煎的那一面去继续煎。不定期翻一下两面金黄的就可以提前出锅啦，先夹出来，继续放新的饺子下去煎。煎好的先夹出来全部搞定啦！煎好开吃！"
  },
  {
    "slug": "xianggu-tudou-zhurou-jiaozi",
    "title": "省钱菜谱：0.29元/个的香菇土豆猪肉饺子（1h）",
    "desc": "做完卤肉实在没忍住哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈，切了一块卤肉，吃个宵夜！！！这个点最好的搭配就是潮汕粿汁了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220316234044.jpg?x-oss-process=image/interlace,1",
    "content": "居家办公的第三天，今天楼下好安静，往楼下看，很明显的没什么人在外面了，大家都好配合防疫工作！今天测核酸要出示身份证了，好多人又折返回去拿，其实昨天上午就有短信通知来着，估计 “以备查验” 四个字让人觉得不是必须带吧，最好带上哦！要查两次，一次是刚排队的时候有提醒并检查，第二次是准备测核酸的时候，扫 “粤核酸” 码之前也要求出示。今天只下去买了饺子皮，今晚包土豆馅饺子！ 12 块钱的食材包了 41 个饺子，每个 0.29 元，我一顿吃 20 个饺子就是 5.8 元一餐，自己包真便宜！成品图：香菇土豆猪肉饺子## 主要食材1、中等个头的土豆 2 个（太小的话就 3 个吧哈哈哈哈），大约 2 块钱土豆是这么大的2、猪肉大约 9 块钱，昨天买的一大块上肉，切了一些炒菜，切了一些煮面，留下来的刚好够包饺子3、干香菇抓 6 \\~ 7 朵，大约 1 块钱4、虾皮抓一小把5、鱼露6、盐7、五香粉## 处理馅料1、土豆削皮，用刮丝器刮成细丝土豆削皮刮成土豆丝2、用水洗几次，洗掉粘液和杂质，然后用笊篱捞干出来（哈哈哈 2 个土豆刚好一盘）洗干净刚好一盘3、把土豆丝再加工一下，剁成细细粒剁成细细粒剁好后继续放回盘子里4、干香菇用热水泡开，切丝后再切细粒香菇也是切细粒5、炒锅加一点点油热锅，先把香菇粒爆香一点点油热锅先把香菇粒爆香6、再把土豆细粒也倒进去，翻炒大约 1 分钟土豆细粒也倒进去翻炒7、平时炒菜的食盐分量稍微多点，加盐调味，翻炒均匀后，关火（记得关火啦）8、撒入虾皮，撒上一层五香粉，再次翻炒均匀后，再次摊开，让它自然冷却撒入虾皮，撒上一层五香粉自然冷却9、土豆在冷却的时候就来处理猪肉，切小片再剁成肉末，加入一勺鱼露调味，这个时候土豆也冷却的差不多了，可以把肉馅放进去拌匀。猪肉剁成肉末把肉馅放进去拌匀馅料就弄好了。## 包饺子准备一碗清水。准备包饺子1、拿一张饺子皮，手指沾点清水涂一圈2、勺子舀点馅，放在饺子皮中间手指沾点清水涂一圈，勺子舀点馅，放在饺子皮中间3、中间拎起来，对折捏紧中间拎起来，对折捏紧4、先把右下角捏紧先把右下角捏紧5、再把右上角一合，一侧就封好了再把右上角一合6、另外一侧也一起包起来另外一侧也一起包起来饺子就包好了！包好的饺子其他的也是按这个步骤都包起来，这个包法很简单，很快就熟悉的！全部包好的样子## 蒸饺子依然是蒸饺，汤锅煮水，水开了放入蒸架，垫上蒸片，铺上弄湿了的蒸布，饺子摆上去，盖上锅盖， 800 瓦倒计时蒸 10 分钟即可。准备蒸饺子蒸熟啦！饺子可以全部蒸熟，然后留一饭盒明天中午做煎饺吃！！！很好吃这个土豆饺子"
  },
  {
    "slug": "hongzao-yumi-paigu-tang",
    "title": "菜谱：煲个红枣玉米排骨汤（1.5h）",
    "desc": "我中午下去买了玉米土豆还有排骨猪肉，然后就回来啦！哈哈哈要做一个遵纪守法的花臂小哥！今晚煲了个玉米排骨汤！（步骤和莲藕排骨汤差不多其实…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220315232003.jpg?x-oss-process=image/interlace,1",
    "content": "居家办公的第二天，今天楼下的店铺倒是很配合的，只留下餐饮的开着了，不过今天的志愿者和辅警工作人员还是很辛苦，一直在广播通知群众买完东西或者测完核酸就赶紧回家，不要在外逗留，特别是听到“谢谢你们的理解和配合”的时候，有点泪目！我中午下去买了玉米土豆还有排骨猪肉，然后就回来啦！哈哈哈要做一个遵纪守法的花臂小哥！今晚煲了个玉米排骨汤！（步骤和莲藕排骨汤差不多其实…成品图：红枣玉米排骨汤## 主要食材1、排骨 1 条，让老板帮忙剁小块2、甜玉米 1 根3、红枣 2 \\~ 3 粒（最近买的枣比上次的小，所以我加了 3 粒，上次莲藕排骨汤是大枣）其他的看自己喜好，看要不要加：4、薏米 1 小把5、花生米 1 小把（啊啊啊我真的好喜欢花生！！！）因为我最近不能吃萝卜，所以没有加胡萝卜，改成了薏米和花生一起煲。## 其他辅料1、盐，出锅的时候调味2、葱 1 根3、姜 1 小块## 浸泡食材1、排骨洗净，然后用清水浸泡大约 30 \\~ 40 分钟，泡掉血水和杂质，中间可以换一下水继续泡2、薏米和花生米也提前浸泡十几分钟浸泡中## 处理食材1、汤锅加入较多的冷水，淹没排骨并且稍微多点2、排骨倒进去，加入洗净切片的姜，还有洗净的葱3、开 1000 瓦，盖上锅盖煮到水沸腾准备焯排骨期间把玉米洗净剁小块，薏米和花生也倒掉浸泡的水，还有红枣切开去核，都先放到电饭锅里。玉米剁小块准备好的玉米和花生、薏米排骨煮到水沸腾了就好了，捞走浮沫，夹走葱和姜，把排骨和汤一起倒入电饭锅。捞走浮沫和葱姜倒入电饭锅## 煲汤阶段按下煮饭键，煲大约 40 分钟。煲汤煲汤## 煨汤阶段和莲藕排骨汤的步骤一样，时间到了就从电饭锅转移回汤锅，800 瓦先煮 5 分钟，然后转 300 度慢慢煨，然后就去煮饭，等饭好了汤也就好了，这个过程也是大约 40 分钟，加点盐调味就行。舀到汤锅里用汤锅煨我今晚的汤是故意煲多一点，留半大碗汤明天中午煮个高汤面条哈哈哈哈。出锅啦好吃哈哈哈"
  },
  {
    "slug": "zhuhou-roujiang-laomian",
    "title": "省钱菜谱：2元的柱侯肉酱捞面（10min）",
    "desc": "居家办公的第一天，今天一大早楼下其实都开着店，不过很快就听到了巡逻车在通知关门，只允许饭店和超市开着，否则要贴封条，防疫工作真是不容易！希望过完这周，深圳能恢复原来的样子！中午也没搞太复杂的东西，前几天凑单买了瓶柱侯酱，刚好拿来做个面条！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220314214929.jpg?x-oss-process=image/interlace,1",
    "content": "居家办公的第一天，今天一大早楼下其实都开着店，不过很快就听到了巡逻车在通知关门，只允许饭店和超市开着，否则要贴封条，防疫工作真是不容易！希望过完这周，深圳能恢复原来的样子！中午也没搞太复杂的东西，前几天凑单买了瓶柱侯酱，刚好拿来做个面条！成品图：柱侯肉酱捞面## 主要食材1、瘦肉，切了大约 2 元的分量2、面条，自己抓平时一碗面的分量，这个是我妈妈寄给我的所以没花钱3、葱 1 根## 调味辅料1、柱侯酱一大勺（或者 2 平勺）2、白砂糖一点点，大约 0.2 勺就够3、淀粉一点点，跟白砂糖的份量差不多就够4、蒜头油或者香油 1 勺5、一大碗凉白开柱侯酱比较咸，所以我觉得不用再另外加酱油或者盐了，可以根据你的习惯再调整。## 备料过程1、瘦肉切小片，然后剁成肉末2、切葱花3、把柱侯酱、白砂糖，还有小半碗热水一起兑匀4、淀粉加一点冷水兑匀，弄成水淀粉准备好的食材## 先煮面1、面条煮熟，捞到凉白开里过一边冷水，然后再捞干先把面煮熟过冷水2、加入一勺蒜头油或者香油拌匀，避免变坨加入蒜头油拌匀## 炒肉酱1、炒锅加入一点油，热锅，肉末先炒熟肉末先炒熟2、倒入柱侯酱料汁、水淀粉、撒入葱花加入料汁和葱花、水淀粉3、煮到沸腾就可以关火煮到沸腾这个步骤很快就好，其实时间主要是用来煮面了哈哈哈…最后把肉酱淋在面条上面，拌匀就可以开吃！肉酱淋上拌匀开吃！"
  },
  {
    "slug": "hujiao-chao-suidan",
    "title": "省钱菜谱：1.9元的胡椒炒碎蛋（2min）",
    "desc": "今晚分享一个我很喜欢的番茄鸡蛋汤的做法，甜口，和平时在外面吃的番茄鸡蛋汤不太一样，对比外面常见的咸口的番茄鸡蛋，我更钟爱于酸酸甜甜的口感。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220313232532.jpg?x-oss-process=image/interlace,1",
    "content": "没想到准备迎接新的一周的时候，居然收到封村封小区并且接下来要在家办公一周的通知…大家注意安全啊！需要囤点食材的可以参考我过年前写的异地过年指南，适当囤一些就可以了，加油！！！下午给三只猫洗了澡，累死了，所以今晚超级简单的一餐，煮了个粥，然后炒了个鸡蛋配粥哈哈哈。成品图：胡椒炒碎蛋## 主要食材1、鸡蛋 3 个2、胡椒粉 0.5 勺3、鱼露 0.8 勺## 准备过程1、鸡蛋打散，用筷子把蛋液打匀2、加入鱼露和胡椒粉，再次打均匀## 烹饪过程1、一点点油热锅，可以适当把油推来推去润一下锅润一下锅2、油温上来了，倒入蛋液，锅铲沿着逆时针或者顺时针都行，把蛋液转圈倒入蛋液转圈转圈圈3、这样蛋液会一边凝固一边被打成碎蛋打成碎蛋4、不太碎的可以用锅铲切小块，炒到都凝固熟了就可以装盘了凝固了就可以装盘了啧啧，配白粥真的很好吃哈哈哈！！！好吃哈哈哈"
  },
  {
    "slug": "tudou-men-wuhuarou",
    "title": "省钱菜谱：5.5元一餐的土豆焖五花肉（12min）",
    "desc": "这是今晚和明天中午的菜，所以价格按一半算，做之前提前煮一壶热水，兑料汁要用，等会洗碗也可以用。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220309002819.jpg?x-oss-process=image/interlace,1",
    "content": "穿了没几天的短裤背心，又开始凉凉的，早晚温差大，这几天又穿长裤了，我可喜欢夏天了，可以穿着背心露花臂。今晚安利一首霜冻前夜乐队的《嘲笑悖论》纯音乐，2013 那张 Live 版专辑的现场太棒了，比录音棚爽太多！！！也是我超爱的一支旋死乐队！然后，这是今晚和明天中午的菜，所以价格按一半算，做之前提前煮一壶热水，兑料汁要用，等会洗碗也可以用。成品图：土豆焖五花肉## 主要食材1、五花肉一条，我切了一点留给明天煮面，今晚做菜的大约 10 元2、土豆 1 个，约 1 元## 处理食材1、五花肉切成大约半厘米厚的小块2、土豆洗净削皮，切成滚刀块，再冲洗一下洗掉切面的粘液五花肉切差不多这么厚## 调料汁1、蚝油 1 勺2、老抽酱油 0.5 勺3、生抽酱油 1 勺4、盐一点点（平时炒菜的一半）5、白砂糖 0.3 勺6、胡椒粉 0.3 勺加开水兑成小半碗料汁备用。所有食材## 烹饪过程1、不用太多的油，先热锅，油温上来了先把五花肉倒下去煎煎五花肉不定期翻一下2、煎到表面呈现金黄色，倒入土豆块一起翻炒加入土豆一起翻炒五花肉表面会呈现金黄色3、倒入料汁，翻炒均匀倒入料汁翻炒4、盖上锅盖，焖大约 5 分钟（中间偶尔开盖翻一下避免糊锅，顺便观察水量，水太少了就提前开盖）盖上锅盖焖5、等锅里的汤汁吸收的差不多了，这个时候也会比较粘稠，大火收汁出锅掀开盖子准备收汁大火收汁土豆本身淀粉很多，所以不需要勾芡。出锅的样子哈哈哈这种收汁的菜要趁热吃！好吃的焖肉和焖土豆"
  },
  {
    "slug": "furu-zheng-paigu",
    "title": "蒜香腐乳蒸排骨（30min）",
    "desc": "继上次的那个 “腐乳蒸肉片”，当时说还可以蒸排骨，所以今天来做下排骨版本。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220306012707.jpg?x-oss-process=image/interlace,1",
    "content": "这几天深圳可太潮湿了，连人都软趴趴的干啥都不想动，朝北的房间地板也湿漉漉的，终于也忍不住买了除湿盒回来，希望有效果（我之前在广州呆了那么久都没用这个东西，一直住的东南朝向没太大感觉，终于第一次用……）还好昨晚有先见之明，知道这种天气肯定是起不来，买了排骨提前腌制了，虽然 12 点前就睡觉了，好像是天气问题然后一直做梦睡的很沉，11 点多才醒，起来直接煮饭倒也不耽误午餐哈哈哈…继上次的那个 “腐乳蒸肉片”，当时说还可以蒸排骨，所以今天来做下排骨版本。成品图：蒜香腐乳蒸排骨## 主要食材1、排骨 1 条，让老板剁小块2、腐乳 2 块，顺便加 2 \\~ 3 勺腐乳汁（一般都论瓶卖）3、蒜头几瓣4、白砂糖## 浸泡排骨1、冲水洗干净，然后放大碗里，用清水浸泡2、大约浸泡 1 小时，这个过程用来泡掉排骨里面的血水和腥味杂质等等3、期间可以看水的情况更换 1 \\~ 2 次，泡到不再明显有血水渗出就可以了## 腌制排骨把泡排骨的水倒掉，加入 2 块腐乳和 2 \\~ 3 勺腐乳汁，洒上一层白砂糖，抓匀，放保鲜盒腌制一晚上。加入腐乳抓匀腌制## 蒸排骨1、腌制好的排骨放盘子里2、蒜头拍碎，去皮，也放盘子里3、抓匀排骨和蒜头蒸之前的排骨4、汤锅煮水，水开了放入这种三脚的不锈钢蒸架5、盘子放上去，盖上锅盖， 800W 蒸 30 分钟。蒸排骨汤锅的水量根据蒸架的高度尽量多点，避免烧干，然后开个倒计时，免得忙别的就给忘记了。蒸好了用抹布隔热拿出盘子，拌匀就可以吃啦！出锅啦！## 最终成品腐乳真是好东西哈哈哈，这个做法的排骨真好吃！拌匀的排骨好吃！"
  },
  {
    "slug": "huasheng-lianou-paigu-tang",
    "title": "菜谱：煲个花生莲藕排骨汤（1.5h）",
    "desc": "周末煲个汤哈哈哈哈！最近玉米价格疯了，煲莲藕也不错！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220228001233.jpg?x-oss-process=image/interlace,1",
    "content": "周末煲个汤哈哈哈哈！最近玉米价格疯了，煲莲藕也不错！工具方面，因为没有高压锅，隔水炖不适合煲浓汤，所以我选择了电饭煲 + 汤锅的搭配来做。可以提前准备一壶热水备用。成品图：花生莲藕排骨汤## 挑选莲藕莲藕有 “脆藕”和 “粉藕”的区别：脆藕一般用来炒菜，口感比较脆，用潮汕话说就是 “shǎo shào”粉藕更适合用来煲汤，口感比较糯，粉粉糯糯超好吃！挑选的时候从外观就可以区分：脆藕的外形瘦长，表皮比较光滑粉藕则相反，外形比较短粗，并且表皮比较粗糙如果没把握也可以问档主是不是粉藕。另外粉藕是 7 孔，脆藕是 9 孔，如果有看到被掰断的，也可以通过横截面来判断（只看大孔，那些小小的小孔可以忽略）。这是今天选的粉藕这是旁边看到的脆藕## 主要食材1、排骨一条，让档主帮你先剁小块2、莲藕 1 \\~ 2 小节，粉藕比较短，看具体大小自己把控一下3、花生米一小把4、红枣 2 粒5、葱 1 根6、姜 1 小块7、盐## 浸泡食材1、排骨先提前洗净然后静置泡水，这个过程会把排骨里面的杂质和血水泡出来，大约需要 30 \\~ 40 分钟的过程，中间需要更换几次水2、花生米也要提前浸泡十几分钟在浸泡的排骨和花生米## 处理莲藕等排骨浸泡的差不多了就可以处理莲藕。1、洗净削皮，再次洗净，先切小段，看看横截面，是不是， 7 孔的哈哈哈，粉藕没错了！7 孔的是粉藕“藕断丝连” 形容的就是粉藕，来感受一下？藕断丝连然后切成滚刀块。滚刀块2、汤锅倒入我们准备好的热水，放入莲藕，加一勺盐（调味盒的小勺子）3、开 1000 度，盖上锅盖，倒计时 2 分钟焯水，然后捞到电饭锅里这个步骤可以让莲藕不会变黑。焯一下水## 处理排骨1、汤锅洗净，加入较多的冷水，要能淹没排骨并且稍微多点泡好的排骨2、排骨倒进去，加入洗净切片的姜，还有洗净的葱放入葱和姜3、先开 1000 度，盖上锅盖，煮到水沸腾4、捞走浮沫，夹走葱和姜捞走浮沫和姜葱5、把排骨和汤一起倒入电饭煲倒入电饭煲因为排骨已经泡了很久很久了，所以这里和平时的焯水不太一样，平时焯水会有很多杂质和腥味，但这个不会有，只需要捞走浮沫，剩下的还是我们需要的汤。## 煲汤阶段红枣洗净撕开口子，还有把花生米也一起倒进电饭煲，然后按煲饭键煲 40 分钟。加入两粒红枣电饭煲煲好的样子## 煨汤阶段时间到了就从电饭锅转移回汤锅。倒回汤锅里先 800 度先煮 5 分钟。先开 800 度然后转 300 度慢慢煨，然后就去煮饭，等饭好了汤也就好了，这个过程也是大约 40 分钟。文火慢煨汤已经很浓了之所以分两个阶段，是因为我想煮排骨浓汤，浓汤需要沸腾，所以之前那个隔水炖锅无法把汤做到这个程度。电饭煲先把食材煲到软透，再通过汤锅的小火慢慢煨，达到目的。## 搭配蘸酱这个汤本身很甜，加点盐调味就行，不需要太多的配料，排骨和莲藕都很好吃！出锅啦当然你也可以搭配排骨辣酱，哈哈哈也非常棒！蘸酱也好好吃呜呜呜"
  },
  {
    "slug": "kao-jinzhengu-roujiang-roufu",
    "title": "省钱菜谱：6.2元的烤金针菇肉酱豆腐（20min）",
    "desc": "今晚吃个金针菇烤豆腐，加点肉末，解决晚餐，需要提前煮一电热壶的开水备用，还有锡纸和空气炸锅。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220226234158.jpg?x-oss-process=image/interlace,1",
    "content": "今天疫情又那啥了，下午公司就通知我们提前回家，不要在外逗留……回到住的地方，社区也在宣传 25 到 28 号每天都要测核酸，还好我早上在公司楼下测了，不然回到家还要下楼排队…不知道周一能不能上班诶，还要等通知\\~希望平安！今晚吃个金针菇烤豆腐，加点肉末，解决晚餐，需要提前煮一电热壶的开水备用，还有锡纸和空气炸锅。成品图：烤金针菇肉酱豆腐## 主要食材1、金针菇一把 1.2 元2、瘦肉切一小块约 2 元3、水豆腐两块 3 元4、蒜头 4 瓣5、指天椒 2 根## 调料汁1、老抽酱油 0.5 勺2、生抽酱油 1 勺3、蚝油 1 勺4、胡椒粉 0.2 勺加小半碗开水兑成料汁备用。## 处理食材1、金针菇切掉头部，冲几次水洗净洗净的金针菇2、汤锅倒入提前煮好的开水，金针菇放进去，加一点盐，倒计时煮 2 分钟，然后去掉浮沫捞出来备用水开下锅焯水去浮沫3、蒜头拍碎去皮，剁成蒜末4、指天椒洗净去头，切碎，再剁碎5、瘦肉切片后剁成肉末6、水豆腐切九宫格准备好的食材锡纸需要大张一点，等会要包住食材，先铺在空气炸锅底部。1、豆腐放进去铺平2、金针菇盖上去码好的豆腐和金针菇## 烹饪过程1、炒锅倒点油热锅，爆香蒜末和指天椒爆香蒜末和指天椒2、肉末倒进去炒散3、料汁倒进去翻炒一会把肉末炒散炒匀4、关火，淋在豆腐和金针菇上面淋上去5、包好锡纸，放进空气炸锅烤 15 分钟完全包住装盘的时候先把金针菇夹到盘子里，然后勺子去盛豆腐，不怕盛碎，等下吃的时候碎碎的豆腐带着酱汁更好吃！出锅的样子不过对锡纸就要小心点，最好不要弄破，豆腐也盛出来后，锡纸提起来，把剩下的酱汁淋上去，搞定！出锅啦！很下饭哈哈哈哈！豆腐好好吃金针菇也好吃"
  },
  {
    "slug": "wandouli-chao-roumo",
    "title": "超级下饭的豌豆粒炒肉末（10min）",
    "desc": "前两天不是做了酸菜炒牛肉用了指天椒嘛，一小份还有好几根，所以昨晚又炒了个可以消灭指天椒的菜，豌豆粒炒肉末，好好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220224133710.jpg?x-oss-process=image/interlace,1",
    "content": "前两天不是做了酸菜炒牛肉用了指天椒嘛，一小份还有好几根，所以昨晚又炒了个可以消灭指天椒的菜，豌豆粒炒肉末，好好吃！这是两顿的分量，豌豆粒有点贵，这些食材加起来差不多 16 块钱，也就是一餐 8 块钱。在做菜之前，提前用电热壶煮一壶热水备用。成品图：豌豆粒炒肉末## 主要食材因为要做两顿的量（晚餐 + 第二天中午带饭），所以分量比较多，一个人一餐可以减半。1、豌豆一把，我这里的分量约 3 两2、瘦肉一块，这里大约 4 两3、干香菇拿 4 \\~ 5 朵，先用热水泡着4、指天椒 2 根5、蒜头 4 瓣6、虾皮抓一小把，没有的话也问题不大## 调料汁搭配1、蚝油 1 勺2、生抽酱油 1 勺3、老抽酱油 0.5 勺4、胡椒粉 0.2 勺和小半碗热水兑匀备用，食材少的话也要适当减少用量噢。## 备料过程1、电热壶的热水倒进汤锅，豌豆粒倒进去，平时炒菜的温度（我 800 度），倒计时 5 分钟，让它煮着焯水豌豆粒焯水2、瘦肉切丝再切丁，然后剁成肉末3、蒜头拍碎去皮，剁成蒜末（不用太细腻）4、干香菇用热水泡开后，切细丝5、指天椒去头切圈6、这个时候豌豆粒也煮的差不多了，用笊篱捞出来准备好的食材## 炒菜过程1、倒油热锅，油温上来了先把香菇丝下去爆香香菇丝先爆香2、然后倒入蒜末和椒圈也一起爆香（这里几秒的时间就可以）蒜末椒圈一起爆香3、然后倒入肉末翻炒到大部分都变色倒入肉末翻炒变色4、倒入豌豆粒和虾皮一起翻炒几下倒入豌豆粒和虾皮，翻炒均匀5、淋上料汁翻炒均匀，然后煮着（这个时候应该开火 3 分钟左右，煮大约 2 分钟，不定期翻炒一下）倒入料汁一起翻炒，煮着6、开大火（我从 800 度调到了 1300 度），进行大火收汁几秒就会把料汁都收干，就可以关火装盘了。装盘啦！好吃！！！豌豆粒焯水煮 5 分钟可以保持它的翠绿色，也可以让它做出来更软更好吃！超级下饭！我中午也带饭吃这个哈哈哈哈哈，好好吃！！！"
  },
  {
    "slug": "chaoshan-suancai-chao-niurou",
    "title": "潮汕经典家常菜之酸菜炒牛肉（2min）",
    "desc": "这是昨天中午的午餐哈哈哈，忙了一天多现在才有时间来整理（昨晚做蛋糕去了…），酸菜炒牛肉是潮汕的一道经典菜，潮汕特色的酸菜，搭配潮汕特色的调味料，很好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220222002124.jpg?x-oss-process=image/interlace,1",
    "content": "这是昨天中午的午餐哈哈哈，忙了一天多现在才有时间来整理（昨晚做蛋糕去了…），酸菜炒牛肉是潮汕的一道经典菜，潮汕特色的酸菜，搭配潮汕特色的调味料，很好吃！！！满满一盘实在太满足了哈哈哈哈哈哈！！！成品图：酸菜炒牛肉## 主要食材1、牛肉一块，牛肉比较贵，分量方面自己把握一下2、酸菜半条，超市和菜市场都是按条卖的，我们用半条就够（剩下的半条我今天中午带饭用掉了）3、指天椒 3 根4、蒜头 5 瓣5、姜一小块（腌制牛肉用）6、老抽酱油（腌制牛肉用）7、沙茶酱（腌制牛肉用）8、盐（腌制牛肉用）9、生粉（腌制牛肉用）10、油（炒菜的油就可以，放这里说是因为腌制牛肉要用）酸菜和咸菜不是同一种东西哦！是另外一种潮汕特色腌菜，在菜市场买就直接问老板说是要买酸菜，超市买的都有包装，可以很直观的区分。## 处理牛肉牛肉很讲究刀法，倒不是说要切的很薄很薄，反而这次可以大块一点，爆炒的方式切太小块等下吃不到肉了哈哈哈哈哈（牛肉粿条、牛肉火锅那些才要尽量片薄）。1、先看牛肉的纹路，牛肉讲究横着切，意思就是刀是对着纹路横着切下去的，也就是垂直，不要顺着纹路，横切的牛肉很嫩，否则很老很难嚼按照这个方向去切2、大概 3 \\~ 4 毫米的厚度切大块一点，具体可以看我图片里的样子大概这么厚切出来的纹路呈 “井” 字形。切好的样子3、姜洗净，切细丝切好的姜丝和牛肉4、把牛肉和姜丝放到大碗里5、加入调味盒那种勺子的 1 勺生粉， 0.3 勺子的盐1 勺生粉0.3 勺盐6、加入 0.5 餐勺的沙茶酱（就是我图片里那根勺子）7、加入 0.3 餐勺的老抽酱油（用来上色，不用多）8、淋上一圈食用油，抓匀腌制 20 分钟，这个步骤是让牛肉更嫩滑更好吃全部抓匀腌制## 处理其他食材1、指天椒洗净，去头，切圈指天椒和蒜头2、蒜头拍碎，去皮，剁成蒜末（不需要很细）拍碎去皮剁成蒜末3、酸菜切半条就够用，洗干净，可以多用水冲几遍，这样不会太咸，然后切小段一包酸菜切半条就可以这是准备好的所有食材。所有食材## 烹饪过程1、炒锅倒油，炒牛肉的油量要多一点，这样炒出来才滑倒油2、开中大火（电磁炉我开到 1000 度），热锅期间用锅铲把油适当来回推一下，润锅，这样等下四周也有油，不会粘锅推来推去润锅3、伸手试探油温，非常热了再下食材试探油温4、指天椒和蒜末先倒下去爆香，然后倒入酸菜炒几下爆香指天椒和蒜末先炒酸菜5、牛肉用勺子拨散（不要粘成一团），倒进去爆炒，变色了就可以赶紧关火出炉再把牛肉倒进去变色就可以出炉牛肉不要炒太久，太久了口感会很老！所以整个过程实际上就是热锅用了大约 1 分多钟（天太冷了主要是），爆炒指天椒和蒜末用了几秒，炒酸菜用了十来秒，最后牛肉下去也只是炒了不到 30 秒就熟了，整个过程非常快！超级好吃！！！没有缺点！哈哈哈哈要说有的话可能就是牛肉太贵了呜呜呜…成品图牛肉好好吃！酸菜也很好吃！"
  },
  {
    "slug": "chaoshan-shacha-banmian",
    "title": "省钱菜谱：2块钱的潮汕沙茶拌面（10min）",
    "desc": "今天 2 月 14 日，是……一个普普通通的周一哈哈哈哈哈哈哈哈哈哈…………前几天我妈给我寄橄榄的时候问我还想吃啥，我说寄点“面薄”哩，然后我终于在深圳吃到了潮汕的 “面薄”，果然还是家里的面条好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220214222145.jpg?x-oss-process=image/interlace,1",
    "content": "今天 2 月 14 日，是……一个普普通通的周一哈哈哈哈哈哈哈哈哈哈…………前几天我妈给我寄橄榄的时候问我还想吃啥，我说寄点“面薄”哩，然后我终于在深圳吃到了潮汕的 “面薄”，果然还是家里的面条好吃！！！今晚吃个沙茶拌面，简简单单又好吃！先安利一首九宝乐队的《骏马赞》，如果这次过年有看央视的网络春晚的话肯定听过！泪目！金属乐终于走上了央视的舞台！九宝是蒙古民族风格的金属乐队，非常优秀，我超喜欢！！！疯狂安利！！！成品图：沙茶拌面## 主要食材1、面条，我这次用了潮汕的面薄，一种很好吃的扁面条，其他面条也可以，我妈妈寄过来的所以没花钱2、瘦肉，切了 2 块钱的分量，切薄片备用3、沙茶酱 1 勺4、老抽酱油 1 勺5、芝麻香油 1 勺6、蒜头朥 1 勺7、凉白开一大碗## 调料过程水煮开了，先加 3 勺热水把沙茶酱化开，再和老抽一起兑匀备用。准备好的食材## 煮面过程1、水开了下面条，煮到沸腾了再加一小碗冷水，再次沸腾就关火煮面2、把面条捞干放到凉白开里，过一下凉水就可以再次捞干滴干水份过凉水捞干3、处理好的面条加入蒜头朥和芝麻香油，拌匀备用，这样就不会坨淋上蒜头朥和香油拌匀备用## 最终步骤肉片烫熟，捞干到面条碗里，淋上兑匀好的酱料，拌匀即可。淋上沙茶酱拌匀开吃和我之前发过的 “灌面” 步骤相似，不过这次没有加花生酱哈哈哈哈，是另外一种风味！"
  },
  {
    "slug": "tudou-kao-cuipi-meitourou",
    "title": "省钱菜谱：8块钱的土豆烤脆皮梅头肉（20min）",
    "desc": "今晚突然想吃脆皮烧肉，但是家里只有一块还没切的梅头肉，所以弄了个简易版本的，除了包锡纸之外，貌似没有相似之处哈哈哈哈哈哈哈哈哈哈哈哈哈哈。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220213234248.jpg?x-oss-process=image/interlace,1",
    "content": "今晚突然想吃脆皮烧肉，但是家里只有一块还没切的梅头肉，所以弄了个简易版本的，除了包锡纸之外，貌似没有相似之处哈哈哈哈哈哈哈哈哈哈哈哈哈哈。成品图：土豆烤脆皮梅头肉## 主要食材1、梅头肉一块，昨晚切了一部分炒猪肠粉了，今天这部分大概 7 块钱2、土豆一个，大约 1 块钱3、鱼露 1 勺（腌制用，用盐不好入味，你也可以用生抽，但鱼露更鲜美）4、五香粉（腌制用）5、花椒粉（腌制用）6、细白砂糖（腌制用）7、葱一颗（飞水用）8、姜一小块（飞水用）9、辣椒粉（撒粉用）10、孜然粉（撒粉用）需要准备点锡纸，用空气炸锅烤的。## 备料过程1、葱姜和猪肉一起冷水下锅，大火煮到快沸腾就关火，去掉浮沫，把肉夹出来放凉一下（不然抹腌料的时候烫手）准备飞水2、猪皮用牙签戳若干个小孔，我今天飞水后有一点点皮肉分离，可以用这根牙签给它穿一下扎住定型如果带出来的水太多就用厨房纸巾吸一下3、加入 1 勺鱼露，两面各自撒上一层五香粉和花椒粉，一点点细白糖，抹匀，按摩一下，放冷藏腌制半小时加入鱼露加入五香粉和花椒粉和糖抓匀腌制4、准备烤之前就去洗土豆，削皮，切滚刀块## 烤肉过程1、像嫩牛五方那样把梅头肉包起来，留下猪皮部分朝外不包准备包包好的样子底部是兜住的2、放炸锅里是立起来的，猪皮朝上，所以土豆的作用其实是用来帮助它站立的（真 · 工具人），当然土豆也很好吃哈哈哈哈在锅里这样摆3、恒温 200 度 烤 20 分钟## 出炉过程1、筷子先把肉夹出来放盘子里放凉一会，等会要切烤好的样子，夹出来2、锡纸先拿出来扔掉，然后把土豆夹出来围一圈3、把肉按你的喜好切小块（我用厨房剪刀处理好方便！）4、撒上一层孜然粉和一层辣椒粉撒粉搞定好好吃过程工作量不多，这个脆皮也没有很硬，脆脆的超级香！脆皮超级香烤肉的时候我还去炒了个番茄鸡蛋汤，搭配起来一点都不腻！好吃！！！搭配了番茄鸡蛋好好吃"
  },
  {
    "slug": "furu-zheng-roupian",
    "title": "省钱菜谱：6块钱的腐乳蒸肉片（20min）",
    "desc": "这是跟我妈学的一个做法，我以前读书在家的时候就很喜欢吃了，蒸肉蒸排骨都好吃，偏甜口。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220214004426.jpg?x-oss-process=image/interlace,1",
    "content": "这是跟我妈学的一个做法，我以前读书在家的时候就很喜欢吃了，蒸肉蒸排骨都好吃，偏甜口。成品图：腐乳蒸肉片## 主要食材1、猪肉，我今天用的是瘦肉，昨天包饺子留下来的一块，按比例应该差不多6块钱2、蒜头几瓣3、腐乳 2 块，可以带多一勺腐乳汁哈哈哈4、白砂糖我用的这种腐乳## 备料过程1、猪肉切成薄片，洗净，放碗里备用2、蒜头拍碎，去皮，放碗里备用3、勺子挖两块腐乳和一勺腐乳汁到碗里备用这个分量的腐乳4、两平勺白砂糖把所有食材抓匀，腌制大约半小时。抓匀腌制## 蒸肉过程1、汤锅加适量的水煮开，放上三脚架水煮开，放上三脚架2、把肉转移到盘子里（哈哈哈我锅太小，那个小盆子有点高），放架子上把肉转移到盘子里3、盖上锅盖， 800 度倒计时 20 分钟慢慢蒸慢慢蒸出锅拿出来，用筷子拌匀一下就可以吃啦！出锅啦拌匀，好吃！"
  },
  {
    "slug": "chaozhou-niurouwan-pin-niujinwan-guotiaotang",
    "title": "菜单分享：潮州牛肉丸拼牛筋丸粿条汤",
    "desc": "啊哈哈哈分享个菜单，牛肉丸和牛筋丸是年前买的，过年过节哪怕没回家，牛肉丸一煮，家乡的感觉就出来了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220214005726.jpg?x-oss-process=image/interlace,1",
    "content": "我居然从 12 点滚来滚去滚到了 5 点多还十分精神…三只猫睡的好熟，明明他们才是夜猫子，结果一个个在打鼾… 留我一个人在这睡也不是，起床也不是…## 菜单搭配啊哈哈哈分享个菜单，牛肉丸和牛筋丸是年前买的，过年过节哪怕没回家，牛肉丸一煮，家乡的感觉就出来了！！！牛肉丸牛筋丸粿条汤## 牛肉丸价格顺便温馨提醒，一斤 60 左右的价位才是潮汕牛肉丸的价格，卖的很便宜还说正宗的都可以直接忽略努力睡几个小时！！！晚安！！！"
  },
  {
    "slug": "suanxiang-kao-jituipa",
    "title": "省钱菜谱：3.09元的蒜香烤鸡腿扒（15min）",
    "desc": "是我前天晚餐和昨天的午餐和晚餐，蒸饺和煎饺都好吃哈哈哈哈！想做这个是因为那天买的芋头太大个了，剩下的感觉要吃好久，干脆包成饺子！也是潮汕这边比较常见的小吃用料，这个做法是沿袭了我家那边的芋粿、芋丝球（芋丸）、芋丝糕等小吃的做法，做了一点调整。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204215537.jpg?x-oss-process=image/interlace,1",
    "content": "我以为过年可以 “安安静静” 的在卧室放几天金属乐，没想到我这一层的邻居都没回家……所以还是乖乖的戴耳机听歌吧哈哈哈哈哈（我平时都戴耳机，只是想着难得有机会不会吵到人…说来也是挺有意思的，好像真的自从 AirPods 推出后，就很少有邻居用音箱放歌了，大家都开始习惯戴耳机了（前些年我还在瞎操心那些情侣合住的，听歌风格不一样怎么办？现在应该都没这个烦恼了吧哈哈哈哈哈…菜谱之前安利一首 The Will On Kill 乐队的《路遥》，我超喜欢的一支粤核乐队！！！最近几次爬山经常循环他们的歌！说回今天的腿扒，今天没有用煎的方式来做，空气炸锅烤的，不用油（香油算调味品不算油吧哈哈哈哈）。成品图：蒜香烤鸡腿扒## 主要食材1、鸡腿扒，年前猫超买的，带骨的，我今天剔骨了哈哈哈2、几瓣蒜头3、姜葱料酒 0.5 勺4、老抽酱油 0.5 勺6、芝麻香油 0.5 勺7、盐，调味盒勺子 1 勺（平时做菜的分量）8、生粉，用量和盐一样（适当锁住蒜香和水份）用了这个量的蒜头## 腌制过程1、腿扒是冻的，泡水解冻顺便泡出血水，用厨房剪刀剔骨，洗净腿扒剔骨2、蒜头拍碎，去皮，剁成蒜末，不需要很细腻剁成蒜末3、所有食材抓匀，腌制 2 小时（应该不需要这么久，不过我一般都是提前弄好放冷藏让它腌着）全部料一起抓匀腌制## 烤制过程1、锡纸一小张，能铺满锅底就行，主要防止蒜末掉下去2、腿扒放进去，半包式放进去烤烤之前出炉后我的锅是恒温 200 度，烤 15 分钟就行，出锅的时候蒜末会被烤焦，拨弄掉就好！切小块摆盘好好吃"
  },
  {
    "slug": "chaoshan-congzhulao",
    "title": "潮汕特色调味品 葱珠朥做法",
    "desc": "今天又煮了粿汁，刚好葱珠朥要做新的了，单独记录一篇菜谱哈哈哈。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220201234256.jpg?x-oss-process=image/interlace,1",
    "content": "今天又煮了粿汁，刚好葱珠朥要做新的了，单独记录一篇菜谱哈哈哈。之前也陆陆续续在菜谱里穿插写了几次，比如粿条卷、粿汁，反正经常用，单独写一篇好。成品图：葱珠朥## 主要材料香葱 1 \\~ 2 棵，因为这个超级容易做，所以每次不需要做很多，不像蒜头朥因为制作的时间比较长，所以每次才做一大瓶。还可以做成芝麻葱珠朥，准备多一小把白芝麻即可，我今天做原味的，所以没有加芝麻。## 准备工作1、葱洗净，切掉带根须的葱头，剥掉那几片滑滑的葱衣2、葱滴干水，放在通风的地方让洗葱时带上的水份尽量吹干3、用厨房剪刀剪成大约 1 厘米长的小段准备好的材料## 制作过程1、炒锅热油，平时炒菜的温度（我是电磁炉 800 度），油量不用很多，覆盖锅底就可以了在热油中2、油温上来了，把葱丁都倒进去，时不时拨动一下，让葱都能被油炸的均匀。下锅了3、葱丁会慢慢变焦，观察颜色，只要都开始有焦色（也就是几乎没有水份了）就可以关火了开始变焦陆续变色4、期间先炸好的可以先推到锅沿，最后都推上来，免得油温继续加热，就过度了。炸好了，先推上来冷却## 成品展示冷却的时候也可以像蒜头朥那样把葱珠朥和葱油分开冷却，如果你做芝麻葱珠朥，就可以把葱油淋在白芝麻上面先把白芝麻烫熟了！哈哈哈因为我还要做别的东西，所以没有占用炒锅，盛出来分开冷却了。分开冷却中## 保存方法密封罐保存，置于阴凉处，要用的时候也记得要用干燥的勺子去舀！！！## 食物搭配搭配潮汕粿汁好好吃！！！粿汁粿汁"
  },
  {
    "slug": "chaoshan-lushui-zhuerduo",
    "title": "潮汕卤水之卤猪耳朵",
    "desc": "是什么动力让我放假第一天早起？哈哈哈哈哈哈哈哈哈哈是为了跟大妈们抢猪耳朵，之前几个周末就想做卤猪耳了，结果每次去到都卖完了，一只猪就两只耳朵哈哈哈哈…",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220130233409.jpg?x-oss-process=image/interlace,1",
    "content": "是什么动力让我放假第一天早起？哈哈哈哈哈哈哈哈哈哈是为了跟大妈们抢猪耳朵，之前几个周末就想做卤猪耳了，结果每次去到都卖完了，一只猪就两只耳朵哈哈哈哈…## 成品图成品图：卤猪耳朵## 相关菜谱完整的过程跟之前做卤水五花肉是一样的！！！可参考文末的相关菜谱。## 制作步骤好大一只猪耳朵准备好的香料这个是炖好的样子卤好了冷却了就可以切了## 出炉效果一只耳朵刚好一盘哈哈哈哈炖的好软呜呜呜好好吃"
  },
  {
    "slug": "shacharoupian-kao-tudouli",
    "title": "省钱菜谱：6块钱的沙茶肉片烤土豆（15min）",
    "desc": "这个点突然就醒了…睡不着了，翻到个库存的笔记，发一下，继续睡哈哈哈，还可以再睡一个多小时，笔记当时记录的是上肉大约5块钱，土豆便宜，大约1块钱，分量挺多哈哈哈。",
    "cover": "https://cdn.chengpeiquan.com/img/2021/11/20220127132011.jpg?x-oss-process=image/interlace,1",
    "content": "这个点突然就醒了…睡不着了，翻到个库存的笔记，发一下，继续睡哈哈哈，还可以再睡一个多小时笔记当时记录的是上肉大约5块钱，土豆便宜，大约1块钱，分量挺多哈哈哈。成品图：沙茶肉片烤土豆## 主要食材1、上肉或者五花肉都行哈哈哈哈2、土豆一个3、沙茶酱4、老抽酱油## 准备工作1、沙茶酱一勺，半勺老抽，加水调成酱料调制好的沙茶酱2、肉切片后用沙茶酱腌制 20 分钟左右腌制一段时间3、土豆洗净，削皮，切丁## 烤肉过程没有包锡纸，空气炸锅200度烤15分钟～烤之前烤好后还可以用来上班带饭哈哈哈哈开饭啦！"
  },
  {
    "slug": "cuipi-yanjuji-tuipa",
    "title": "省钱菜谱：3.78元的脆皮盐焗鸡腿扒（20min）",
    "desc": "之前发过一次土豆脆皮烤鸡的做法，今晚用类似的方式搞了个脆皮盐焗鸡腿扒，也很好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220119232320.jpg?x-oss-process=image/interlace,1",
    "content": "之前发过一次土豆脆皮烤鸡的做法，今晚用类似的方式搞了个脆皮盐焗鸡腿扒，也很好吃！！！上周末天猫超市买了冻带骨鸡腿扒，实际支付一盒是 8.52 元，有 3 个腿扒，也就是 2.84 元一个。今晚晚餐烤了 2 个腿扒，吃了三分之一，留了三分之二明天中午带饭，也就是图片里的分量，所以明天的午餐是 3.78 元。成品图：脆皮盐焗鸡腿扒## 主要食材1、鸡腿扒 2 块2、盐焗鸡粉## 准备过程腿扒泡水里解冻后，洗净，用盐焗鸡粉抹匀提前腌制一晚上，抹匀就可以了，盐焗鸡粉没用多少。前后都抹匀这样才入味## 烤鸡过程空气炸锅恒温 200 度烤 20 分钟，因为我的锅小，所以每次只烤一块，大锅可以一起烤。放在空气炸锅里刚出炉的样子出锅后不烫手了就可以吃了哈哈哈，我是有把剪刀专门在厨房作为厨剪，用剪刀剪的，这种熟食用剪刀会更方便哈哈哈！先放到不烫手用厨房剪刀剪成小片外脆里嫩超好吃！"
  },
  {
    "slug": "chaozhou-yuguo-yusigao",
    "title": "省钱菜谱：3块钱一餐的芋粿（60min）",
    "desc": "我来了！昨晚的电饭煲做的芋粿，留了一半今晚煎，还是好吃哈哈哈哈！算了一下成本，分了两顿吃完，一顿 3 块钱，大约有 5 两重，性价比还蛮高的！芋粿是潮汕的小吃，我不确定和芋丝糕是不是完全一样哈哈哈，老家的粿是用的粘米粉，所以我也是用这个来做。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220120003111.jpg?x-oss-process=image/interlace,1",
    "content": "我来了！昨晚的电饭煲做的芋粿，留了一半今晚煎，还是好吃哈哈哈哈！算了一下成本，分了两顿吃完，一顿 3 块钱，大约有 5 两重，性价比还蛮高的！芋粿是潮汕的小吃，我不确定和芋丝糕是不是完全一样哈哈哈，老家的粿是用的粘米粉，所以我也是用这个来做。成品图：潮州芋粿## 主要食材1、芋头，很大个，有 2 斤，切了三分之一，也就是差不多 350 克，4 块钱2、粘米粉，按照芋头和粉 3:1 的比例，所以我称了 120 克，粘米粉比较贵，这里就差不多 2 块钱3、花生米一小把4、干香菇一小把5、虾皮一小把6、盐7、五香粉我做的基础斋款，你可以自己加肉末啊腊肠啊之类的，做成腊味芋丝糕！然后，粘米粉多点也没关系，所以不一定要拿称，自己目测一下差不多就行，但不要明显太少，太稀了挂不住，成不了型。这个是粘米粉## 备料过程弄芋头记得带好一次性手套哦！不然粘液会让手很痒！0、煮一壶热水，干香菇用热水泡开，花生米用冷水泡着1、芋头削皮，用刮丝器拓成丝（潮州话把这个动作叫 tua，找不到字哈哈哈 ）用刮丝器拓成丝2、洗净芋丝，洗几次没什么杂质就可以，然后捞干备用洗净芋丝捞干备用3、泡好的花生米搓皮，炸成金黄色搓好皮的花生米4、泡好的香菇拧掉水，切细细的丝，用刚才炸花生米的油爆炒一下，不用调味，也是盛出来备用爆炒香菇丝## 做粿1、芋丝、炸好的花生米、炒香的香菇丝，还有虾皮，一起倒进电饭煲的锅里2、撒上一勺子盐（调味盒的小勺子）3、撒上一层五香粉这么多五香粉就差不多了所有料放进去4、抓匀，稍微压一压让他们结实一点（不用特别大力）抓匀，稍微压一压5、粘米粉慢慢加水，用筷子打成米浆（陆陆续续慢慢加，别一下子不小心加太多水了）6、把米浆倒进电饭锅里，淹没芋头丝加入米浆小技巧：在调味之前，可以先用清水和芋头丝模拟一下需要多少水，然后再开始弄粿## 蒸粿1、按下电饭煲的煲饭键就可以啦！（所以加上备料的时间，才要耗时这么久）2、煮好了端出来冷却，等冷却固定了，用饭勺沿着四周转一圈，很容易就拿出来刚出炉的样子准备拿出来了一定要冷却了再去切，那样定型了就很好切，切小块去煎，就很棒！！！在冷却可以切了，厚的再对半切## 煎粿一定要等油温上来了再放下去煎，不然会粘锅，油温够高就不怕了！中火煎到两面金黄就可以了！煎好的样子## 最终成品外焦里嫩好好吃，配点辣椒酱，太棒了！外焦里嫩好好吃配点辣椒酱，太棒了！"
  },
  {
    "slug": "yurou-yuntun",
    "title": "省钱菜谱：3.15元一碗的鱼肉云吞（25min）",
    "desc": "我的第一篇菜谱笔记就是关于云吞的，当时是包的纯肉，最近巴沙鱼老是有打折，今晚包个鱼肉云吞吃吃。今晚的食材一共 11 块钱，包了 51 个云吞，平均一个云吞 2 毛 1，按照 15 个一碗刚好吃三碗，一碗就差不多 3.15 元。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220115235323.jpg?x-oss-process=image/interlace,1",
    "content": "我的第一篇菜谱笔记就是关于云吞的，当时是包的纯肉，最近巴沙鱼老是有打折，今晚包个鱼肉云吞吃吃。今晚的食材一共 11 块钱，包了 51 个云吞，平均一个云吞 2 毛 1，按照 15 个一碗刚好吃三碗，一碗就差不多 3.15 元。好久没安利歌了，今晚安利一首宝宝巴士的《141学习雷锋好榜样》，谁能想到这首歌居然还有个版本是儿歌搭配金属 RIFF ，特别上瘾哈哈哈哈哈哈…成品图：鱼肉汤云吞## 主要食材1、巴沙鱼柳，前几天美团买菜 12.42 元买一送一，用了一条鱼柳， 6.21 元，哈哈哈还挺大的，有两巴掌大2、一点点猪肉，选的猪上肉靠近皮的那一边，带点白一起做馅，大约 3 元3、云吞皮 2 元，没用完，估计用了大约 1.8 元的样子4、葱 2 颗5、姜 2 小块6、料酒 1 勺解冻中的鱼柳两巴掌大的巴沙鱼柳## 鱼柳去腥1、鱼柳买来是冷冻的，密封包装先不要拆，先在水里解冻2、然后切小块，切点葱丝、姜丝，加上一勺料酒，一起腌制 10 分钟然后这里的葱姜都挑出来不要了，等会用另外一份。腌制 10 分钟## 云吞馅1、葱姜都剁成末，因为鱼肉馅，加点葱姜末可以中和一下去掉腥味2、猪肉也切小块然后剁成肉末3、把鱼肉、猪肉末、葱姜末都混合一起剁匀云吞馅就好了，因为鱼肉很容易入味，依赖汤底就足够味道了，所以我没有加调味料，只保持原汁原味的鱼鲜味。怕不够味道的可以看情况自己加，不喜欢剁肉的也可以买个小绞肉机。几样主料慢慢往中间剁，就不会乱跳了剁好的鱼肉馅## 包云吞跟包饺子一样，准备一碗水。1、馅在中间，拉起对角往自己这一侧盖过来馅在中间卷起来要卷一下才不会散2、卷一下，两侧各点一点水，对折捏住，这样云吞就不会被煮散了蘸点水才能黏住云吞皮捏一下就好了超级简单又好看包好的云吞## 煮好的样子我今晚吃了一碗，剩下的就放保鲜袋里平铺，然后放冷冻了，下次要吃的时候直接拿出来煮就可以。呜呜呜好好吃完全不会被煮散鱼肉很好吃"
  },
  {
    "slug": "chaoshan-tese-qingtangmian",
    "title": "省钱菜谱：0.3元的潮汕特色清汤面（5min）",
    "desc": "今天起床的时候看到8点54分，心里一惊！内心第一反应是完了，长这么大第一次要旷工，然后瞬间想起周六啊！！！被自己笑死！9点左右这个点起床还是凉嗖嗖的，在阳台听到楼下通知测核酸，洗漱完煮个面暖和暖和，等会排队也不太冷！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220116000116.jpg?x-oss-process=image/interlace,1",
    "content": "今天起床的时候看到8点54分，心里一惊！内心第一反应是完了，长这么大第一次要旷工，然后瞬间想起周六啊！！！被自己笑死！9点左右这个点起床还是凉嗖嗖的，在阳台听到楼下通知测核酸，洗漱完煮个面暖和暖和，等会排队也不太冷！成品图：清汤面## 主要食材之所以是潮汕特色的清汤面，因为从面到调味料都是我家乡特色哈哈哈1、扁面条，为什么选扁的呢？因为在潮汕，“面薄”是最有家乡味道的面条了，虽然家里这个面不是家乡的面薄，但也比较接近了，比较能找到家乡的感觉！2、一根葱3、鱼露（鱼露是潮汕特色调味品，比生抽更鲜美）4、蒜头油（也是潮汕标志性的调味品哈哈哈）5、芝麻香油6、胡椒粉## 准备过程先用电热壶煮一壶热水备用。1、葱洗净，切葱花2、碗底加鱼露、胡椒粉，把葱花也加进去3、水开了，先把汤底兑好这个时候水不用很多，等面条加到碗里你再看实际上需要多少汤，再补充热水进来拌匀。准备好的碗底兑好的汤底## 煮面过程因为冬天用电磁炉煮水比较慢，所以刚才电热壶煮热水也是为了拿来直接煮面用。煮面过程就简简单单了，煮好了用笊篱捞干出来，把面放碗里。捞出来## 准备上桌1、面条放碗里后，补充汤的水到合适的水位线2、拌匀3、淋上一圈香油4、加上一小勺蒜头油搞定了！热乎乎好暖和好好吃全吃完啦吃完面喝完汤超暖和！哈哈哈哈我下楼去排队了！"
  },
  {
    "slug": "shacha-chaorou",
    "title": "省钱菜谱：4块钱的沙茶炒肉（3min）",
    "desc": "这几天深圳又出了几例，还好南山这边还是很稳，不过也是测了好几轮核酸，希望疫情快点过去！！！今晚还是做个潮汕风味的快手菜，沙茶酱是主角哈哈哈！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220113225102.jpg?x-oss-process=image/interlace,1",
    "content": "这几天深圳又出了几例，还好南山这边还是很稳，不过也是测了好几轮核酸，希望疫情快点过去！！！我今年就不回家啦！我都还没开口，我妈一个微信语音就过来叫我过年要不还是在深圳呆着吧，所以我也省得抢票了哈哈哈，刚好躲开回家被亲戚们集火…今晚还是做个潮汕风味的快手菜，沙茶酱是主角哈哈哈！成品图：沙茶炒肉## 主要食材1、猪肉，切了大约 4 块钱。2、沙茶酱3、老抽酱油## 备料过程1、猪肉切片2、沙茶酱 1 勺，加 1 勺热水搅拌成酱料，再倒入半勺老抽上色，搅拌均匀准备好的食材## 烹饪过程1、一点油润锅，油温上来了先把肉片倒进去炒到变色油不用很多肉炒到变色2、沙茶酱料倒进去炒匀一起炒匀3、翻炒过程中会慢慢被收汁，几十秒后就可以出锅了出锅装盘"
  },
  {
    "slug": "suanmeijiang-kao-bashayuliu",
    "title": "省钱菜谱：8.7元的酸梅酱烤巴沙鱼柳（18min）",
    "desc": "今天只上了半天班就被赶回来了，因为深圳出了 2 例，被要求大家都在家办公，并且周一上班要提供 3 天内至少 2 次核酸证明才能回公司，虽然南山离那边好远好远，但还是能理解，这个时候真的不要太轻视疫情了！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220107235442.jpg?x-oss-process=image/interlace,1",
    "content": "今天只上了半天班就被赶回来了，因为深圳出了 2 例，被要求大家都在家办公，并且周一上班要提供 3 天内至少 2 次核酸证明才能回公司，虽然南山离那边好远好远，但还是能理解，这个时候真的不要太轻视疫情了！然后我中午就去测了核酸才回家了，刚才结果出来了，阴性（必须的啊），明天下午再去测一次，看朋友圈都是好长的队伍，还好我这边今天中午是没什么人，半小时就搞定了！哎，深圳加油！今晚烤了个鱼柳吃，简单方便又好吃！成品图：酸梅酱烤巴沙鱼柳## 主要食材1、巴沙鱼柳，1条，美团买菜今天打折买的，8.7元2、葱1颗3、姜1小块## 调味料1、生抽0.5勺,千万不要太多，鱼很容易入味2、料酒0.3勺，因为葱姜不少，所以料酒一点点就可以3、花椒粉4、黑椒粉## 备料过程1、鱼柳买来是冷冻的，解冻，然后洗干净，根据你的锅的大小切合适的小块，不要太小，不然收缩会很严重整条鱼柳2、葱和姜都切丝姜葱切丝3、把鱼柳和葱丝、姜丝，还有生抽料酒都到在一起4、花椒粉和黑椒粉撒上薄薄一层就够抓匀，放在三只猫看不到的地方，腌制10分钟。放在三只猫看不到的地方## 烤鱼过程1、锡纸一小张，半包，所以面积足够铺底就可以2、葱丝姜丝先抓进去铺在底部3、鱼柳放上去摆好，有多余的料汁也淋上去放进去烤之前4、空气炸锅200度恒温，烤18分钟烤好之后的样子因为巴沙鱼很软，取出来的时候，可以用饭勺之类的面积大又不锐利的厨具去辅助拿出来，哈哈哈哈然后再拼回去就又是一整条鱼柳了。用饭勺辅助拼回去哈哈哈哈最后，淋上酸梅酱，好吃！！！淋上酸梅酱的成品至于酸梅酱怎么来的……上次点烧鸭外卖的时候，给多了，我就留下来做菜了2333"
  },
  {
    "slug": "lajiang-zhanjiang",
    "title": "超下饭的辣酱蘸酱！几块排骨吃了我两碗饭！",
    "desc": "今晚本来想包饺子，不过程序写的挺入神的不想起身做饭，所以炖了个花生莲藕排骨汤（炖汤不用人看着，方便！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220108005306.jpg?x-oss-process=image/interlace,1",
    "content": "今晚本来想包饺子，不过程序写的挺入神的不想起身做饭，所以炖了个花生莲藕排骨汤（炖汤不用人看着，方便！还弄了个蘸酱用来蘸排骨，特别好吃，超下饭！哈哈哈哈哈分享一下这个蘸酱的做法。成品图：辣酱蘸酱## 准备配料1、蒜头三瓣，拍碎去皮，剁蒜蓉2、豆瓣酱一勺3、白芝麻半勺4、一点点盐5、一点点糖6、撒上一层花椒粉7、撒上一层辣椒粉8、一勺生抽酱油配料都放碗里## 调制过程1、炒锅热油，加热到有点冒泡，油温上来了就可以关火这么多油就够了，其实可以更少2、倒进碗里把调料烫熟，拌匀，搞定倒进碗里搅拌均匀配排骨汤好吃蘸排骨好吃"
  },
  {
    "slug": "nenjian-jixiongroupian",
    "title": "省钱菜谱：3.5元的内柔外刚煎鸡胸肉片（5min）",
    "desc": "今晚试了一个鸡胸肉的新做法，平时煎鸡胸肉比较让人纠结的就是口感比较柴，今晚这个做法虽然很小众（不敢说完全没有人这样搞哈哈哈），口感很不一样！外层是焦香的煎鸡肉，内层却超嫩有汁，就是这么神奇！",
    "cover": "https://cdn.chengpeiquan.com/img/2021/12/20211230010054.jpg?x-oss-process=image/interlace,1",
    "content": "昨天各种听歌报告出来了，我的年度乐队依然是BEYOND，哈哈哈哈哈已经不知道持续了多少年了，虽然白天经常标版自己是核狗，上班双踩抖腿敲代码，但夜深人静的时候，还是喜欢听BEYOND的励志歌和关怀世界的大爱歌曲（铁汉柔情？哈哈哈这个词有点贴合今晚的菜）今晚试了一个鸡胸肉的新做法，平时煎鸡胸肉比较让人纠结的就是口感比较柴，今晚这个做法虽然很小众（不敢说完全没有人这样搞哈哈哈），口感很不一样！外层是焦香的煎鸡肉，内层却超嫩有汁，就是这么神奇！成品图：内柔外刚煎鸡胸肉片## 主要食材1、鸡胸肉一整块，上次采购的这块冷冻鸡大胸大约7块钱，分量很足，我今晚吃了一半，留了一半明天带饭，所以今晚这顿饭就3.5元了2、方便面调料包1包，哈哈哈哈哈家里买了一箱蟹皇面，所以这个调料有很多…3、料酒另外准备多一把厨房剪刀，用来剪熟食用的，没有的话那就要拿砧板和刀，等会还要多洗一套厨具了。方便面调味包和厨房剪刀## 准备过程1、鸡胸肉泡水解冻，化冻后用牙签戳小孔，确保完全解冻2、洗净后，表面划几刀，这个主要是用来标记到时候要剪的位置3、料酒0.3勺，加上调料包，抹匀，提前腌制一晚上腌制好的鸡胸肉## 烹饪过程1、给腌制好的鸡胸肉撒上一层炸鸡粉，薄薄一层就可以，用来锁住鸡胸肉里面的水份，也是避免腌制鸡胸肉的时候有些料汁，等下下锅会溅油裹粉后的鸡胸肉2、炒锅加入一点油热锅，别看很厚的鸡胸，我们只是煎的，所以油量不需要特别多油量不需要特别多3、油温上来了，放入鸡胸肉，先把表面煎到焦焦的感觉，翻面多煎一会4、暂时关火，拿出我们的厨房剪刀，沿着我们划好的位置，剪开鸡胸肉，这样就得到了若干片外圈焦黄、中心不熟的鸡胸肉片哈哈哈哈哈哈哈5、重新开火，煎到鸡胸肉变白就是熟了，就可以盛出来了，第二次开火之后耗时很短，很容易熟最后撒上一层辣椒粉、孜然粉，超好吃！！！撒了辣椒粉的鸡胸肉片咬开，里面超级嫩！外焦里嫩嫩嫩的切面不仅简单，而且适合上班带饭！"
  },
  {
    "slug": "roupi-chao-jielan",
    "title": "省钱菜单：2.9元的肉皮炒芥兰（3min）",
    "desc": "明天的午餐带饭有昨晚留下的半截肉卷，今晚想着就不买肉了，冰箱里的小半把芥兰，搭配一下家里也有的肉皮一起炒个菜。",
    "cover": "https://cdn.chengpeiquan.com/img/2021/12/20211225001910.jpg?x-oss-process=image/interlace,1",
    "content": "明天的午餐带饭有昨晚留下的半截肉卷，今晚想着就不买肉了，冰箱里的小半把芥兰，搭配一下家里也有的肉皮一起炒个菜。哈哈哈因为是昨晚想到的做法，所以提前做了准备，昨晚是提前用热水泡软了肉皮先挤掉油脂，然后又重新泡了一次热水，一直泡到今晚，所以虽然没有焖的环节，但肉皮依然够软！成品图：肉皮炒芥兰## 主要食材1、肉皮（油炸的猪皮制作的食材），大约 1.5 元2、芥兰小半把，大约 1.4 元## 调味料调味方面我用了鱼露，液体的调味料，一勺鱼露搭配两勺开水先兑匀备用。准备好的食材## 烹饪过程肉皮是油炸好的猪皮，本身也是熟的干货，所以可以先炒芥兰，快熟了就把肉皮倒进去一起炒一会，淋上鱼露汁，翻炒均匀就可以出炉了！简单的过程出炉照偶尔换一下食材搭配感觉也会很不一样哈哈哈！"
  },
  {
    "slug": "xiancai-chao-roujuan",
    "title": "省钱菜单：4.7元的咸菜炒肉卷（3min）",
    "desc": "哈哈哈哈上次的韭菜花炒肉卷下面评论好几个小姐姐都推荐了咸菜炒肉卷！我也来啦！！！好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220108010442.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈上次的韭菜花炒肉卷下面评论好几个小姐姐都推荐了咸菜炒肉卷！我也来啦！！！好吃！！！成品图：咸菜炒肉卷## 主要食材半个潮汕咸菜1.7，还有一截肉卷还是差不多3块钱，都是半成品的食材，所以超级快就能吃上饭！！！切好食材## 烹饪过程全过程不用额外调味哦！肉卷本身有味道，煎一下就好，咸菜也是哈哈哈煎肉卷咸菜倒进去一起炒超快就可以出锅了，好吃！搞定！好吃！肉卷超爱"
  },
  {
    "slug": "xianggu-zhurou-yumi-jianjiao",
    "title": "省钱菜单：香脆又香甜！香菇猪肉玉米煎饺太好吃了！",
    "desc": "耶耶耶！昨晚的香菇玉米猪肉饺子煎出来太好吃了！！！虽然玉米饺子贵一点，不过这一大碗也就11块钱，自己包饺子划算太多了！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220108014330.jpg?x-oss-process=image/interlace,1",
    "content": "耶耶耶！昨晚的香菇玉米猪肉饺子煎出来太好吃了！！！虽然玉米饺子贵一点，不过这一大碗也就11块钱，自己包饺子划算太多了！成品图：香菇猪肉玉米煎饺## 相关菜谱这是昨天的蒸饺做好后，留一保鲜盒今天煎着吃，做法可以参考文末的相关菜谱。## 煎饺过程煎饺嗷嗷嗷好好吃煎好了"
  },
  {
    "slug": "xianggu-zhurou-yumi-zhengjiao",
    "title": "省钱菜谱：0.57元/只香菇猪肉玉米饺子（30min）",
    "desc": "今天是包香菇玉米猪肉饺子，做法也比较有我的个人特色，首先是纯玉米馅，没有混入胡萝卜等别的蔬菜，另外一个是我没有加五香粉之类的香料，只用了潮汕特色的调味品来调馅（鱼露搭配虾皮），简单的调味但是很鲜美，能够保持甜玉米的鲜甜口感！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220108020352.jpg?x-oss-process=image/interlace,1",
    "content": "周末日常包饺子哈哈哈哈，这样可以留一份给明天做煎饺！今天是包香菇玉米猪肉饺子，做法也比较有我的个人特色，首先是纯玉米馅，没有混入胡萝卜等别的蔬菜，另外一个是我没有加五香粉之类的香料，只用了潮汕特色的调味品来调馅（鱼露搭配虾皮），简单的调味但是很鲜美，能够保持甜玉米的鲜甜口感！## 主要食材1、甜玉米，我选的稍微大个一点的用了 3 个， 11.5 元，用小刀把玉米粒剥下来，剥出来的纯玉米粒有整整一斤，如果是买的包装的玉米粒可以参考这个分量2、猪上肉，今天这块肉是 10.5 块钱3、干香菇六朵，算 1.5 元4、虾皮一小把5、盐6、鱼露7、饺子皮一斤， 4 元然后先煮一电热壶的开水备用，香菇先用热水泡开。刚好一斤的玉米粒## 备料过程1、玉米剥粒后洗净，洗的时候可以用笊篱辅助捞出来到盘子里，这样就不怕不好倒掉洗菜水弄好的玉米粒2、开水倒到汤锅里，玉米粒也加进去煮 5 分钟焯水，可以煮掉杂质，也可以避免等下玉米馅不够熟给玉米粒焯水3、煮玉米的时候，就可以去准备猪肉和香菇了，香菇切成和玉米粒差不多大小的香菇丁4、猪肉也先切薄片备用，因为我切肉和剁肉是两把不同的刀，所以这把切肉的刀在这里用完可以洗净收起来了5、准备一个小碗，加入炒菜分量的盐，还有半勺鱼露，加上一勺子热水进去把盐化开，兑成调味汁备用准备好的各种食材## 准备馅料1、玉米煮好了，用勺子把表面的泡沫刮走，用笊篱把玉米粒捞出来，换上炒锅焯好的玉米粒真漂亮2、一点点油热锅，香菇丁先下去爆香，然后倒入玉米粒一起翻炒几下香菇丁先爆香3、倒入调味汁，翻炒均匀，关火，把玉米粒摊开，在炒锅里自然冷却在炒锅里自然冷却4、冷却的时候就可以剁肉馅，加入鱼露给肉馅调味弄好的玉米粒、香菇丁、剁好的肉馅5、剁好肉馅的时候玉米粒也冷却的差不多了，放入一把虾皮，把肉末也倒进去拌匀，饺子馅就好了准备好的馅料用调味汁给玉米粒调味可以保证馅料的味道足够均匀（如果直接加盐很可能有的地方很咸有的地方很淡…），加入鱼露还可以让馅料在保持玉米鲜甜的同时又有一种特别的鲜味。## 包饺子包饺子的步骤以前有好几个饺子菜谱都有说就不重复啦！饺子皮蘸一圈水帮助黏合一捏就好了包好的饺子包好之后蒸 10 分钟就可以吃了！蒸好的饺子蒸好的饺子今天是包了 48 个，算下来一个饺子 0.57 元，玉米比较贵主要是，但是甜玉米真的好好吃！好甜！而且焯水 + 翻炒过的玉米粒很嫩很软，一点都不会生硬。好好吃！！！哈哈哈留着下一餐做煎饺，也超级好吃！！！"
  },
  {
    "slug": "jiucaihua-chao-roujuan",
    "title": "省钱菜谱：3.7元的韭菜花炒肉卷（3min）",
    "desc": "今晚难得在菜市场看到有肉卷卖，对于下班回家买菜这个时间点，遇到肉卷真不容易啊。肉卷是潮汕一种美食，是猪肉的一种加工品，很好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220114234142.jpg?x-oss-process=image/interlace,1",
    "content": "今晚难得在菜市场看到有肉卷卖，对于下班回家买菜这个时间点，遇到肉卷真不容易啊。成品图：韭菜花炒肉卷肉卷是潮汕一种美食，是猪肉的一种加工品，很好吃！在我老家一般会有 2 种：一种是有包腐竹皮的（就是我今晚买的这种），常用来炒菜，或者直接煎。一种是没有包的，没有包腐竹皮的版本常见于猪杂粿条汤哈哈哈哈，咦，其实你们应该也吃过哈哈哈哈！包了腐竹皮的肉卷## 主要食材1、肉卷， 9 块钱的肉卷可以分3次吃，这里 3 块钱哈哈哈2、韭菜花，一把 2.3 元也是可以分3次，这里是 0.7 元## 准备过程1、肉卷本身也是熟食，适当切小块就可以了2、韭菜花洗净，切寸，跟肉卷差不多长度那样子准备好的食材## 炒菜过程1、热油，肉卷先倒进去煎一会2、等肉卷的切面开始变金黄，就可以盛出来备用先煎肉卷3、下韭菜花炒熟，加盐调味（肉卷不需要调味，所以只给韭菜花加盐就行）4、然后把煎好的肉卷倒进去炒匀就可以了炒匀好吃！又快！下班回来如果买得到肉卷的话真的很适合做晚餐！呜呜呜好好吃！"
  },
  {
    "slug": "kongqizhaguo-jiucai-jianjiao",
    "title": "空气韭菜煎饺！空气炸锅的发明者真是现代爱迪生！",
    "desc": "昨天下午做了卤水，但是为了更入味所以昨晚没有立即吃，继续先卤着，然后昨晚又另外包了韭菜饺子，留了一盒今天晚上回来做煎饺。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220131234851.jpg?x-oss-process=image/interlace,1",
    "content": "昨天下午做了卤水，但是为了更入味所以昨晚没有立即吃，继续先卤着，然后昨晚又另外包了韭菜饺子，留了一盒今天晚上回来做煎饺。不过准备煎之前想起好像还没用空气炸锅弄过饺子，试了一下真不错！！！## 成品图成品图：空气韭菜煎饺## 制作过程我是昨晚先蒸好了饺子的，吃剩下的就保鲜盒冷藏，刚刚冷藏拿出来，加热4分钟就好，外层焦脆，里面还是跟原来一样，也不会很干！拿出前一晚冷藏的饺子码好在空气炸锅底部## 出炉效果口感方面和油煎的对比，一样好吃，皮会稍微硬一些，感觉下次可以先洒洒水再放进去烤，关键是无油！！！真的漂亮一点也不逊色油煎出来的哈哈哈哈哈好吃又一炉很快就烤好"
  },
  {
    "slug": "shuizhudan",
    "title": "卤蛋前置教程：剥一个光滑漂亮的水煮蛋",
    "desc": "上次发了个潮汕卤水的做法，里面有包含了卤蛋，然后就有小姐姐问我怎么煮蛋，说煮出来的蛋不好剥，坑坑洼洼的，没法跟我的蛋一样光滑，所以这个笔记来说一下我是怎么煮蛋的。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220201002259.jpg?x-oss-process=image/interlace,1",
    "content": "上次发了个潮汕卤水的做法，里面有包含了卤蛋，然后就有小姐姐问我怎么煮蛋，说煮出来的蛋不好剥，坑坑洼洼的，没法跟我的蛋一样光滑，所以这个笔记来说一下我是怎么煮蛋的。不论是刚买的新鲜鸡蛋还是在冰箱放了一周两周的蛋，用这个方法都还挺好剥的！## 成品图超级好看光滑的水煮蛋## 所需工具工具方面是一个电热壶，鸡蛋先洗干净，电热壶里先装些水，然后鸡蛋沿着电热壶的墙壁滑下去，这样就不用担心会一下子碰到壶底会撞碎。普通的电热壶就可以## 煮蛋过程电热壶的水加到淹没鸡蛋，按下开关煮到水沸腾，焖3分钟，再按下开关煮到沸腾（这次会比较快跳掉），再焖3分钟。## 冷却过程准备一个大碗，加一勺子盐（调味盒的小勺子），碗里加一碗冷水，把煮好的鸡蛋放进去冷却，2分钟后就可以剥了。## 剥鸡蛋壳这样煮出来的水煮蛋是全熟的状态，喜欢溏心蛋可以不煮第二次，蛋壳也非常好剥，一撕开就一整片下来，蛋也很光滑哈哈哈！一个个都很光滑很容易就撕开一大片蛋壳哈哈哈哈好完整的一张都是很好剥壳剥下来的蛋壳都没有特别碎的## 相关教程完整的卤水教程可以看文末的相关菜谱。## 卤蛋过程卤蛋跟卤肉一起卤就好，不过不用很久，因为卤蛋主要靠浸泡入味。准备放进去了卤蛋卤好的鸡蛋可以先拿出来，最后等肉卤好了再一起浸着更入味！卤好的鸡蛋"
  },
  {
    "slug": "tudou-kao-cuipi-jituipa",
    "title": "省钱菜谱：4.4元的土豆烤脆皮鸡腿扒（20min）",
    "desc": "告诉大家一个好消息，我终于快忙完了！赶开发了一个多月，项目终于要上线，这周末我要休个年假回家几天，然后接下来又可以跟大家一起天天做饭了！（希望不要又来一波赶项目……",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220115001907.jpg?x-oss-process=image/interlace,1",
    "content": "告诉大家一个好消息，我终于快忙完了！赶开发了一个多月，项目终于要上线，这周末我要休个年假回家几天，然后接下来又可以跟大家一起天天做饭了！（希望不要又来一波赶项目……今晚安利 @郁乐队 的《仙女座》，最近赶项目经常循环的一首旋死金属乐，双踩好快哈哈哈哈哈哈工作效率也好高，最重要的是可以完完全全的挡住周围机械键盘的噪音，可以安安静静专心敲代码！谁喊你都听不见的那种！哈哈哈哈哈说回今晚的烤鸡了！！！成品图：土豆烤脆皮鸡腿扒## 主要食材1、鸡腿扒1块，这块按采购分量的比例大约 3.4 元2、土豆，楼下打折买了一小袋，虽然小小粒，但很好吃，10粒才2.5元，用了4粒，这里是1元3、方便面调料包（我用的蟹皇面的调料包，潮汕人都懂哈哈哈，也可以自己抹盐抹胡椒粉花椒粉）4、老抽酱油0.3勺，主要是用来上色5、芝麻香油0.3勺，增香6、料酒大约0.2勺，肉不多，加多了酒味太重## 备料过程1、腿扒是买的冻品，泡水解冻，再扎点小孔泡掉血水，鲜鸡腿也是可以这样泡走血水和杂质，可以不用单独为了一只鸡腿去飞水2、土豆洗净去皮，切丁，再次洗一下泡掉自带的那些淀粉粘液3、把调料包、还有老抽、香油、料酒都一起加进去抓匀，腌制个半小时左右（我腌制进去之后就写东西了，差不多半小时后才去烤）准备好的各种食材## 烤鸡过程空气炸锅200度恒温，鸡腿放中间，土豆围一圈，不用包锡纸，直接烤20分钟。出炉的样子## 最终成品啧啧啧，超级赞！真·脆皮烤鸡！！！土豆带了鸡汁还有调料汁的味道，比我前天发的黑椒烤土豆粒更好吃！好香啊！这个脆皮，爱了爱了！外脆里嫩太无敌了！哈哈哈哈今晚烤了两份，一份晚餐，一份明天带饭！哈哈哈诱惑我家弟弟"
  },
  {
    "slug": "yangsheng-babaozhou",
    "title": "省钱菜单：天冷舒服！0.8元/碗的养生八宝粥（2h）",
    "desc": "因为打算下午爬山的时候挑战一下另外一条比较陡峭的小路，担心回来没精力做饭，刚好家里有糯米，早上出去超市顺便买了点配好的杂粮（有黑米、紫薯干、红扁豆挺多料），再搭配点花生，一起浸泡了有两个小时。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220114235441.jpg?x-oss-process=image/interlace,1",
    "content": "今天好冷啊，今晚煮了个养生八宝粥，好暖和！成品图：养生八宝粥## 备料过程因为打算下午爬山的时候挑战一下另外一条比较陡峭的小路，担心回来没精力做饭，刚好家里有糯米，早上出去超市顺便买了点配好的杂粮（有黑米、紫薯干、红扁豆挺多料），再搭配点花生，一起浸泡了有两个小时。准备好的这些料## 煮粥过程出门前先定时煲粥（因为有糯米和豆子啥的，我的隔水炖煲粥开了 2 小时，平时白粥 1 小时不到就可以了），回来就有暖暖的八宝粥喝，呜呜呜真舒服！！！## 成品图今晚这点材料大概 2.5 元，盛了有三碗粥，调味的话我是加了冰糖在碗里再盛粥，这样调味比较好控制！好浓稠好暖和好好喝"
  },
  {
    "slug": "heijiao-kao-tudouli",
    "title": "省钱菜谱：0.86元的黑椒烤土豆粒（15min）",
    "desc": "啊哈哈哈周末在猫超捡的漏，加上省钱卡啥的最后这斤土豆是 1.73 元，有 4 个，这一盘用了两个所以 0.86 元。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220201221842.jpg?x-oss-process=image/interlace,1",
    "content": "啊哈哈哈周末在猫超捡的漏，加上省钱卡啥的最后这斤土豆是 1.73 元，有 4 个，这一盘用了两个所以 0.86 元。## 成品图成品图：黑椒烤土豆粒买入的价格## 制作过程做法就是削皮洗净，切粒，抹上黑椒粉。撒上黑椒粉抹匀空气炸锅 200 度恒温烤 15 分钟。放入空气炸锅出炉的样子口感挺特别的，外层是烤焦焦的口感，里面是土豆的粉糯口感，好吃！还可以留一部分带饭加菜。好吃！！！"
  },
  {
    "slug": "chaoshan-lushui-wuhuarou",
    "title": "潮汕卤水之卤五花肉",
    "desc": "上周五有小姐姐问我说最近很忙，有什么菜可以提前几天准备，这样每天带饭就可以只煮饭，都是潮汕人，那必须首选潮汕卤水哈哈哈，周末提前做，真的可以吃好几天，而且卤汁还可以再用，可以再做几次卤蛋之类的小卤味，美滋滋！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220130235640.jpg?x-oss-process=image/interlace,1",
    "content": "上周五有小姐姐问我说最近很忙，有什么菜可以提前几天准备，这样每天带饭就可以只煮饭，都是潮汕人，那必须首选潮汕卤水哈哈哈，周末提前做，真的可以吃好几天，而且卤汁还可以再用，可以再做几次卤蛋之类的小卤味，美滋滋！然后今天准备的是无高压锅版本的做法，高压锅平时没怎么用到，一个人住所以小家电只买了常用的，因此今天的工具是“普通汤锅（飞水） + 隔水炖锅（炖肉） + 普通炒锅（卤制）”。成品图：卤五花肉## 主要食材1、五花肉：卤肉从口感方面来说，五花肉最佳，其次是上肉，比较少选纯瘦肉2、鸡蛋3、炸豆腐干：豆制品档口一般有现成的炸豆腐干卖卤水的食材比较多花样，不过不同食材的下料时机有不同，像今天用到的炸豆腐干，因为吸汁能力超强，特别容易入味，太早下会很咸并且煮烂，所以只需要在出锅前才放下去卤一下就好。## 香料配料1、香葱（我习惯用香葱，也可以用大葱）2、老姜（其实应该买南姜，不过楼下菜市场买不到）3、蒜头5\\~6瓣4、草果1粒5、花椒粒一小把6、干辣椒5\\~6根7、香叶2片8、八角2粒9、桂皮1块卤水香料## 调味料1、鱼露1锅铲（潮汕地区经典的调味品，可以让食材更鲜美）2、老抽2锅铲（上色之王）3、生抽酱油3锅铲4、冰糖一小把（我用的小冰糖，抓了有12粒）## 炖肉过程1、五花肉，加2片姜，用汤锅大火煮沸先飞水去浮沫，捞干净出来2、炖锅的炖盅先铺满所有配料，五花肉码进去，加水淹没，没有高压锅就用这个方法，炖1.5个小时，肉也可以变得很嫩。炖好的肉然后先把鸡蛋煮了，剥壳备用，我用的电热壶煮蛋超方便！## 卤制过程炖好了就转移到炒锅，这里有2个阶段：1、先给食材打卤，把调味料都加进去，然后电磁炉800度先煮15分钟，这个过程卤汁会沸腾的比较厉害，期间用锅铲不定期翻一下食材避免糊锅加老抽的时候，一锅铲的分量冰糖用量2、然后开始进行浸卤，把火调低到300度，让肉半煮半浸，盖上盖子，慢慢卤20分钟，期间偶尔去翻动一下食材，让食材全方位能被卤到慢慢浸卤炸豆腐干等出锅之前再下，稍微泡一会就好了。全部卤好了卤好的肉可以立即吃一部分。卤好的卤蛋卤好的卤肉剩下的可以直接在锅里继续泡着冷却，然后捞走香料，连肉带卤汁一起装大碗里，铺好保鲜膜冷藏，下次拿出来加热就可以，越卤越香！剩下的装大碗里倒入卤汁浸着冷藏最开始的封面图就是卤了一天的效果，超入味！！！当然，卤水是可以上班带饭吃哈哈哈哈！普通潮汕人带饭"
  },
  {
    "slug": "chaoshan-guozhi",
    "title": "省钱菜单：丰俭由人的潮汕粿汁（5min）",
    "desc": "做完卤肉实在没忍住哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈，切了一块卤肉，吃个宵夜！！！这个点最好的搭配就是潮汕粿汁了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220201225040.jpg?x-oss-process=image/interlace,1",
    "content": "做完卤肉实在没忍住哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈，切了一块卤肉，吃个宵夜！！！这个点最好的搭配就是潮汕粿汁了！！！粿汁是潮汕这边的一种小吃，自己买粿汁皮的话，通常都是晒干的，煮的时候，潮州这边通常习惯加点糯米粉或者淀粉，让汤显得浓稠，其他地区似乎好像喜欢清汤？哈哈哈哈不过都好吃呀！成品图：粿汁## 制作过程煮粿汁就是水煮开了放下去煮，大约5、6分钟就搞定啦！今晚只算粿汁的话，1.8元！算上卤水就要8.6元了晒干的粿汁皮提前做好的葱珠朥快好了加一勺粉## 常见搭配搭配的话，一般是“粿汁 + 葱珠朥 + 盐”这样的组合（粿条面条常用鱼露，粿汁一般用盐）。普通吃法平民的豪华版就像我这样再搭配一些卤豆干、卤蛋、卤五花肉，还有卤大肠卤鹅肠卤肉都有，哈哈哈其实就是搭配潮汕卤水，葱珠朥就是葱花低温炸干出来的一种调味品（我之前在粿条卷那个菜谱里有做法） 。搭配卤豆干搭配卤蛋搭配卤五花肉"
  },
  {
    "slug": "ziran-roupian-ban-qingguasi",
    "title": "省钱菜谱：3.8元的孜然肉片拌青瓜丝（3min）",
    "desc": "买了根青瓜好几天没想好怎么吃（原本打算炒面的，但这几天回家都比较晚，不想动…），昨晚试了一下这个做法，还不错，算半个凉菜吧！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202152015.jpg?x-oss-process=image/interlace,1",
    "content": "买了根青瓜好几天没想好怎么吃（原本打算炒面的，但这几天回家都比较晚，不想动…），昨晚试了一下这个做法，还不错，算半个凉菜吧！成品图：孜然肉片拌青瓜丝## 主要食材1、青瓜1根，1.8元2、瘦肉，2元3、盐4、辣椒粉5、孜然粉## 备料过程1、青瓜洗净去皮，刮丝备用2、瘦肉切片准备好的食材## 烹饪过程1、瘦肉先炒熟，加一点盐调味，撒上自己能接受的孜然粉、辣椒粉的量2、关火，青瓜丝倒进去炒匀即可（或者把肉盛出来拌匀）炒好啦"
  },
  {
    "slug": "suchengban-lurou-lurougan",
    "title": "省钱菜谱：4.5元的速成版卤肉卤豆干（5min）",
    "desc": "原本以为买的粿汁皮要好几天才送到，结果…嗯？隔天（此处是Max问号表情包）……然后就等不到周末了哈哈哈哈哈哈，刚好今晚加班回来又比较晚，不想吃饭了，买了点炸豆干，切了点小上肉，用个便捷的方法搞点卤肉搭配一下。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202153101.jpg?x-oss-process=image/interlace,1",
    "content": "原本以为买的粿汁皮要好几天才送到，结果…嗯？隔天（此处是Max问号表情包）……然后就等不到周末了哈哈哈哈哈哈，刚好今晚加班回来又比较晚，不想吃饭了，买了点炸豆干，切了点小上肉，用个便捷的方法搞点卤肉搭配一下。成品图：速成版卤肉卤豆干## 主要食材1、炸豆干（豆制品档口有现成的…），2元就有一袋了，今晚3块豆干也就5毛钱不能再多…2、纯瘦肉有点太干，所以今晚买了点带皮带白的上肉，切稍微薄一些，切了大概4块钱## 调制料汁1、老抽酱油1.5勺2、生抽酱油1勺3、白砂糖1勺（其实有冰糖更好4、半碗热水一起拌匀，把糖化开准备好的材料## 烹制过程1、平时炒菜的温度，电磁炉800度，一点油热锅，先把肉片炒熟先炒肉2、倒入料汁把肉先翻炒一下上色均匀，放入炸豆干一起煮再倒入料汁3、期间用锅铲把炸豆干压一压，因为会吸水，可以让炸豆干把料汁吸收均匀炸豆干也放进去4、等炸豆干差不多入味了（颜色OK，又饱含汁液的状态），筷子先夹出来先捞出来5、然后锅里的料汁其实也差不多吸干了，可以开个大火，大火收汁，这样肉也可以得到一个颜色亮泽的状态虽然过程很简单，但这样做出来其实很入味，首先大部分料汁都被炸豆干吸收了，豆干是很入味的，肉片期间虽然一直煮着，但是如果纯煮其实口感一般般，所以最后要来个大火收汁，锅里的料汁会迅速变得浓稠，把肉裹的紧紧的，感觉会瞬间不一样！卤豆干和卤肉搭配粿汁真的好吃啊哈哈哈哈哈哈！等我周末有空再正儿八经的做锅卤肉，啊啊啊还有卤蛋！！！搭配粿汁好吃粿汁卤肉卤豆干"
  },
  {
    "slug": "chaozhou-zhafanshu",
    "title": "省钱菜谱：2个银的潮州浮分割（嗯！炸番薯）",
    "desc": "今天在家有点馋，搞个潮汕小吃“浮分割”做个下午茶，搭配功夫茶真不错！其实就是“炸番薯”哈哈哈哈，在我家那边都叫它“浮分割”，潮州市区把番薯叫“分割”（读音上，当年数学课教到黄金分割的时候全班都笑炸了哈哈哈哈哈哈哈哈哈哈哈哈哈），当然别的地方不一定这么叫哈哈哈哈，标题的2个银就是两块钱",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202154605.jpg?x-oss-process=image/interlace,1",
    "content": "今天在家有点馋，搞个潮汕小吃“浮分割”做个下午茶，搭配功夫茶真不错！其实就是“炸番薯”哈哈哈哈，在我家那边都叫它“浮分割”，潮州市区把番薯叫“分割”（读音上，当年数学课教到黄金分割的时候全班都笑炸了哈哈哈哈哈哈哈哈哈哈哈哈哈），当然别的地方不一定这么叫哈哈哈哈，标题的2个银就是两块钱😂😂😂成品图：潮州炸番薯## 主要食材番薯准备1\\~2个，上次买了一袋，今天的用量大约2块钱吧，洗净去皮，切成大约1厘米厚的番薯片，如果太大块可以再适当切小。你如果有买芋头的话，也可以切几片芋头一起炸，我们那的小摊都是同时卖的。切好的番薯片## 制作面糊1、淀粉1勺（调味盒的那种小勺）2、白砂糖，只需要一点3、盐，只需要一点4、五香粉，只需要一点5、我还加了一点炸鸡用的酥炸粉（无味的），可以让番薯可以炸的更酥脆，用量大概是面粉的三分之一6、面粉，用量就看你番薯的量来决定了一起加水拌成面糊，稀释度大约如图，就是可以挂住筷子尖，挂上薄薄一层就算可以了（所以你的面粉用量可以根据这个状态来估算，太稀了就再加面粉，太稠了就再加水）这样的程度就可以了## 炸番薯1、我们分批炸，所以油可以不用特别多，油锅烧热（炸番薯我电磁炉开的1000度），温度上来了，油开始冒小泡了就可以准备炸番薯了2、番薯片放进面糊里挂浆，再放下去炸，全程用筷子操作就可以了，锅铲用不上番薯片挂浆3、不定期翻一下面，直到两面金黄就可以夹出来了，在吸油纸上吸掉带出来的油炸番薯炸好的先捞出来我这一盘炸了大约15分钟。继续炸## 最终成品真是小时候的味道呜呜呜，一块炸番薯配一杯茶，真是人在深圳心在家哈哈哈哈哈哈哈哈哈哈好看又好吃外酥里嫩又很甜"
  },
  {
    "slug": "fuzhu-chao-roupian",
    "title": "省钱菜谱：5块钱的炸腐竹炒肉片（5min）",
    "desc": "今晚回来在超市的豆制品档口看到摆着几盘炸腐竹，嗯哼，也是我的最爱啊！偶尔外出要在外面吃快餐的时候，选择困难症的我经常会点腐竹牛腩或者腐竹炒肉，好久没吃了呢！今晚自己做！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202181323.jpg?x-oss-process=image/interlace,1",
    "content": "刚写完日记，把今晚的晚餐也写一下吧！反正三只猫在床上陪着我，一时半会也不会睡（特别享受睡前三只猫贴着我躺，然后我搂着猫的这段亲子时间哈哈哈…今晚回来在超市的豆制品档口看到摆着几盘炸腐竹，嗯哼，也是我的最爱啊！偶尔外出要在外面吃快餐的时候，选择困难症的我经常会点腐竹牛腩或者腐竹炒肉，好久没吃了呢！今晚自己做！然后在做菜之前，我们先电热壶煮一壶热水备用，来，开工！成品图：炸腐竹炒肉片## 主要食材1、炸腐竹，超市是保鲜膜包装好的一盘9块多，今晚拆了三分之一，算3块钱吧2、瘦肉切了大约2块钱3、葱1根4、蒜头2瓣## 调制料汁1、蚝油1勺2、白酱油1勺（或者生抽）3、白胡椒粉0.3勺加3勺水兑均匀备用，另外再准备一点点水淀粉（因为我是料汁下锅之后，才用这个调料的碗兑的水淀粉，所以照片里没有）。## 备料过程1、因为买的是炸好的腐竹，所以直接一折就断，适当折短就可以，不要捏碎就行了，放到大碗里2、倒入我们准备好的开水，一方面是先泡软，等会好炒菜，另一方面我是为了泡掉炸腐竹的油脂准备泡腐竹3、炸好的腐竹泡个几十秒就很软了（打火锅点过炸腐竹的话应该颇有心得哈哈哈），笊篱捞起来控干水份，因为刚才泡出了很多油脂（照片里应该能看出来？），我们不要那些水泡好的腐竹已经泡软了4、瘦肉切片就好5、葱切段，葱管太粗的话再对半切一下6、蒜头拍碎，稍微剁一下准备好的材料## 炒菜过程1、一点油先热锅，蒜末先下去炒香，然后肉片也加进去炒熟，不用调味2、直接把腐竹倒进去翻炒一起翻炒3、下葱，料汁也倒进去，让肉片和腐竹一起半炒半煮，不定期翻一下让食材调味均匀4、腐竹会吸水，所以水会慢慢收干5、等水收的快干了，加入水淀粉，勾芡收汁炒好了## 最终成品加了胡椒粉之后，软软的炸腐竹真的是太好吃了！！！！！5块钱还是分量很足的软软的炸腐竹好好吃不过要提醒一下就是不适合带饭哈哈哈，炸腐竹可以放一段时间，但是做成菜就不适合隔夜了，如果你要带饭，要早上起来做咯！哈哈哈写完了准备睡觉了，大家晚安！"
  },
  {
    "slug": "jiaofen-roumo-jiandan",
    "title": "省钱菜谱：1.7元的椒粉肉末煎蛋（2min）",
    "desc": "今天的晚餐是平平无奇的煎蛋哈哈哈哈哈哈哈哈，双十一买了好多蛋，变着花样玩一下！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202220049.jpg?x-oss-process=image/interlace,1",
    "content": "今天公司入职了个新的HR妹子，虽然比较忙，工位也背对着我，没怎么看清，但感觉挺好看的！今晚的歌，选一首国内的旋律死亡金属吧，安利天谴乐队的《伏羲血脉》， 3 分 45 秒之后那整整1分钟的嘶吼真的太震撼了！！！不愧是山东汉子！！！来自山东青岛的旋死乐队，虽然目前只有 1 张专辑 6 首歌，但全部作品的旋律和RIFF都超赞，主唱雄厚的嗓音也超爱，啊啊啊啊真的希望能有深圳或者广州的演出，太想看他们的现场了！！！今天的晚餐是平平无奇的煎蛋哈哈哈哈哈哈哈哈，双十一买了好多蛋，变着花样玩一下！成品图：椒粉肉末煎蛋## 主要食材1、鸡蛋 2 个，双十一的优惠哈哈哈哈 3 毛 5 一个，这里 7 毛钱2、瘦肉，切了大约1块钱3、鱼露4、辣椒粉或者孜然粉啥的你喜欢的调味粉哈哈哈## 备料过程1、用筷子把蛋液打散，加入鱼露调味（咸度 + 鲜度）2、瘦肉剁成肉末准备好的食材## 煎蛋步骤1、一点油热锅，平时别的菜谱字比较多所以没怎么说过怎么测油温，你可以像我一样，伸一只手到锅的上方感受一下温度，感觉很热了就可以了试探油温2、油温上来了，锅够热才不会粘锅，快速把肉末炒熟炒肉末3、把肉末稍微平均分散一下，轻轻倒入蛋液倒入蛋液4、这样整个蛋饼的肉末就比较均匀5、一面煎凝固了，翻个面翻面6、另外一面也凝固了，就搞定了！！！搞定出炉7、盛到盘子里，撒上一层辣椒粉，美滋滋撒上辣椒粉好吃！成本超低，出餐超快哈哈哈，当然也好吃！！！"
  },
  {
    "slug": "tusi-jia-jiandan",
    "title": "省钱菜单：2.5元的吐司夹煎蛋早餐（2min）",
    "desc": "今天的早餐，虽然没有三明治那么多料，也没有加酱料，就是单纯煎了两个鸡蛋夹进去，但相比单纯的吐司感觉不一样很多！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202222137.jpg?x-oss-process=image/interlace,1",
    "content": "今天的早餐，虽然没有三明治那么多料，也没有加酱料，就是单纯煎了两个鸡蛋夹进去，但相比单纯的吐司感觉不一样很多！## 做法先拿一片吐司放盘里，然后去煎蛋，放上去。放在一片吐司上面两片夹起来，就好了夹起来## 成品比单纯吃吐司感觉很不一样了！好吃好吃好吃"
  },
  {
    "slug": "cuipi-jujitui",
    "title": "省钱菜谱：4.93元的脆皮焗鸡腿（20min）",
    "desc": "啊哈哈哈哈还记得我10月23号发的那个焗鸡腿配蚝油炒面的笔记吗？（你们八成不记得了…）那天我说我对电饭煲做的焗鸡腿不满意嘛，耗时太久，然后今晚还是出动我熟悉的空气炸锅，真的棒！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220202223006.jpg?x-oss-process=image/interlace,1",
    "content": "啊哈哈哈哈还记得我10月23号发的那个焗鸡腿配蚝油炒面的笔记吗？（你们八成不记得了…那天我说我对电饭煲做的焗鸡腿不满意嘛，耗时太久，然后今晚还是出动我熟悉的空气炸锅，真的棒！成品图：脆皮焗鸡腿## 主要食材1、琵琶腿，其实 2 只就够吃 2 碗饭啦！不过因为是双十一在猫超买的，加上各种折扣和之前的超市返卡， 3 只鸡腿 4.93 元，加上大周五，最近加班犒劳一下自己呗，所以我 3 只一起腌制了哈哈哈哈2、盐焗鸡粉，或者是我之前常用的方便面调料，或者你自己抹盐抹胡椒粉都可以，我今晚是把上次开封剩下的半包盐焗鸡粉先用掉3、料酒 0.5 勺，用来去个腥## 备料过程1、牙签给鸡腿戳 N 个小洞，在清水里尽量泡掉血水2、倒掉泡鸡腿的水，洗净鸡腿，放保鲜盒3、撒上调料抓匀，腌制一个晚上腌制的鸡腿## 焗鸡腿空气炸锅 200 度恒温，烤 20 分钟（锅的建议是 18 到 25 分钟，看你鸡腿大小适当调整）准备烤没了，哈哈哈哈哈哈哈哈就是这么简单了，害，我上次干啥想不开要用电饭煲呢，还是空气炸锅用的趁手方便！好吃！！！烤好了准备出炉## 成品展示这色泽真好看！！！好好看颜值真的高里面的肉很嫩很下饭哈哈哈"
  },
  {
    "slug": "chaozhou-xiancai-chao-rousi",
    "title": "省钱菜谱：3元的潮州咸菜炒肉丝（1min）",
    "desc": "今晚回来晚，依然没什么东西买，不过居然看到了“潮州咸菜”……我的家乡小菜啊啊啊！熟悉的感觉！！！六七年前我刚学下厨的时候就经常做这个，因为真的特别简单，又极具家乡风味（虽然我不知道今晚这颗潮州咸菜为什么跑去汕头生产哈哈哈哈哈哈…不过都是胶己人！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203164003.jpg?x-oss-process=image/interlace,1",
    "content": "今晚看看能不能挑战最快的带饭快手菜哈哈哈哈哈哈，1分钟出炉！！！虽然最近很忙，做菜看起来也有点过于将就，但其实每天还是有在认真思考“今天吃什么”，因为只有这个时候才能把自己从工作状态拉回到生活里。今晚回来晚，依然没什么东西买，不过居然看到了“潮州咸菜”……我的家乡小菜啊啊啊！熟悉的感觉！！！六七年前我刚学下厨的时候就经常做这个，因为真的特别简单，又极具家乡风味（虽然我不知道今晚这颗潮州咸菜为什么跑去汕头生产哈哈哈哈哈哈…不过都是胶己人！！！先安利首歌吧，好几天没安利我喜欢的乐队了，推一首纯音乐吧，小雨乐队的《苦林破青》，笛子作为主旋律的民乐金属（我有个视频笔记就是这首曲子的现场演出！！！），原本计划下个月回一趟广州看他们的巡演收官站的，看这项目节奏我感觉我还是走不开了呜呜呜…成品图：潮州咸菜炒肉丝## 主要食材1、潮州咸菜半颗，哈哈哈哈今晚这颗3.5元，所以这里1.7元潮州咸菜2、瘦肉切了一点点，按楼下菜市场阿姨给我的晚市优惠，不到2元，加上咸菜一起算3元好了## 备料1、咸菜拆开包装，倒掉里面的泡菜汤水，切半颗，剩下半颗就保鲜袋收起来冷藏留给下次哈哈哈哈2、咸菜洗净，滴干水份，切丝3、瘦肉切丝准备好的食材## 炒菜可能想到榨菜肉丝我用了2分钟，所以今晚突然很想再试试能不能更快，所以今晚全程用的是猛火1000度（平时800）1、一点油热锅，油温上来了，下肉丝快速翻炒2、因为肉也没有多少，所以十几秒而已，肉就变色熟了，加一点点盐调味（觉得有咸菜也可以不加，不过我还是加了一点）先炒肉3、咸菜丝倒进去翻炒十几秒再一起炒均匀就这样哈哈哈哈哈哈哈哈哈哈哈搞定！！！！搞定啦明天带饭也是吃这个！！！超级方便！！！明天的午餐"
  },
  {
    "slug": "heijiaoroumo-zhuchangfen",
    "title": "省钱菜谱：3.7元的黑椒肉末猪肠粉（5min）",
    "desc": "昨晚加班回去的比较晚，买不到什么菜了，看到还有猪肠粉就买了点，换个料汁来做感觉也不错！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203165751.jpg?x-oss-process=image/interlace,1",
    "content": "昨晚加班回去的比较晚，买不到什么菜了，看到还有猪肠粉就买了点，换个料汁来做感觉也不错！成品图：黑椒肉末猪肠粉## 主要食材1、猪肠粉2.2元，切段2、瘦肉切了大约1.5元，剁成肉末## 制作料汁1、老抽1勺（我用了1.5勺感觉颜色有点深…）2、白酱油1勺3、黑椒粉0.5勺4、花椒粉0.2勺5、白砂糖0.2勺6、再加一点淀粉我加了白芝麻，但是感觉好像可以不加，把这些调料加3勺水兑匀备用。食材和料汁## 烹饪过程1、猪肠粉先煎到表层有点焦焦的感觉（虽然颜色上不一定焦，不过还是能感觉出有煎过的那种效果）2、先盛出来备用3、锅里一点点油，把肉末煸炒熟4、料汁倒进去，跟肉末一起翻炒一下5、猪肠粉再倒进去，跟料汁肉末一起翻炒均匀就可以了炒匀就可以出炉啦！搞定出炉哈哈哈哈我这个做来今天中午带饭的，微波炉热一下，口感跟昨晚刚做好之后偷吃了几块感觉没太大差别，带饭的同学也可以参考带下猪肠粉！"
  },
  {
    "slug": "tianjiaosi-shacha-roupian",
    "title": "省钱菜谱：6.2元的甜椒丝沙茶肉片（5min）",
    "desc": "哈哈哈哈哈哈我昨晚买到了一个咆哮的甜椒，对半切的时候没想到收获了表情包笑死了！去的晚没什么菜买，不过甜椒也不错，刚好适合中午带饭！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203171233.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈哈哈我昨晚买到了一个咆哮的甜椒，对半切的时候没想到收获了表情包笑死了！表情包哈哈哈哈去的晚没什么菜买，不过甜椒也不错，刚好适合中午带饭！！！成品图：甜椒丝沙茶肉片## 主要食材1、甜椒买了1个小的，2.2元2、瘦肉切了大约4块钱3、沙茶酱4、盐## 备料过程1、甜椒切开，去籽，切成细丝或者滚刀块都可以，洗净备用2、瘦肉切薄片3、沙茶酱1.5勺，加1勺水稍微兑一下，有点浓稠的感觉就好，不用太稀准备好的材料## 烹饪过程1、一点油热锅，油温上来了先把肉片炒熟，加一点盐调味，盛到沙茶酱的碗里拌匀炒肉拌匀，简单腌制2、甜椒炒熟，加一点盐调味炒甜椒3、把沙茶肉片倒进去炒匀就可以了炒匀即可小时候我不怎么爱吃甜椒的，不过现在倒是很喜欢，我感觉沙茶酱的功劳最大哈哈哈哈！！！"
  },
  {
    "slug": "huasheng-zhushoutang",
    "title": "两个步骤煲出超级软糯的花生猪手汤（3h）",
    "desc": "立冬啦！虽然深圳今天是30度的冬天，不过明天新的一周还真的是要降温，今天煲个汤先提前暖和暖和哈哈哈哈（刚好傍晚开始就有点凉飕飕了…因为昨天晚上去爬山了，运动量略大，所以今晚煲的是肉量超满足的猪手，超级软糯，几乎入口即化，你看那猪皮，稍微一抖就断了，嗷嗷嗷~汤也是超级鲜甜！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203172535.jpg?x-oss-process=image/interlace,1",
    "content": "立冬啦！虽然深圳今天是30度的冬天，不过明天新的一周还真的是要降温，今天煲个汤先提前暖和暖和哈哈哈哈（刚好傍晚开始就有点凉飕飕了…·因为昨天晚上去爬山了，运动量略大，所以今晚煲的是肉量超满足的猪手，超级软糯，几乎入口即化，你看那猪皮，稍微一抖就断了，嗷嗷嗷\\~汤也是超级鲜甜！！！然而过程超级简单，用料也非常简单，就两个步骤，适合新手，适合懒人！成品图：花生猪手汤## 主要食材1、半只猪手，让档主帮你斩小块2、红枣，我拿了8粒3、花生米，一小把4、几片姜，用来飞水的时候去腥你可以再加点枸杞哈哈哈哈，🤣🤣🤣我又忘记买了…## 所需工具1、电磁炉的汤锅用来飞水2、煲汤我用的是隔水炖的炖锅，你也可以用你趁手的高压锅、电饭煲，能够煲汤的锅都可以3、电热壶可以提前煮一壶水备用## 飞水过程1、猪手洗净，如果档主没斩断（喜闻乐见的刀工…），可以再自己切一下2、电磁炉的汤锅先装一锅水，切几片姜，和猪手一起倒进去3、开大火，加热到沸腾就关火4、捞走浮沫杂质大火飞水## 煲汤过程1、红枣划一刀，枣核拿出来，铺在炖锅底部2、花生米洗净，也是铺在炖锅底部铺好材料3、飞水完毕的猪手，用筷子夹到炖锅里，骨头多的优先放在底部，比如蹄尖，这样这些部位可以被炖的比较充分，等会吃的时候基本上一碰就脱骨把猪手夹出来4、刚才提前煮好的开水，炖锅里加到8分满（因为今天分量多了点，所以有一点点没法淹没猪手，但不能再加了，等会沸腾的时候会溢出来）5、炖锅外也就是隔水层，也是加到8分满6、选煲汤模式炖2.8小时（猪手汤因为是一次出炉，要软糯口感所以炖的比较久）然后你就继续忙你的事了，中间啥也不用管了！超级省心！！！其他锅像高压锅的话，时间就按你习惯或者说明书去调整了哈！## 盛汤出锅时间到了就可以盛出来了，先拿出来静置一会，汤勺刮走汤表层的油脂，然后大碗里加一小勺盐，先舀几勺汤兑匀，然后就可以把猪手盛出来了，就搞定啦！！！好软糯的皮稍微抖一抖就软烂到要断好好吃，好软糯，大冷天吃猪手汤太舒服了！一大碗全是肉肉呜呜呜好吃"
  },
  {
    "slug": "shacha-xilanhua",
    "title": "省钱菜谱：3元的沙茶西兰花（5min）",
    "desc": "立冬啦！虽然深圳今天是30度的冬天，不过明天新的一周还真的是要降温，今天煲个汤先提前暖和暖和哈哈哈哈（刚好傍晚开始就有点凉飕飕了…因为昨天晚上去爬山了，运动量略大，所以今晚煲的是肉量超满足的猪手，超级软糯，几乎入口即化，你看那猪皮，稍微一抖就断了，嗷嗷嗷~汤也是超级鲜甜！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203173635.jpg?x-oss-process=image/interlace,1",
    "content": "😂😂😂因为西兰花本来是买来带饭的时候切几朵，免得一直没吃菜，这几天不是带炒面就是炒米粉，还有烤土豆什么的，又快被我遗忘了…昨晚试了一下加沙茶酱一起炒，还挺好吃，特别入味！！！成品图：沙茶西兰花## 主要食材1、沙茶酱，加两勺水兑成酱料2、西兰花，几朵就够了，先飞水烫熟准备好的食材## 炒菜过程过程没啥注意事项，就是先焯水，可以适当煮一下让西兰花变熟变软，炒的时候一点点油就行，有点偏干煸，然后倒入兑好的沙茶酱一起翻煮，汁快收干了就搞定了。先翻炒一下西兰花差不多可以出炉了"
  },
  {
    "slug": "qingguasi-huotui-chaomian",
    "title": "省钱菜单：4.7元的青瓜丝火腿炒面（10min）",
    "desc": "爽脆可口的青瓜丝，搭配煎过的火腿丝，真好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203174848.jpg?x-oss-process=image/interlace,1",
    "content": "爽脆可口的青瓜丝，搭配煎过的火腿丝，真好吃！！！成品图：青瓜丝火腿炒面## 主要食材1、火腿肠，大半个月前超市做活动买了一捆 3 根 11.9 元，切了 4 分之 1 根，算 1 元大火腿肠2、青瓜半根， 1.2 元3、香菇约 0.5 元4、面饼还是之前那个面， 2 饼 2 块钱5、生抽酱油 1 勺，加 2 勺热水兑匀所以这餐是 4.7 元。## 处理面条先煮软，然后捞出来过一下凉水，倒掉凉水，淋上一勺香油拌匀，这样就不会坨了！准备好的所有材料## 炒面过程炒面过程大同小异，包括料汁也是一样的，我发现我发了好几次炒面菜谱了，这次我就不写那么细了吧！就提供一下炒面搭配可以参考！唯一区别可能就是，青瓜丝是不用炒熟的，刮皮擦丝之后，就放盘子里备用就好，等最后一起随着其他材料下锅跟面炒匀！1、试探一下油温，油温热了再炒。试探一下油温2、煎一下火腿丝煎一下火腿丝3、把香菇丝爆香香菇爆香4、炒面，淋上生抽酱油上色炒面上色5、把材料都倒进去炒匀炒匀## 成品展示过程也不复杂，好吃哈哈哈哈好看又好吃"
  },
  {
    "slug": "chaozhou-chao-doufan",
    "title": "省钱菜谱：3.4元的潮州炒豆饭（10min）",
    "desc": "炒豆饭，也是我家比较常做的炒饭之一，也是以前还在潮州家里的时候我妈经常做给我吃的炒饭品类的其中一种。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203180355.jpg?x-oss-process=image/interlace,1",
    "content": "炒豆饭，也是我家比较常做的炒饭之一，也是以前还在潮州家里的时候我妈经常做给我吃的炒饭品类的其中一种。本人惯例，先安利一首我喜欢的歌吧！今天安利一首雪沉乐队的《乌木》，也是一支我喜欢了 3 年多的乐队，好像也是定位的民谣金属，来自山西的宝藏乐队，之所以先安利这一首呢，因为很适合作为入坑曲子，就算听不惯这种唱腔的话，也可以先听他们的纯音乐版本哈哈哈\\~哈哈哈哈哈继续说我们的炒饭！成品图：潮州炒豆饭## 主要食材1、长豆角一小把， 2.1 元2、干香菇几朵，约 0.3 元3、瘦肉切 1 元的量4、虾皮一小撮5、白酱油（或生抽）6、盐7、提前煮好的大米饭（水少一点，提前冷藏 6 小时以上，提前一晚上会更好）## 备料过程1、因为我的锅比较小，所以长豆角我是直接先切段再焯水了，汤锅先把水煮开，期间先切长豆角，去头去尾，切约 1 寸长的小段。2、水开了，先舀点热水出来把干香菇用热水泡着3、然后长豆角放进汤锅，加一勺盐一起，电磁炉 800 度，盖上盖子让它倒计时煮 5 分钟豆角飞水4、期间继续切肉，切成薄肉片或者肉丝都可以5、香菇泡好了，挤干水分，切香菇丝6、这个时候豆角也好了，捞出来过一下冷水，再捞干备用7、一勺白酱油 + 两勺水，兑成稀一点的料汁备用这个环节处理的长豆角，可以去掉豆角草酸，也可以让它等下更容易熟，过一下冷水则可以让它保持爽脆一些的口感，颜值也好看。准备好的所有材料## 炒饭过程1、炒锅加油热锅，先把香菇丝爆香，然后肉片放下去一起炒熟，加盐调味，盛出来备用2、豆角段先翻炒均匀都过一遍热油，然后加两锅铲的水一起半煮半炒，直到水被豆角差不多吸收走了，就可以加盐调味，也是盛出来备用炒豆角，加点水水会被吸干3、洗一下锅，重新倒一点油加热，等油温上来了，把饭倒进去，锅铲一边翻炒一边压散炒饭4、等饭都炒的很散很颗粒了，把准备好的酱油料汁倒进去，快速翻炒，均匀上色上色5、火关到最小，把肉片和香菇丝、虾皮都倒进去翻炒均匀，就可以了炒匀## 成品展示可好吃了用豆角来炒饭！好吃的炒饭有荤有素吃光光哈哈哈"
  },
  {
    "slug": "roupian-chao-baocaisi",
    "title": "省钱菜谱：2.2元的肉片炒包菜丝（5min）",
    "desc": "买的下午3点多的高铁，回到深圳住的地方还不到6点，来回还是蛮方便的，还赶得上做个晚餐，今晚简单一点，炒了个包菜丝。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203181229.jpg?x-oss-process=image/interlace,1",
    "content": "没想到吧，我真的就是回潮州吃盘肠粉，然后就回深圳了哈哈哈哈哈哈哈哈！！！！！没有啦主要是因为刚好有点事要回趟家，工作又比较忙，所以就周六回去周日回来了，有点仓促，下次再在家多待几天。买的下午3点多的高铁，回到深圳住的地方还不到6点，来回还是蛮方便的，还赶得上做个晚餐，今晚简单一点，炒了个包菜丝。成品图：肉片炒包菜丝## 主要食材1、平包菜，一小个，今晚这个1.2元。2、瘦肉，因为主要吃菜，所以只切了大约1元3、盐4、蒜头油（可不加）## 备料过程1、包菜切丝，洗净，倒水的时候用笊篱拦一下，可以避免包菜丝掉出来堵住排水孔2、瘦肉切片就好洗包菜丝准备好的食材## 炒菜过程1、倒点油热锅，先把肉炒熟，加一点盐调味，先盛出来备用2、包菜丝倒进去炒，因为今晚包菜的分量有点多，所以我开了 1000 度（平时炒菜都是 800 度就可以了），避免炒得太久炒包菜丝3、先把包菜丝翻炒都过一下油，然后看一下锅里会不会太干，如果太干的话适量加一点水一起炒4、翻炒到包菜丝变得晶莹剔透绿油油的很光泽，就说明熟了熟了包菜会出水5、火关小一点，加盐调味，再加入一勺蒜头油，翻炒均匀加蒜头油6、把瘦肉也倒进去，炒匀，就可以出锅了！！！肉片一起炒盛出来的时候汤汁可以不要## 出锅成品我猜你们平时可能都是做的手撕包菜比较多？不妨试试这个做法，比较潮汕风味\\~虽然清淡但很好吃"
  },
  {
    "slug": "baicaisi-haoyou-chaomian",
    "title": "省钱菜谱：3.6元的包菜丝蚝油炒面（10min）",
    "desc": "我最近菜谱发的比较少是因为工作忙了，项目工期最近有点紧，天天加班，11月估计大部分时间也是这样，老板给的工期是11月底要出版本，所以，最近没有太多时间好好做饭，我这几天都是做一些豉油猪肉、榨菜炒肉这样的超快速出餐的菜品…哈哈哈哈不过答应过要发的不会忘！前几天说要炒面，今天来了！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203223718.jpg?x-oss-process=image/interlace,1",
    "content": "最近很喜欢70年代的音乐，四五十年前的摇滚和朋克，现在听来还是这么棒，今天安利一首Lynyrd Skynyrd乐队的《Free Bird》，一支经历了空难和车祸的坎坷乐队，太坚强了！我最近菜谱发的比较少是因为工作忙了，项目工期最近有点紧，天天加班，11月估计大部分时间也是这样，老板给的工期是11月底要出版本，所以，最近没有太多时间好好做饭，我这几天都是做一些豉油猪肉、榨菜炒肉这样的超快速出餐的菜品…哈哈哈哈不过答应过要发的不会忘！前几天说要炒面，今天来了！成品图：包菜丝蚝油炒面## 主要食材1、平包菜，今天买到一个特别迷你，特别适合一个人吃的，3毛钱！！！哈哈哈超迷你包菜2、面条2饼，这次买的是超市包装的挂面，平均1饼1块钱（因为我看这个造型就很适合炒面）3、干香菇几朵约0.3元4、瘦肉只切了约1元5、芝麻香油（拌面条用的）6、盐（炒菜和肉要调味）算起来这一餐大概 3.6 元，另外再准备一碗凉白开。## 料汁调味这些调料是要兑成炒面上色和调味的料汁：1、蚝油 1 勺2、老抽 0.5 勺3、白酱油 0.5 勺（或者生抽）4、白糖 0.3 勺5、胡椒粉 0.2 勺6、花椒粉 0.2 勺比例可以根据自己的口味适当调整\\~准备好的食材## 前期工作1、汤锅煮多些水，水开了先舀一碗热水泡一下干香菇，泡开后切丝2、再舀3勺子热水把调料先兑成料汁3、汤锅下面饼，把面煮软，笊篱捞干出来，把捞出来的面条泡一下凉白开4、几十秒后再把面条捞干到碗里，淋上一圈芝麻香油，拌匀，这样面条就不会坨了5、包菜切丝洗净，在倒掉水的时候可以用笊篱来拦一下，就不会担心菜丝掉出去堵住排水孔了## 备料过程1、炒锅加油热锅，香菇先爆香，再把瘦肉一起下去炒熟，加盐调味，盛出来备用2、刚才锅里的油继续炒菜，包菜丝先翻炒几次，然后加一锅铲的水再继续炒，这样炒出来的包菜丝容易熟，而且很软嫩，不然光靠干炒的话，时间久还容易糊炒包菜丝3、包菜丝都变软变得晶莹剔透了，就说明熟了，加盐调味炒匀，盛出来的时候可以像我一样先用锅铲把水滤一下，就不会很多汤汁带出来滤掉包菜出的水## 炒面过程处理好了食材，就可以准备炒面了。炒面前的食材1、洗一下锅，重新加油热锅，油温上来了再下面，先炒散先炒散面条2、淋上料汁，快速翻炒，让面条上色均匀给面条上色3、翻炒几次后，把刚才炒好的香菇丝、肉片、包菜丝一起倒进去炒均匀，面条就好了！炒匀所有材料## 成品展示这个面我特别喜欢！超级推荐！！！好看又好吃真的好好吃"
  },
  {
    "slug": "chashao-tangmifen",
    "title": "省钱菜谱：4.5元的叉烧汤米粉（15min）",
    "desc": "昨晚买回来的瘦肉特别的呈圆柱体……我感觉如果不拿来干点啥，直接切肉片似乎有点对不起它，想想好久没吃叉烧了，哈哈哈哈所以我用叉烧酱把它腌制了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203230110.jpg?x-oss-process=image/interlace,1",
    "content": "昨晚买回来的瘦肉特别的呈圆柱体……我感觉如果不拿来干点啥，直接切肉片似乎有点对不起它，想想好久没吃叉烧了，哈哈哈哈所以我用叉烧酱把它腌制了！！！之前单独发过一次烤叉烧的菜谱，汤米粉也单独发了，今天搭配一下这 2 个，做个叉烧粉，广东这边还是蛮流行这种搭配的，你搜外卖应该也都能搜到叉烧汤粉的搭配\\~今天安利黑豹乐队一首综艺现场， 2014 年“不朽之名曲”现场版的《明天我要嫁给你》，是张淇加入黑豹乐队第二年的一次演出，虽然很多人是因为最近“披荆斩棘的哥哥”才认识张淇，但我是 7 年前看这个节目知道的他，这个现场真的太牛逼了， 2 分 30 秒那个高音！！！爱死了！！！（深深记得鹿晗当时那个惊讶的表情 hhhhh ）成品图：叉烧汤米粉## 主要食材这次的食材分了 3 部分：### 叉烧部分1、瘦肉一块，这次是留了 4 块钱的量2、叉烧酱3、白砂糖（我喜欢甜一点的叉烧口感）### 汤粉部分1、潮州细米粉一把（我妈寄过来的所以不要钱）2、几片生菜（算 0.5 元）3、葱一根，切葱花这种细米粉### 汤底调料1、鱼露2、胡椒粉3、蒜头油4、芝麻香油## 腌制叉烧提前一个晚上腌制：1、因为这块肉是圆柱体，所以我把肉切成了薄片，不然中间太厚不入味，也不容易熟，切出来有点像一个个大型硬币…2、我加了1.5勺的叉烧酱，还有一点点精幼白砂糖，抓匀，放保鲜盒，冰箱冷藏腌制一晚上（如果是粗白糖可以适当加一点点热水先把糖化开）切小块腌制一晚上## 制作过程1、叉烧还是用空气炸锅烤的，铺满炸篮的底就不要再叠了，所以我烤了 2 次， 200 度恒温，一次 7 分钟，烤第二次的时候就可以去煮水准备煮米粉了。拿出来烤烤好的样子2、汤米粉就跟之前的菜谱一样了，先煮开一锅水，碗底先加鱼露和胡椒粉，水开了就兑好汤底3、然后把细米粉加进去煮熟，煮软了然后水沸腾了就可以用笊篱捞干出来放碗里4、生菜叶烫熟，铺在米粉上面快好了5、烤好的叉烧片铺在生菜叶上，这样就不会一直被汤泡着失去了颜值和味道（划重点）6、撒上葱花，淋上芝麻香油、蒜头油搞定！可以吃了！又好看又好吃过程还是挺快的，有一半的时间是用在烤叉烧上面，如果你的炸锅比较大一次可以烤完，基本上七八分钟就可以吃上了！如果是烤箱的话，虽然烤盘比较大可以一次烤完，但时间差不多要空气炸锅的 2 倍才能达到一样的效果，所以预计也是要在 15 分钟左右。"
  },
  {
    "slug": "jujitui-pei-haoyou-chaomian",
    "title": "省钱菜单：6.3元的焗鸡腿配蚝油炒面（40min）",
    "desc": "因为鸡腿是电饭煲焗的，开的柴火饭模式本来20min不到就完事，结果效果不好看，又焗了第二次才出来这效果，[doge][doge][doge]慢死了！不想玩！等我重新琢磨一下做法。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220203231409.jpg?x-oss-process=image/interlace,1",
    "content": "这个我就不写菜谱了，虽然很好吃，但是我觉得过程不满意…就分享一下晚餐搭配…因为鸡腿是电饭煲焗的，开的柴火饭模式本来20min不到就完事，结果效果不好看，又焗了第二次才出来这效果，\\[doge]\\[doge]\\[doge]慢死了！不想玩！等我重新琢磨一下做法。哈哈哈哈不过这个炒面就不一样，很满意！下次我单独炒个面再一起说过程吧！！！明晚或者过两天哈哈哈哈太好吃了这个面！成品图：焗鸡腿配蚝油炒面## 相关菜谱关于这次的鸡腿，建议看文末相关菜谱的推荐做法，炒面也建议直接看完整版菜谱。## 步骤参考这次是用电饭煲，不是很推荐，太麻烦了，大概了解一下即可。腌制鸡腿在电饭煲里烤煮软捞干准备好料汁炒面给炒面上色## 成品展示虽然步骤有点麻烦，但真的是色香味俱全！！！很棒的午餐鸡腿好好看面好好吃鸡腿也好好吃"
  },
  {
    "slug": "xiannengduozhi-zhajitui",
    "title": "省钱菜谱：4.3元的鲜嫩多汁炸鸡腿（15min）",
    "desc": "用空气炸锅炸出来的鸡腿特别好吃，跟麦当劳的那个麦麦脆汁鸡腿很像，都是外层金黄酥脆，但是咬开却鲜嫩多汁！当然调味方面我比较简单，没有麦当劳那么复杂（emm懒就直说），但是也很好吃！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204003700.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈哈哈哈哈哈哈哈哈哈“炸个鸡腿都是爱你的形状”，昨天晚上无心插柳出来的效果，在做的时候从头到尾都没看出来，做完装盘里才发现居然是个爱心！用空气炸锅炸出来的鸡腿特别好吃，跟麦当劳的那个麦麦脆汁鸡腿很像，都是外层金黄酥脆，但是咬开却鲜嫩多汁！当然调味方面我比较简单，没有麦当劳那么复杂（emm懒就直说），但是也很好吃！成品图：鲜嫩多汁炸鸡腿## 主要食材1、琵琶腿2只2、方便面调味料（自己就用胡椒粉、花椒粉、盐来代替）3、方便面麻油（自己就用芝麻香油代替）4、料酒0.5勺5、炸鸡粉6、面包糠鸡腿买的冻品6.46元有3只，这里用了2只就4.3元（哈哈哈一开始算错价格了！！！）我用的蟹皇面调味包## 腌制鸡腿1、鸡腿解冻，洗净，用牙签戳小孔方便入味，也可以把血水泡出来2、在水里泡上十几分钟，让鸡腿的血水都出来（可能看起来不多，但是对成品的颜值影响还是巨大的）3、放保鲜盒里，半勺料酒去腥，然后把调味料和麻油都放进去抓匀放冷藏腌制一晚上，第二天再做。腌制鸡腿## 炸鸡过程我用的是空气炸锅，无油炸鸡。1、撒上一层炸鸡粉抓匀，这一步是为了锁住鸡腿的水分，能够达到外脆里嫩的口感2、裹上面包糠，这一步是为了做出脆皮效果裹粉，裹面包糠空气炸锅200度恒温，烤15分钟，搞定（我今晚的鸡腿不是很大，所以可以完全熟透，大鸡腿记得自己延长时间哦！！！）。炸之前炸好后## 成品展示这道菜没啥难度哈哈哈哈，简直就是传说中的“啥事不干，坐等吃饭”，很适合新手和懒人！爱你的形状哈哈哈非常成功非常好吃肉质很嫩全部啃完"
  },
  {
    "slug": "tianla-zhajiliu",
    "title": "省钱菜谱：4元的甜辣炸鸡柳（10min）",
    "desc": "今晚跟我妈语音了半天，应该月底回家一趟了，深圳回潮州还是方便啊，不用赶着节假日出行，可以错峰回家，虽然没有像之前在广州的时候，佛山的同事周末回家那么方便，不过一个周末也是够用哈哈哈，三只猫也不用找人帮忙喂，养猫也是省心在这点。前两天吃的有点潦草，因为这几天工作突然忙碌了起来，虽然也没有加班很久，但回到家还是要看看资料啥的，今晚终于可以好好做点东西吃。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204004826.jpg?x-oss-process=image/interlace,1",
    "content": "今晚跟我妈语音了半天，应该月底回家一趟了，深圳回潮州还是方便啊，不用赶着节假日出行，可以错峰回家，虽然没有像之前在广州的时候，佛山的同事周末回家那么方便，不过一个周末也是够用哈哈哈，三只猫也不用找人帮忙喂，养猫也是省心在这点。前两天吃的有点潦草，因为这几天工作突然忙碌了起来，虽然也没有加班很久，但回到家还是要看看资料啥的，今晚终于可以好好做点东西吃。成品图：甜辣炸鸡柳## 主要食材1、鸡胸肉一大块，猫超采购的冷冻鸡大胸8.09元，提前一晚上从冷冻室拿到冷藏室解冻，忘记了也没关系，放水里解冻也行2、泰式甜辣酱3、酥炸粉，超市随便买的，就是炸鸡炸排骨都可以用的那种专门炸东西的粉4、白酱油（或者生抽）1勺，提味5、料酒0.5勺，去腥6、淀粉0.5勺，让鸡肉口感更好7、一小撮白芝麻可以先煮一壶开水备用，今晚是连同明天中午带饭的午餐一起做的，所以每餐大约是4块钱。## 备料过程1、鸡胸肉切成条状，不要太粗，太粗不好炸，切好后再过水洗一下2、洗净的鸡胸肉，加入料酒、白酱油、淀粉、酥炸粉，抓匀，放到冰箱冷藏腌制15分钟这个过程不需要腌制很久，也不需要加很多调料，因为这道菜的主要味道还是甜辣酱的功劳。腌制主要是让鸡胸肉适当提升一下口感，像料酒去一下腥味，淀粉可以让鸡肉更嫩滑一些。切好的鸡胸肉腌制一下## 油炸过程1、倒油烧热到开始冒小泡，用筷子把鸡胸肉夹进去油炸（推荐用筷子，容易控制，锅铲在这里有点不好发挥）开始炸2、准备好盘子，铺上吸油纸（没有也没事，等下多滴干几下油）3、炸到金黄就可以先夹出来了，一边出炉一边继续炸陆续出锅4、全部炸好，吸油纸可以抽出来扔了今晚的分量大概炸了8分钟，炸好了可以先洗一下锅。炸好啦## 裹酱过程1、根据今晚的肉量，我是用了3勺甜辣酱，把白芝麻加进去，再兑3勺开水拌匀，这样甜辣酱不会很粘稠，比较好裹到肉上，不然裹匀要用很多酱料就太重口了兑好的甜辣酱2、一点点油，电磁炉300度就可以，把调好的酱汁到进去，开小火加热3、煮到冒泡有点粘稠了，就可以把炸好的鸡胸肉倒进去翻炒状态 OK 了4、还是保持这个温度，等到酱汁都快收干了就可以出锅了，这个过程也就1分钟左右裹上了酱因为甜辣酱本身是成品酱料来着，也比较粘稠，所以我没有大火收汁，怕糊锅哈哈哈，这样直接裹上去色泽也很亮。很好吃！！！"
  },
  {
    "slug": "chaozhou-yutou-chaoxiangfan",
    "title": "省钱菜谱：3元的潮州芋头炒香饭（10min）",
    "desc": "中午炒了个潮州香饭，我家那边的炒饭也很好吃！之前还在家的时候，我妈时不时会问我“阿弟，日逗食攀饭啊迈？”（就问我中午吃不吃香饭哈哈哈哈…香饭其实没有唯一的做法，你可以用“芋头、土豆、豆粒、菜脯、虾仁、鱿鱼”等等，反正只要能拿来炒饭的食材，都可以，我今天用的是我家比较常用的一个做法，用的芋头。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204010243.jpg?x-oss-process=image/interlace,1",
    "content": "中午炒了个潮州香饭，我家那边的炒饭也很好吃！之前还在家的时候，我妈时不时会问我“阿弟，日逗食攀饭啊迈？”（就问我中午吃不吃香饭哈哈哈哈…香饭其实没有唯一的做法，你可以用“芋头、土豆、豆粒、菜脯、虾仁、鱿鱼”等等，反正只要能拿来炒饭的食材，都可以，我今天用的是我家比较常用的一个做法，用的芋头。成品图：潮州芋头炒香饭## 主要食材1、芋头，巴掌大的一小块就够，约1.5元2、瘦肉，很小一块就可以，约1元3、干香菇几朵，约0.5元4、花生米一小把5、虾皮一小撮6、葱一根7、老抽0.5勺8、白酱油1勺（生抽也可）9、盐10、五香粉11、冷藏的白米饭一盒再提前电热壶煮一壶开水，另外芋头耐饱，所以米饭可以稍微少点，比如我平时吃2碗饭，这次就准备1碗半就够了。## 备料过程1、芋头削皮，切小粒，然后洗净，记得戴个一次性手套去拿芋头，免得手沾了粘液会痒，洗芋丁的时候我是用笊篱代替手，包括捞出来滴干，特别方便2、瘦肉切成薄薄的小片，或者肉丝3、香菇热水泡开，然后切丝4、花生米冷水泡到可以搓皮，去皮后冷油下锅，300度炸到金黄色5、切葱花6、老抽和白酱油混一起，加上两勺热水兑成料汁备用准备好的食材## 炒料过程1、先把香菇爆香，加一点盐调味，装碗备用2、瘦肉炒熟，也是加一点盐，装碗里备用3、芋丁先下锅翻炒，然后倒 2 锅铲的开水进去一起半煮半炒，等水快被收干了，就再加一次水，重复 3 次，也就是一共加 4 次水（我这个锅铲的分量 8 锅铲）炒芋丁4、芋丁最后一次加的水快干的时候，撒上一点五香粉，还有盐，翻炒均匀，装盘备用差不多好了的样子然后可以去洗一下锅，准备炒饭。## 炒饭过程煮饭时水少一点，比较适合炒饭，冷藏一夜后，颗粒分明，非常完美！米饭煮成这样最好吃1、倒一点油，电磁炉800度，把饭先用锅铲先切小块，然后适当压散，因为我们的饭煮的好，所以完全不必担心会压成米糊，还是会保持颗粒分明米饭压散2、白米饭炒散之后，把刚才拌匀的酱油料汁倒进去，翻炒上色均匀上色3、降低电磁炉到300度，把刚才准备好的所有食材都倒进去翻炒均匀，就可以了都倒进去炒匀所有食材降低温度是为了防止最后倒材料的时候，因为没有锅铲在翻动，担心把饭炒糊哈哈哈，如果你的是不粘锅，那就问题不大。好好吃哈哈哈啧啧，小朋友都闻香而来要我抱着他一起吃饭哈哈哈哈哈哈哈哈哈哈！小朋友非要来抱抱"
  },
  {
    "slug": "heijiaozhi-tudou-kao-rouli",
    "title": "省钱菜谱：5元的黑椒汁土豆烤肉粒（23min）",
    "desc": "周末啦周末啦！！！今天安利一支芬兰乐队Nightwish，国内习惯称呼“夜愿”，没有接触过美声金属的话，可以从最热门的《I Want My Tears Back》听听看，苏格兰风笛好厉害！另外一首《Last Ride Of The Day》我也超喜欢，经常能单曲循环大半天！然后开始做菜哈哈哈哈哈，话说之前师妹给我买澳洲牛肉粒的时候，我就做过一道黑椒汁烤牛肉粒，今天用类似的方法做这道土豆烤肉粒，这次用的是猪瘦肉。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204161129.jpg?x-oss-process=image/interlace,1",
    "content": "周末啦周末啦！！！今天安利一支芬兰乐队 Nightwish，国内习惯称呼“夜愿”，没有接触过美声金属的话，可以从最热门的《I Want My Tears Back》听听看，苏格兰风笛好厉害！另外一首《Last Ride Of The Day》我也超喜欢，经常能单曲循环大半天！然后开始做菜哈哈哈哈哈，话说之前师妹给我买澳洲牛肉粒的时候，我就做过一道黑椒汁烤牛肉粒，今天用类似的方法做这道土豆烤肉粒，这次用的是猪瘦肉。之所以只是类似，是因为当时怕牛肉太老，所以最后的裹汁环节只是淋上去，没有像今天一样再下锅收汁。成品图：黑椒汁土豆烤肉粒## 主要食材1、土豆 1 个， 1 元，一小个就够2、瘦肉一块，今天是 4 块钱## 腌肉过程这是提前一天的准备工作。瘦肉切成1厘米的肉丁，洗净，放到保温盒里，加入以下调料抓匀：1、黑椒粉0.3勺2、胡椒粉0.3勺3、花椒粉0.3勺4、白酱油1勺（或者生抽酱油）5、芝麻香油0.5勺6、料酒0.5勺抓匀后，盖好盖子在冰箱里冷藏一晚上。## 处理土豆洗净削皮，切小块，再次冲水洗掉土豆本身的淀粉粘液## 烤肉过程空气炸锅的炸篮铺上锡纸，稍微大张一点，因为要全包。把土豆和腌制好的肉丁都放进去，锡纸包住， 200 度恒温烤 20 分钟。放一起包好包好放进去烤## 调制料汁在烤肉的过程中，我们先把料汁准备好：1、黑椒粉0.3勺2、胡椒粉0.3勺3、花椒粉0.3勺4、老抽酱油1勺5、白砂糖0.3勺6、盐是平时炒菜的一半7、白芝麻8、一点点淀粉加小半碗开水，拌匀备用。调好的料汁## 裹汁过程等肉烤好了，就可以熬料汁给肉裹汁。1、拆开锡纸，拿出来放盘子里比较好操作。烤好的肉和土豆粒2、炒锅里加一点油润锅，300度小火把料汁倒进去加热，时不时推来推去，避免糊底煮料汁3、等料汁开始变粘稠，把烤好的土豆和肉丁倒进去，调到800度，不断翻炒均匀下锅裹匀4、上色均匀并且料汁开始变少，调到1300度不断翻炒，大火收汁，几秒后就可以关火了！成品图好吃！！！别看都是0.3勺的用量好像不多，其实加起来也差不多有2勺…很够味！！！如果怕太重口可以适当在腌制环节减少一下用量，这个环节主要是给肉去腥和提一下口感。料汁环节我觉得倒是不要太少，最终浓郁的黑椒味道更多是来自料汁的功劳。"
  },
  {
    "slug": "roujiang-shuidoufu",
    "title": "省钱菜谱：3.5元的肉酱水豆腐（10min）",
    "desc": "哈哈哈哈哈我发现做饭跟敲代码真是异曲同工，敲代码经常会涉及到封装和复用，做菜也是，前几天做那个肉酱猪肠粉的时候对那个肉酱念念不忘，今晚骑车回来的时候，路上就想到要不我再复用一下，换个食材搞事情，于是想起了豆腐，果然，超好吃！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204163435.jpg?x-oss-process=image/interlace,1",
    "content": "今天台风终于走了！看来我这周末可以去爬山了！哈哈哈哈哈我发现做饭跟敲代码真是异曲同工，敲代码经常会涉及到封装和复用，做菜也是，前几天做那个肉酱猪肠粉的时候对那个肉酱念念不忘，今晚骑车回来的时候，路上就想到要不我再复用一下，换个食材搞事情，于是想起了豆腐，果然，超好吃！！！成品图：肉酱水豆腐## 主要食材1、水豆腐一块， 1.5 元2、瘦肉 2 元3、葱## 调制料汁1、蚝油 1 勺2、老抽 1 勺3、白砂糖 0.5 勺4、花椒粉 0.3 勺5、盐一点点6、淀粉一点点7、一小撮白芝麻8、小半碗开水9、白酱油 1 勺（或者生抽也可）哈哈哈哈哈没错，跟上次做猪肠粉的调料是一毛一样，区别只有第 9 点，多了一勺白酱油，毕竟这次是要作为主食下饭，可以更咸鲜一些。## 备料过程1、水豆腐切成 1 厘米的小方块2、瘦肉剁成肉末，适当弄散不要黏成一团3、切葱花4、所有调料拌匀成料汁备用切好的水豆腐准备好的其他材料## 制作过程要分三步走…### 豆腐焯水先给豆腐焯一下水，可以让水豆腐不那么容易被弄的很碎：1、汤锅装一锅水，把豆腐冷水下锅，加1勺盐，大火煮到水开就可以关火了2、勺子舀掉浮沫，用笊篱把豆腐捞出来，滴干水份备用豆腐焯水### 豆腐加工再把豆腐炒一下，食材过油会更好吃：1、拿出炒锅，一点点油，平时炒菜的温度，开火热锅之后，把豆腐倒进去煎大约3分钟，中间可以适当翻炒一下，避免粘锅，也可以让豆腐全方位被煎到2、盛出来的时候记得用锅铲先在锅沿把油稍微滤一下3、铺满盘底就可以煎炒一下豆腐盛出来### 制作肉酱最后弄肉酱：1、锅不用洗，还是一点点点油，肉末倒进去炒熟2、把刚才的料汁倒进去一起翻炒，让肉末都能上色上味3、因为有加淀粉，会有一点点勾芡效果，等酱汁稍微粘稠了，就可以关火4、淋到豆腐上就做好了炒制肉酱淋上去即可超级简单！超级下饭！！！好吃好看哈哈哈哈饭扫光"
  },
  {
    "slug": "xiangkao-jituikuai",
    "title": "省钱菜谱：4.3元的香烤鸡腿块（18min）",
    "desc": "今天深圳还在下雨，早上出门的时候风特别大，然后我今天循环了一天BEYOND的歌，93年不插电版本的《海阔天空》live在这个天气里听，特别有感觉！昨晚提前腌制了鸡腿，今晚拿出来烤了，空气炸锅真是方便快捷！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204164906.jpg?x-oss-process=image/interlace,1",
    "content": "今天深圳还在下雨，早上出门的时候风特别大，然后我今天循环了一天 BEYOND 的歌， 93 年不插电版本的《海阔天空》 live 在这个天气里听，特别有感觉！昨晚提前腌制了鸡腿，今晚拿出来烤了，空气炸锅真是方便快捷！成品图：香烤鸡腿块## 主要食材鸡腿 2 个，我周末在猫超买的是冷冻琵琶腿， 6.46 元 / 盒，一盒有 3 只，分 3 次做菜每次 2 个，所以今天大约 4.3 元。鸡腿## 调制料汁1、料酒 1 勺，用来去腥2、老抽 1 勺，调味+上色3、白酱油 1 勺，或者生抽，主要调味4、盐是平时炒菜的一半，适当提味5、白砂糖 0.5 勺，中和口味和提鲜6、蚝油 1 勺，提鲜7、芝麻香油 0.5 勺，香！8、花椒粉 0.3 勺，香！调料比较多，就没有额外再剁姜葱蒜了，料酒也代替了姜来给鸡腿去腥。用量就根据自己的重口程度和食材分量适当调整啦！## 腌制过程1、鸡腿洗净，剁小块，再次洗净冲掉血水，放到保鲜盒里2、把所有调料都加进去，抓匀3、放进冰箱冷藏一晚上洗净剁块腌制抓匀## 烤鸡过程空气炸锅恒温 200 度烤 18 分钟（我吃干巴一点），可以适当减少点时间保留多点汁。烤箱的话，时间基本上是要翻倍才行。准备烤烤好出炉好吃"
  },
  {
    "slug": "xianmei-roujiang-zhuchangfen",
    "title": "省钱菜谱：3.3元的鲜美肉酱猪肠粉（5min）",
    "desc": "今晚看到档口还有最后一份猪肠粉，又馋小吃了，哈哈哈买了做了个肉酱猪肠粉当晚餐！7点多就吃完晚餐了，因为朋友准备领养两只小奶猫，在给她分享一些养猫的事情，所以耽搁到现在才来发哈哈哈哈！你们都睡了吧，我也准备发完就睡觉！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204170111.jpg?x-oss-process=image/interlace,1",
    "content": "今晚看到档口还有最后一份猪肠粉，又馋小吃了，哈哈哈买了做了个肉酱猪肠粉当晚餐！ 7 点多就吃完晚餐了，因为朋友准备领养两只小奶猫，在给她分享一些养猫的事情，所以耽搁到现在才来发哈哈哈哈！你们都睡了吧，我也准备发完就睡觉！安利一首适合睡前听的曲子，王三溥的《我们的太阳（钢琴版）》，三哥是一个不太为人所知的音乐巨人，他的作品编曲都非常精致，虽然当初入坑是他那首死嗓唱腔的《命运之匙》，但听了他的其他作品才发现写的最多的其实是安安静静的纯音乐，有个评价是专门写他的：“左手新古典，右手金属，踽踽行于音乐旅途”。成品图：鲜美肉酱猪肠粉## 主要食材1、猪肠粉 2.3 元2、瘦肉 1 元3、葱## 调制料汁1、蚝油 1 勺2、老抽 1 勺3、白砂糖 0.5 勺4、花椒粉 0.3 勺5、盐一点点6、淀粉一点点7、一小撮白芝麻8、小半碗开水## 备料过程1、猪肠粉切一寸左右的小段2、肉切小粒然后剁成肉末，再适当弄散，等会下锅不至于变成一团没法分开3、葱切葱花4、调料混合一起，做成料汁备用准备好的食材## 制作过程1、第一步挺简单的，炒锅倒点油润锅，然后把猪肠粉倒进去慢慢煎一下，不用加啥酱料，煎到表层有一层煎出来的效果（emm词穷，看图感受一下吧哈哈哈哈），就可以装碗里了煎猪肠粉煎好的样子2、第二步就更简单了，肉末炒熟，把葱花和那半碗料汁倒进去一起煮一会，因为加了淀粉，所以会有一点点勾芡的效果，你感觉出稍微有点粘稠的感觉了，就可以关火了炒制肉酱然后把煮好的肉酱汁淋上去就搞定！淋上肉酱搞定这个做法，因为猪肠粉煎过，所以它的口感和平时点外卖买的小吃很不一样，平时应该都是蒸熟的我记得。搭配我自己调的这个料汁，特别好吃！好好吃料汁因为加了老抽和白砂糖，对比单纯加生抽，会带有一点点甜味，如果喜欢纯咸味的话，白砂糖可以去掉，但我觉得搭配一点点白糖，整个料汁会显得更鲜美！"
  },
  {
    "slug": "qinggua-haoyou-menroupi",
    "title": "省钱菜谱：3.35元的青瓜蚝油焖肉皮（15min）",
    "desc": "昨天好天气一天，然后今天又来台风了，晚上下班去到菜市场，都收档了，APP上也买不到菜，我都已经做好炒方便面的打算了，然后喂猫的时候瞄到了冰箱旁边的肉皮，耶耶耶！刚好还有根黄瓜，不用吃方便面了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204171053.jpg?x-oss-process=image/interlace,1",
    "content": "昨天好天气一天，然后今天又来台风了，晚上下班去到菜市场，都收档了，APP上也买不到菜，我都已经做好炒方便面的打算了，然后喂猫的时候瞄到了冰箱旁边的肉皮，耶耶耶！刚好还有根黄瓜，不用吃方便面了！！！成品图：青瓜蚝油焖肉皮## 主要食材因为今晚是做了2餐的分量（成品也装了2盘，一份是留着明天带饭的），所以一个人吃饭的话，减半就够吃了。1、黄瓜1根，1.7元2、肉皮约4元3、干香菇约1元4、一勺蚝油5、一碗清水蚝油也可以换成虾皮，不过今晚家里没有虾皮了，还没有再去买。肉皮之前也介绍过几次了，潮汕这边的一种特色食材，本质是炸猪皮。## 备料过程1、肉皮先用开水泡10分钟，挤干水分和泡出来的油脂，切小块备用2、香菇也是用开水泡开，切小块备用，今晚都是块状食材，我就没切成丝哈哈哈3、黄瓜洗净刮皮，切成滚刀块4、一勺蚝油和三勺清水兑匀成蚝油汁备用准备好的食材## 烹饪过程1、炒锅倒一点油，热锅，先把香菇炒香香菇先炒香2、把黄瓜块倒进去翻炒，稍微变软就可以下肉皮翻炒黄瓜块3、肉皮倒进来先翻炒几下，淋上蚝油汁淋上料汁炒匀4、翻炒均匀，让食材都能蹭到蚝油汁5、把那碗清水倒进去，翻炒一下，然后盖上盖子焖大约 10 分钟（具体时间视锅里的汤汁是不是快收干了），期间偶尔掀盖翻动一下，让各个食材都能焖到汤汁焖大约 10 分钟时间差不多就可以收汁出锅了。准备收汁哈哈哈哈其实做法和上次的白菜焖肉皮很接近，其他蔬菜也是可以用类似的方法来做的！出炉啦"
  },
  {
    "slug": "shacha-chao-jielan",
    "title": "省钱菜谱：4块钱的沙茶炒芥兰（5min）",
    "desc": "每次出去吃饭，点芥兰都是问蒜蓉炒还是清炒，其实我每次都很想说，沙茶炒，哈哈哈哈哈不过从来没开过口，因为出去吃饭的次数屈指可数，每次也就点个蒜蓉炒就算了。在家自己炒我更喜欢沙茶炒，就像上次的芥兰炒粿条那样，只不过没有搭配粿条，而是作为一道菜。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204180252.jpg?x-oss-process=image/interlace,1",
    "content": "每次出去吃饭，点芥兰都是问蒜蓉炒还是清炒，其实我每次都很想说，沙茶炒，哈哈哈哈哈不过从来没开过口，因为出去吃饭的次数屈指可数，每次也就点个蒜蓉炒就算了。在家自己炒我更喜欢沙茶炒，就像上次的芥兰炒粿条那样，只不过没有搭配粿条，而是作为一道菜。成品图：沙茶炒芥兰## 主要食材1、芥兰大半把，约 1.5 元（中午拆了小半把炒粿条了）2、瘦肉约 2.5 元3、沙茶酱4、盐## 备料过程1、芥兰洗净，把叶子和梗分开摘好2、因为芥兰梗比叶子难熟，所以要单独拿出来切成滚刀片，等会需要先下锅3、一大勺沙茶酱（也可以说大概1.5勺），加2勺水兑成酱料，不用太稀，我图里这样就可以了这个程度就OK4、瘦肉切片，如果你做了不止一道菜，不加肉也可以哈哈哈，我一个人吃饭就一起炒了！准备好的食材## 炒菜过程1、下油热锅，先把肉片炒熟，加一点盐调味，然后盛在沙茶酱的碗里拌匀，这样可以让肉先入味，也可以少洗一个碗哈哈哈先拌匀2、然后炒芥兰梗，十几二十秒后下叶子，炒到变软变色就可以加盐调味先炒芥兰梗再炒叶子3、关小火，把沙茶酱和肉片到进去炒匀，就可以了炒匀像我平时不太爱吃青菜的人，这么炒我就特别喜欢，就能够多吃点青菜了哈哈哈哈！好吃明天又上班啦！今天安利一首刺猬乐队的《火车驶向云外，梦安魂于九霄》，诗人一样的吉他手写的词，我特别喜欢里面的这4句：“摇旗呐喊的热情，携光阴渐远去，一代人终将老去，但总有人正年轻”我对深圳一直以来最深的记忆，就是 2017 年的迷笛音乐节了，那是我第一次参见迷笛，没想到也是最后一届深圳迷笛，一眨眼就 4 年了，时间好快啊！"
  },
  {
    "slug": "roumo-yusi-jiaozi",
    "title": "省钱菜谱：0.3元/只的肉末芋丝饺子（60min）",
    "desc": "是我前天晚餐和昨天的午餐和晚餐，蒸饺和煎饺都好吃哈哈哈哈！想做这个是因为那天买的芋头太大个了，剩下的感觉要吃好久，干脆包成饺子！也是潮汕这边比较常见的小吃用料，这个做法是沿袭了我家那边的芋粿、芋丝球（芋丸）、芋丝糕等小吃的做法，做了一点调整。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204181115.jpg?x-oss-process=image/interlace,1",
    "content": "是我前天晚餐和昨天的午餐和晚餐，蒸饺和煎饺都好吃哈哈哈哈！想做这个是因为那天买的芋头太大个了，剩下的感觉要吃好久，干脆包成饺子！也是潮汕这边比较常见的小吃用料，这个做法是沿袭了我家那边的芋粿、芋丝球（芋丸）、芋丝糕等小吃的做法，做了一点调整。最终包了 55 个饺子，平均下来 1 个饺子 3 毛钱。成品图：肉末芋丝饺子## 主要食材1、大芋头1个，因为我前一天切了一部分做了粿条卷的馅料，所以这里约7元2、瘦肉5元3、干香菇一小把，约 1 元4、花生米一小把5、虾皮一小把6、盐7、五香粉8、饺子皮 1 斤， 4 元包饺子的时候再准备一碗清水## 特殊工具1、擦丝器，因为芋头太大个，单纯用刀切太累了 - -2、一次性手套，多准备几只，芋头的粘液沾到手上会痒，哈哈哈哈我小时候帮我妈在厨房干活的时候留下的阴影3、笊篱，可以用来捞芋头丝## 处理辅料1、花生米泡水，搓皮，300度冷油下锅炸到金黄2、香菇热水泡开，切丝切丁，然后炒熟，加一点盐调味## 处理芋头1、拿芋头的那只手带手套就好，芋头先削皮，擦丝，再过几次水洗净，其实洗不到清水的样子，只要看不出有很多杂质就可以了（倒水的时候，你可以先用笊篱先把芋丝捞出来）芋头擦丝洗净捞出来2、把擦好的芋丝再简单几刀切碎，因为不是做芋粿，不需要那么长的芋丝哈哈哈适当切碎3、放炒锅里先适当炒熟，这个时候加盐调味（今天的分量我加了一勺盐，大约是平时炒菜分量的2倍）4、摊开芋丝冷却之所以不先把芋头蒸熟，是因为……太熟就很容易搞成芋泥了……不需要那么细腻的食材哈哈哈## 处理肉馅切片切丁，剁成肉末，加鱼露调味剁好肉末和其他材料## 拌馅等芋丝冷却差不多了，撒上一层五香粉拌匀，再把花生米、香菇、虾皮、肉末都倒进去拌匀，就可以了。准备好的饺子馅## 包饺子饺子包法就不重复啦！之前发的白菜饺子、韭菜饺子都有步骤拆解，哈哈哈哈还是那个包法没变化！包饺子然后需要注意的是，芋丝饺子需要蒸的时间比其他饺子稍长一点，韭菜饺子 10 分钟，芋丝要 15 分钟。包好的样子留一盒明天煎饺子## 煎饺芋丝饺子也可以煎，很好吃！煎饺搭配辣椒酱好吃"
  },
  {
    "slug": "chaozhou-guotiaojuan",
    "title": "省钱菜谱：尚！3元一盘的潮州粿条卷（15min）",
    "desc": "哈哈哈前几天做菜脯炒粿条的时候说改天弄一下粿条卷，好久没吃了！也是潮州街头很常见的小吃！不过老家都是用整张的粿条来做（平时买的都是切好的），但是在菜市场问了，我这边买不到，所以今天是用猪肠粉来代替了，你也可以用陈村粉来代替，只要是像这种整张的皮就可以，出门在外，没办法，有些食材确实得这样取巧代替一下。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204221005.jpg?x-oss-process=image/interlace,1",
    "content": "哈哈哈前几天做菜脯炒粿条的时候说改天弄一下粿条卷，好久没吃了！也是潮州街头很常见的小吃！不过老家都是用整张的粿条来做（平时买的都是切好的），但是在菜市场问了，我这边买不到，所以今天是用猪肠粉来代替了，你也可以用陈村粉来代替，只要是像这种整张的皮就可以，出门在外，没办法，有些食材确实得这样取巧代替一下。今天的食材加起来是 6 元，可以卷 6 条粿条卷，刚好 2 盘的分量。成品图：潮州粿条卷## 主要食材1、芋头，切一小块就足够了，约 2 元2、菜脯，也就是萝卜干，也是一小块，约 0.2 元3、瘦肉，还是一小块，约 1 元4、干香菇几朵，约 0.3 元5、葱 1 颗（做葱珠朥用的）6、白芝麻7、整张的粿条皮（我买不到！所以我用猪肠粉代替了， 2.5 元）8、蒜头朥（文末相关菜谱有做法）可以电热壶先煮一壶开水备用。超大个的芋头## 备料过程1、弄芋头的时候最好全程带个一次性手套，因为芋头的粘液弄到手上会痒（小时候帮我妈打下手留下的阴影…），切丁，可以压刀剁的更细腻一些2、菜脯洗净，也是切丁，剁成末3、瘦肉也是切丝切丁，剁成肉末4、香菇用热水泡开后，也是切丁5、葱切成葱花准备好的材料## 调馅过程把芋头、菜脯、肉末、香菇都炒熟，适量加一点盐调味（菜脯多就盐少点，菜脯本身是咸的），再加上一勺蒜头朥，撒入一点葱花，拌匀就可以了。调制好的馅料## 芝麻葱珠朥洗干净炒锅，擦干不要有水份，倒一点油，300度小火热锅，油温有点上来了就下葱花慢慢熬，保持小火就可以了，差不多焦脆就可以熄火，用余温继续加热到完美，碗里倒点白芝麻，葱油倒进去拌匀就是芝麻葱珠朥了炸葱花搞定详细版本可以看文末的相关菜谱。## 卷粿步骤砧板洗净，铺上一层保鲜袋或者保鲜膜垫着，虽然等下还要再蒸一下，但毕竟是熟食。1、我今天买的是猪肠粉，比较长，所以每条猪肠粉都可以对半切2、把猪肠粉展开铺平，两三勺馅料，像我图里这样铺平，不用很厚铺好的状态3、卷起来就可以了，再切成小块，我的是切了三段，等会吃的时候刚好一勺子就是一段卷起来切段4、装盘里，然后上锅蒸5分钟（可以用刚才电热壶的热水去蒸，就不用等待煮水的时间了）装盘里上锅蒸蒸好了拿出来，淋上芝麻葱珠朥就可以吃啦！哈哈哈哈哈哈我去爬山了！中午吃了一盘，晚上再来一盘，今天愉快的度过！！！耶耶耶！！！出锅了！好吃"
  },
  {
    "slug": "chashugu-hongzao-wujitang",
    "title": "煲个又清澈又鲜甜味美的茶树菇红枣乌鸡汤（1.5h）",
    "desc": "想着明天再出去爬山，今晚继续放纵一下哈哈哈哈，煲个乌鸡汤来吃吃！我记得过年的时候我朋友问我，为什么我的鸡汤那么清澈，当时也简单跟她分享过，今晚再煲汤我就在这里记录下过程。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220204223052.jpg?x-oss-process=image/interlace,1",
    "content": "想着明天再出去爬山，今晚继续放纵一下哈哈哈哈，煲个乌鸡汤来吃吃！我记得过年的时候我朋友问我，为什么我的鸡汤那么清澈，当时也简单跟她分享过，今晚再煲汤我就在这里记录下过程。其实单论煲汤这事，谁都会煲，而且现在的厨具都很智能了，想煲个能喝的汤超简单的说，但作为一个老广，更乐意去琢磨怎么能煲得更精致一些，今晚的乌鸡汤虽然清澈，但喝起来非常鲜甜，步骤很简单，只是在细节上的稍微把控一下就可以了。成品图：茶树菇红枣乌鸡汤## 主要食材1、乌鸡一腿（就是半只鸡的一半，我买的后半腿）2、瘦肉一点点（超级小一块就足够了，用来给鸡提鲜）3、红枣 8 颗4、茶树菇一小把5、姜一小块（飞水去腥用的）鸡肉加点猪瘦肉一起炖味道会更鲜美，今晚的食材非常简单，最终煲出来的汤是两人份的（哈哈哈哈哈我是一个人喝光了…）。## 所需厨具核心厨具是要有一个隔水炖的炖锅，其他锅以前尝试过，出不来这种清汤效果。普通汤锅炖锅，会沸腾的很厉害，那样汤就会很浑浊，隔水炖沸腾的是外面的水，里面的汤会保持很清澈，但味道一样的好。## 备料过程1、乌鸡剁小块，瘦肉适当切小片，加几片姜，一起冷水下锅，大火加热到快沸腾的时候，就可以关火，完成飞水环节，这个步骤是去掉腥味和杂质。2、茶树菇洗净，用热水泡几分钟，然后拧干，铺到炖锅底部3、红枣洗净，划一刀让枣的甜味可以更好的渗透到汤里，然后取出枣核（核会苦），也是铺到炖锅底部4、飞好水的鸡肉和瘦肉，用勺子先去掉表层的浮沫，然后单独捞出来，放到炖锅里5、炖锅里加水，淹没鸡肉即可材料铺底放入鸡块并加水## 煲汤过程直接按煲汤模式即可，倒计时选 1.5小 时（面向隔水炖的炖锅）。和猪手 2 小时不一样，鸡肉是比较容易熟的，这样出来的鸡肉很嫩，既不会咬不动，也不会肉质太烂，是我自己煲出来的经验觉得是比较完美的时间控制。## 盛汤步骤没错！盛汤也有注意事项的！1、拿出来先静置几分钟，让汤里的渣渣沉淀下去，还有汤里的油浮上来先静置2、用小汤勺把表面的油舀掉，动作慢一点舀，薄薄一层而已3、在准备装汤的大海碗里，加一小勺盐（比炒菜分量稍微少点）4、炖锅里的汤不要用倒的，用我这种大汤勺先舀两勺汤把盐化开，然后鸡肉和剩下的汤都是舀出来这种大汤勺5、最后炖盅里留一点点底就不要了，那个底就会有很多渣渣完成啦好多肉汤也好好喝，好甜"
  },
  {
    "slug": "congzhulao-zhushou-lumian",
    "title": "省钱菜谱：10元的潮汕葱珠朥猪手卤面（10min）",
    "desc": "昨晚说今天中午要吃卤面，哈哈哈搭配我老家那边的另外一种特色调味品 —— 葱珠油，我们那也叫葱珠朥，可好吃了！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220225132323.jpg?x-oss-process=image/interlace,1",
    "content": "昨晚说今天中午要吃卤面，哈哈哈搭配我老家那边的另外一种特色调味品 —— 葱珠油，我们那也叫葱珠朥，可好吃了！它跟蒜头油齐名，极具潮汕特色，做法更简单，葱花 + 少量油，小火熬制，2分钟就可以搞定！一般可以用在粿汁（潮汕特色小吃，不是果汁！）、芋泥、拌面等食物，超级香！！！今天还是安利一首萨满乐队的歌，《Whalesong》，一首写给52赫兹的鲸的歌，如果你有兴趣，还可以去了解一下52Hz背后的故事。今年本来可以在深圳看到萨满乐队的演出的，结果受疫情影响，从6月延期到8月，8月又通知不得不取消，希望年底或者明年他们还会再过来。成品图：葱珠朥猪手卤面## 主要食材1、昨晚留下的小半份猪手，约10元，做法可以看我昨晚的猪手菜谱2、葱1颗3、面条，家里有的，可以跟粉面档老板说你要做拌面，拿那种比较有嚼劲的4、一碗凉开水5、电热壶再烧一壶开水备用## 备料过程1、猪手昨晚是放在保鲜盒冷藏了，拿出来，水开了就放进去隔水加热，倒计时5分钟自动关火，然后先让它在锅里呆着保温冷藏的猪手放到盘子里继续保温2、加热猪手的时候可以切葱花备用3、拿出油锅倒一点油，电磁炉300度小火档次热锅，温度不能太高了4、等油温有点热度（手伸上去能感受到热），就可以下葱花下葱花5、锅铲不定时来回拨动葱花，等到稍微变焦，就可以关火了差不多关火6、利用油锅的温度继续让葱花加热，焦脆焦脆就可以盛到碗里备用了做好了葱珠油大约花费2分钟就可以做好，特别快，因为分量很少，很容易就糊，所以油温不能太高。## 卤面过程1、把刚才锅里保温的猪手拿出来，把三脚架和锅洗一下2、电热壶煮好的开水倒进汤锅，重新开火煮面（这样就不用再次等水开啦，直接就有开水可以煮面）在煮面了3、因为是拌面类型的，所以面条不需要煮的很软，熟了就可以捞干出来了（3分钟不到就煮好了）4、面条过一下凉水稍微浸一下，十几秒就好，再次捞干5、葱珠油倒进去先把面拌匀，这样可以防止面条变坨黏在一起葱珠油淋上去6、哈哈哈哈把加热好的猪手和卤汁一起倒进去，拌匀就可以开吃了！！！猪手也倒进去搞定！开吃！哈哈哈我爱猪手面条也好吃！"
  },
  {
    "slug": "chaoshan-luzhushou",
    "title": "省钱菜谱：25元吃两顿的卤猪手（2.5h）",
    "desc": "昨天爬山运动量还可以，今天上称效果显著啊（根据体重称APP的反馈，补水方面还可以，消耗的主要是脂肪），所以今天放纵一下，卤个猪手，过几天假期结束前再去爬一次山消耗一波~",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220302003924.jpg?x-oss-process=image/interlace,1",
    "content": "昨天爬山运动量还可以，今天上称效果显著啊（根据体重称APP的反馈，补水方面还可以，消耗的主要是脂肪），所以今天放纵一下，卤个猪手，过几天假期结束前再去爬一次山消耗一波\\~我以前超喜欢做各种猪手，硬菜里面猪手的花样玩的最多了，不过对应的，增肥效果也是比较明显，所以今年在过年做了一次之后，到今天才再次做。今晚有点偏红烧猪手的风味，但用卤的方式来做，避开了炒糖色等步骤，相对来说会比较简单，今晚的分量加上所有配料大约 25 元，分两餐吃，所以也还好，没有贵到哪里去。成品图：卤猪手## 主要食材猪手半只，建议去菜市场肉档买，可以买到正常的带肉的猪手，之前在电商买过的猪手都是那种超 mini 的，全是皮包骨…让档主帮你剁小块一些，拿回来后还可以把一些单独的瘦肉留着后面做菜用。## 主要香料1、葱 2 颗2、姜 2 小块3、蒜掰几瓣4、桂皮 1 片5、草果 1 颗6、八角 2 粒7、香叶 3 片8、花椒粒一小撮9、干辣椒 5 颗## 其他配料1、冰糖2、老抽## 准备过程1、猪手可以先切掉太白的部分，然后加 1 颗葱和几片姜先飞水，冷水下锅，大火煮到水开准备飞水2、在飞水的时候可以准备辅料，葱切段，姜切片，拍蒜去皮，干辣椒去籽，然后所有辅料放到炖锅里香料铺底3、猪手飞水好了就关火，去浮沫，捞出来放炖锅（飞水用的姜葱不要）倒入飞水完毕的猪手4、水淹没猪手，炖 2 小时（具体看你的锅平时炖汤要多久，像高压锅就必须缩短时间啦）## 卤水过程1、猪手炖好了，全部倒炒锅里，炒菜的温度电磁炉 800 度慢慢卤2、期间加入老抽（我锅铲里的量 x3 ），还有冰糖（我今晚加了 10 粒，是很小粒的冰糖，不是那种大块的，喜欢咸点的就少点，喜欢甜点的可以再适量加）这个锅铲的分量我用的是这种小冰糖3、慢慢煮着卤，期间偶尔去翻动一下避免糊底慢慢卤4、大约 30 分钟后卤汁会开始见底，这个时候就可以大火收汁大火收汁阶段我是 1300 度，然后不断翻炒，几秒后就可以关火了（一定要不断翻，不然就糊了），收汁出来的猪手会更有光泽更漂亮！装盘了配料和用量都很灵活，喜欢吃辣就多加干辣椒，少点冰糖，你可以尝试符合你口味的比例做做调整！好好吃！！！今晚吃了一半，留了一半连同卤汁一起，打算明天中午做个卤面吃，哈哈哈哈哈哈提前曝光我明天的午餐！留一半给明天做卤面"
  },
  {
    "slug": "caifu-chao-guotiao",
    "title": "省钱菜谱：3元的菜脯炒粿条（10min）",
    "desc": "前段时间忘记在哪篇笔记的评论下面在说菜脯，然后我一忙就忘记了，最近又有人评论到菜脯，所以，菜脯，我来啦哈哈哈哈哈哈哈！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/03/20220302132947.jpg?x-oss-process=image/interlace,1",
    "content": "前段时间忘记在哪篇笔记的评论下面在说菜脯，然后我一忙就忘记了，最近又有人评论到菜脯，所以，菜脯，我来啦哈哈哈哈哈哈哈！菜脯其实就是萝卜干，是潮汕这边的叫法，除了作为小菜配白粥之外，还可以拿来做咸水粿（潮汕小吃）、粿条卷（潮汕小吃）、菜脯煎蛋、菜脯鱼……好多好多菜式都可以用到它，也是一种比较万能的配料。今天中午做的是菜脯炒粿条，可能名气没有其他粿条炒法出名，不过在我们家那边，也是一种家常做法。成品图：菜脯炒粿条## 主要食材1、让老板抓一大把粿条， 1.5 元（看你平时吃多少买就可以了）2、菜脯切一小块，约 0.5 元（菜脯本身是咸的，第一次做的话，用量可以适量少一点）3、瘦肉约 1 元（也可以不加，做成炒斋粉）4、一根葱5、蒜头油菜脯一般在菜市场的干货店可以买到，不过你问的时候通常会先给你拿那种瓶装的菜脯粒，你要直接用也可以，我是喜欢买一整个的萝卜干，然后自己需要多少，自己切下来加工，因为瓶装的菜脯粒通常还会加其他调味，不一定都是原味的。整块的菜脯然后粿条是粿条，河粉是河粉，原料和形状都不一样的噢，问粉面档口的老板说要的是粿条，他会懂的。## 备料过程1、菜脯切下来后，因为它是用萝卜加盐去腌制后晒干得到的萝卜干，所以冲多几次水，既可以洗干净，又可以避免太咸，然后用吸油纸吸干水份（避免带有水份等下跳油溅到自己）2、菜脯切小粒，剁成小粒备用3、瘦肉切丝，再切小粒，然后再去剁成肉末，剁好后的肉末，先适当弄散，可以避免下锅后变成一团无法分开先切小粒4、葱切称葱花哈哈哈哈今天的备料过程都是剁剁剁，如果觉得过程有点无聊的话，可以脑补一些节奏差不多的音乐作为 BGM ，比如 BEYOND 乐队的《战胜心魔》前奏，带着节奏感时间会过的比较快哈哈哈哈准备好的食材## 开炒过程1、炒锅倒一点油，先把菜脯丁冷油下锅，电磁炉 300 度小火慢慢煎（火太大的话，后面会各种乱跳）煎菜脯粒2、期间用锅铲适当拨一下，煎到有点酥脆就可以出锅了，装碗备用有点酥脆就可以出锅这是成品3、然后炒肉末，肉末炒熟就可以，不用加盐，因为菜脯本身已经够咸了，也是装碗备用炒熟肉末4、然后炒粿条，炒到粿条表层有一层焦就可以了翻炒粿条5、然后把菜脯丁、肉末、葱花都加进去，再加上一勺蒜头油翻炒所有食材6、炒匀，就可以了如果你喜欢吃辣还可以加一勺辣椒一起炒，如果觉得剁的时候菜脯会跳来跳去的话，可以用压刀法来避免这个问题。出炉啦好吃！"
  },
  {
    "slug": "liangban-roupi",
    "title": "省钱菜单：5块钱的凉拌肉皮（60min）",
    "desc": "做完卤肉实在没忍住哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈，切了一块卤肉，吃个宵夜！！！这个点最好的搭配就是潮汕粿汁了！！！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/03/20220302132028.jpg?x-oss-process=image/interlace,1",
    "content": "我今天出门一天了哈哈哈哈哈， 2018 年初的时候，原来乐队的主唱跳槽来了深圳，中间有两三年没见面了，去年我也过来深圳后聚了一次，平时都比较忙也少见面，这次国庆都没回家，就约出来聚一下，然后我俩今天就去爬山了。今天走了大概有 10 公里吧，上山下山的，好累哈哈哈哈，今晚回来后我简单煮了个米粉对付一下，不过手里有昨晚的凉拌肉皮的照片，所以今晚其实是补发昨天晚上的菜，和上次凉拌鸡胸肉的做法是一样的，只不过换成了肉皮。肉皮是潮汕这边比较有特色的一道食材，原料是猪皮，之前我也分享过几种不同的做法，有兴趣可以翻一下。食材方面，肉皮大约 4 块钱的分量（之前买的1斤有一大袋，拿了几块称重大概算过每次分量的价格），黄瓜和香菜这些辅料算 1 块钱了（这次没有用到葱和姜，因为肉皮不需要飞水）。成品图：凉拌肉皮## 肉皮的处理1、肉皮先用热水泡软（大概 10min ），挤掉油脂（因为我买的是油炸的，不是砂暴的），这个步骤主要是滤油泡软的肉皮2、然后汤锅水开了再放进去煮 15min （电磁炉 800 度，平时炒菜的温度），这个步骤是让肉皮变软更容易吃煮肉皮3、然后捞出来，等冷却了就挤干水分，切丝挤干水分切丝剩下的步骤就跟凉拌鸡胸肉的做法是一模一样啦！这里就不重复太多了，有兴趣的话可以看看之前写的那篇，很详细。## 准备好的食材全部食材是这些。准备好食材## 调制好的酱料兑好的辣椒酱料。凉拌的酱料## 成品图很好吃哈哈哈哈！凉拌搞定好吃！我去睡觉了大家晚安！！！"
  },
  {
    "slug": "hongtang-jidan-mian",
    "title": "省钱菜单：0.6元的红糖鸡蛋面（8min）",
    "desc": "我昨晚熬夜了，今天早上一觉睡到了快12点，我有个习惯，就是不管熬夜多晚，都会定个11点半的闹钟，午餐还是要起来吃的！不过刚起床也没有太多精力搞别的，想起今天祖国的生日，煮个甜面条吧！刚好这个月开启新生活，吃点甜甜的重新开始！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220307001224.jpg?x-oss-process=image/interlace,1",
    "content": "我昨晚熬夜了，今天早上一觉睡到了快 12 点，我有个习惯，就是不管熬夜多晚，都会定个 11 点半的闹钟，午餐还是要起来吃的！不过刚起床也没有太多精力搞别的，想起今天祖国的生日，煮个甜面条吧！刚好这个月开启新生活，吃点甜甜的重新开始！成品图：红糖鸡蛋面## 制作步骤做法就是红糖先放碗里，水开了先兑好红糖水，然后煮面，捞出来放到糖水里。捞出来再水煮个荷包蛋，就好了。水煮荷包蛋不过我这样煮出来的是溏心蛋，如果要吃熟一点的话，可以在煮面的时候就把鸡蛋打下去了，或者额外煮多点时间！## 最终成品这一餐的 0.6 元是鸡蛋的钱，面条和红糖都是家里有的。溏心蛋哈哈哈甜面条也好吃"
  },
  {
    "slug": "shengcai-jiandan-mian",
    "title": "省钱菜单：1.1元的生菜煎蛋面（5min）",
    "desc": "今晚解决了上次买的那袋糖心蜜薯的最后一个（上次看着如果一起吃掉有点太多，就留下来了），然后就简简单单再煮个面搭配一下晚餐。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220307002220.jpg?x-oss-process=image/interlace,1",
    "content": "今晚解决了上次买的那袋糖心蜜薯的最后一个（上次看着如果一起吃掉有点太多，就留下来了），然后就简简单单再煮个面搭配一下晚餐。之前没发过这个搭配的面条，所以分享一下搭配，过程其实跟之前发过的一样，就不重复发啦！成品图：生菜煎蛋面## 主要步骤步骤其实也是很简单，煮面条（ 0 元，家里有的） + 烫生菜（约 0.5 元），然后再煎个蛋（ 0.6 元）， 1.1 元搞定！煎蛋## 最终成品哈哈哈很饱的一顿。今天的晚餐好吃的煎蛋面最后，祝大家国庆节快乐呀！"
  },
  {
    "slug": "chaoshan-fanqie-jidan-tang",
    "title": "省钱菜谱：4.5元酸酸甜甜的潮式番茄鸡蛋汤（7min）",
    "desc": "今晚分享一个我很喜欢的番茄鸡蛋汤的做法，甜口，和平时在外面吃的番茄鸡蛋汤不太一样，对比外面常见的咸口的番茄鸡蛋，我更钟爱于酸酸甜甜的口感。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220222132411.jpg?x-oss-process=image/interlace,1",
    "content": "今晚分享一个我很喜欢的番茄鸡蛋汤的做法，甜口，和平时在外面吃的番茄鸡蛋汤不太一样，对比外面常见的咸口的番茄鸡蛋，我更钟爱于酸酸甜甜的口感。成品图：番茄鸡蛋汤## 主要食材1、番茄2个，2.3元2、鸡蛋2个，1.2元3、白砂糖（较多）4、盐（一点）5、三分之一碗清水清水是吃饭的碗的三分之一，我装番茄这个碗比吃饭的碗大一圈，这样2个番茄和三分之一碗清水，煮出来刚好装这个碗一碗。## 备料过程1、番茄切半，先把番茄汁挤到盘子里2、番茄切小块，剁成番茄酱（是的！就是要这么细腻的口感！）装盘备用，砧板和刀可以洗干净收起来了。剁好的番茄和准备好的鸡蛋，还有水## 开煮步骤1、炒锅一点点油，热锅后番茄先倒进去炒2、加入刚才准备好的三分之一碗清水，翻炒均匀先翻炒番茄3、加一点盐，加多一点糖，再次翻炒均匀4、打入鸡蛋，鸡蛋不用打散，等它自然熟，自然凝固打入鸡蛋5、期间给鸡蛋翻个身，也不定期翻一下番茄凝固了就开始翻身继续煮等鸡蛋熟了就可以出锅啦！这个做法做出来的番茄口感很细腻，而且酸酸甜甜很开胃！很下饭！！！酸酸甜甜很开胃口感很细腻很好吃"
  },
  {
    "slug": "niunai-hebaodan",
    "title": "省钱菜谱：2.8元的牛奶荷包蛋当早餐（5min）",
    "desc": "分享一个早餐，以前我还在老家的时候，在路边的早餐档口很常见，就是那种大叔大妈推个小推车在卖豆浆油条白粥的，一般也会提供这道早点，后面出来工作就基本没见到了，偶尔回家几天又一定是安排肠粉，我也不知道现在还有没有在卖这个早餐了。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/03/20220301132640.jpg?x-oss-process=image/interlace,1",
    "content": "分享一个早餐，以前我还在老家的时候，在路边的早餐档口很常见，就是那种大叔大妈推个小推车在卖豆浆油条白粥的，一般也会提供这道早点，后面出来工作就基本没见到了，偶尔回家几天又一定是安排肠粉，我也不知道现在还有没有在卖这个早餐了。很好吃，做法也很简单，很适合在家自己煮。成品图：牛奶荷包蛋## 主要食材1、鸡蛋 1 个， 0.6 元2、牛奶 1 盒，之前是趁着活动买的整箱，算下来一盒 2.2 元，如果活动力度大应该能更便宜3、白砂糖，具体多少看自己喜好，先倒在等下要盛出来的碗里4、半碗水，因为单纯用牛奶太粘稠容易糊（是的，不粘锅也会煮到糊底，我也不知道为啥…）牛奶也可以用奶粉代替，这样成本就更低了！另外准备一个奶锅或者小汤锅。准备好的食材和厨具勺子我是用的电饭煲的饭勺，这样不会给奶锅的不粘层造成损伤。用的这个饭勺## 制作步骤1、牛奶沿着虚线剪开一角，倒进奶锅里2、半碗水也一起加进去盖上盖子，开火煮开，我用的炒菜的温度电磁炉 800 度。煮牛奶这个时候不要沉迷玩手机！因为牛奶很容易就溢出 = = 我之前就这样，现在吸取教训了！！！牛奶沸腾了先关火，鸡蛋打进去，重新开火，盖上盖子煮到再次看到沸腾。鸡蛋打进去这个时候拿起盖子，用饭勺试探一下鸡蛋是不是凝固了，基本上是凝固定型了的，关火，再次盖上盖子焖1分钟。凝固定型了## 其他事项这样牛奶鸡蛋就煮好了，先倒点牛奶在碗里把糖化开，然后再全部倒进去，就做好了！倒出来好吃哈哈哈从小到大的最爱！很好吃哈哈哈然后其实加了水的牛奶还是有点容易糊底，你看，已经煮出了一层奶皮，是在锅底捞起来的，但是这层奶皮也很好吃！好吃的奶皮因为要洗锅，所以我工作日比较少做这个，都是直接煮 2 个水煮蛋，今天周末我就又做这个啦哈哈哈！"
  },
  {
    "slug": "chaoshan-suantoulao",
    "title": "超简单的潮汕蒜头朥做法（我菜谱里常出现的）",
    "desc": "前几天做菜的时候我就在想，会不会有人问我“蒜头油”是什么，然后昨晚评论区真的有人问了，刚好周五做灌面的时候把瓶底最后一点用完了，周末重新做一次，顺便分享一下。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220215232444.jpg?x-oss-process=image/interlace,1",
    "content": "前几天做菜的时候我就在想，会不会有人问我“蒜头油”是什么，然后昨晚评论区真的有人问了，刚好周五做灌面的时候把瓶底最后一点用完了，周末重新做一次，顺便分享一下。身边很多人很喜欢吃潮汕汤粉，潮汕汤粉之所以很有“潮汕的味道”，其中有一个很重要的调味料叫“蒜头油”，在我们那也叫“蒜头朥”，此料一加，感觉就来了～外面买还挺贵的，自己做其实很简单（稍微花点时间），分享一下制作步骤，我做的是原味版的，有的地方还喜欢加入八角之类的，但我个人还是更喜欢原汁原味的蒜头味。成品图：潮汕蒜头朥## 主要食材1、蒜头一袋，看你要做多少，几个到十几个，做多了也没关系，密封瓶保存可以吃好几个月都没问题。2、食用油会用的比较多，你可以理解为芝麻香油那样的作用，所以油是少不了的。蒜头记得买这种颗粒饱满的，可以减少很多掰蒜头的时间…选这种饱满的## 所需工具另外请提前准备好：1、玻璃密封罐，只有足够密封的瓶子都可以拿来存放。2、一个干燥的盘子，用来给做好的蒜头酥散热3、一个干燥的大碗，用来给做好的蒜头油散热这三个东西都千万不要沾水了，避免后面存放的过程中容易变质，只要保持干燥，能吃很久，平时勺子去舀的时候也记得用干燥的勺子。## 准备过程1、蒜头掰瓣，用刀拍一下，拍碎了手一搓就可以脱掉蒜衣了，非常简单用刀拍碎先拍碎一把再一起剥掉蒜皮2、快刀剁成蒜蓉（刚开始可以用另外一只手按着刀背，垂直的慢慢剁，这样蒜末不会跳来跳去）剁成蒜蓉## 制作过程1、炒锅加入适量的油，先不开火，冷油下蒜蓉，看一下油量，至少需要淹没蒜头，多一点也可以2、中大火热油（电磁炉我是用1000度的档次，平时炒菜是800）3、期间一直保持这个温度，锅铲要一直时不时来回拨动一下蒜蓉，防止糊锅开始炸的样子4、等到蒜蓉开始逐渐呈现金黄色了，关小火（我调到800度）5、片刻后，金黄色越来越明显，关火关火了6、让余温把蒜蓉继续加热到完美（不熄火会烧焦）7、完美了，把蒜末推到周围降温冷却（不推到周围也是会焦…焦了就会发苦，前功尽弃）推到周围## 冷却过程适当降温后，把炸好的蒜头酥单独装盘，拨开让它自然冷却，电风扇吹也可以。油也是倒出来碗里冷却，因为炒锅还很热，不盛出来则需要等特别久咯。真的要等冷却了再装回去密封罐哦，不然会回软，就不酥脆了！！！## 保存方法等到都冷却完毕了，就可以装瓶密封保存了，可以买专门的密封罐（像我这种），或者用沙茶酱之类的瓶子洗干净也可以，能密封就行。平时用干燥的勺子去舀，切记不要带水，这样密封存储和保持干燥接触，几个月都能够保持很酥脆的状态！用密封罐保存## 平时调味平时煮牛肉丸汤啊、面条啊，加一勺子蒜头油，美味啊！如果你做饺子，陈醋加上一勺蒜头油拌匀，也是特别美味的饺子醋！之前做的饺子醋"
  },
  {
    "slug": "roumo-doufu-tang",
    "title": "省钱菜谱：2元的肉末豆腐汤（10min）",
    "desc": "今晚临下班下起了雨，穿着背心裤衩还有点凉飕飕的，想想煮点汤好了，暖一暖~",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220215010601.jpg?x-oss-process=image/interlace,1",
    "content": "今晚临下班下起了雨，穿着背心裤衩还有点凉飕飕的，想想煮点汤好了，暖一暖\\~成品图：肉末豆腐汤## 主要食材1、一块豆腐， 1 元，切小块，哈哈哈我切着玩，切了个九宫格。2、切点瘦肉，大约 1 元，剁成肉末3、切点葱花，不算钱4、蒜头朥（文末相关菜谱有做法）因为下班去的晚，所以只买到最后卖剩下的客家豆腐了，没有水豆腐那种软软滑滑的，但是也还不错！准备好的食材## 制作汤底1、鱼露2、胡椒粉3、葱花先煮水，水开了先用汤勺舀几勺兑一下汤底。准备好的碗底加入一勺热水兑好的汤底## 烹饪过程1、兑好汤底就可以下豆腐了，因为不是水豆腐，客家豆腐稍微偏固体（也不算硬，不知道用个什么形容词……），所以可以稍微煮几分钟，好了就捞出来放到汤底里2、肉末用笊篱盛着，筷子辅助烫熟就可以了烫熟肉末最后再淋上一勺潮汕特色的蒜头油，美滋滋！好暖和哈哈哈哈当然只有一个豆腐汤还是不够吃的，所以我又煎了两个太阳蛋（ 1.2 元），淋上酱油真好吃！搭配煎蛋，满足的一餐"
  },
  {
    "slug": "chiyou-zhurou",
    "title": "省钱菜谱：3元的豉油猪肉（2min）",
    "desc": "这道菜是我还在家初中高中的时候，我妈经常做给我吃的，那会赶着去上学，时间紧的时候，做这道菜非常快，而且也很好吃很下饭！",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220215012009.jpg?x-oss-process=image/interlace,1",
    "content": "这道菜是我还在家初中高中的时候，我妈经常做给我吃的，那会赶着去上学，时间紧的时候，做这道菜非常快，而且也很好吃很下饭！到现在工作这么多年，有时候回家晚了，我也会做这道菜，今晚因为打算明天带饭，但食材又不够吃两顿，所以在做了肉皮炒胡萝卜丝之后，我做了这道菜作为今晚的晚餐。成品图：豉油猪肉## 主要食材1、瘦肉3元，切成肉片，这个分量够我一个男生吃，真的很下饭哈哈哈，我干了一大碗饭2、老抽酱油切好的肉片这道菜我感觉用老抽是最合适的，除了上色之外，老抽特有的鲜甜是其他酱油比不了的，当然你如果钟爱其他品类的酱油，可以试试呢。另外你也可以选择带点白的梅头肉也好吃！## 烹饪过程步骤简单到只有两步：炒肉 + 上色收汁。1、加点油热锅（防止粘锅而已，不粘锅我不知道是不是可以不需要油），先炒肉片先翻炒肉片2、等肉片快熟的时候，倒入半锅铲的老抽（就我照片里这个锅铲）倒入老抽上色3、不断来回翻动肉片，让它上色并且避免粘锅4、等酱油开始有收汁的感觉的时候，装盘至于什么是收汁的感觉，就是酱油开始明显变得浓稠，水份开始变干了，再简单的说就是，你感觉再接下来会糊了，那就ok了……很好吃很下饭"
  },
  {
    "slug": "xianggu-yumili-chao-roupian",
    "title": "省钱菜谱：5块钱的香菇玉米粒炒肉片（5min）",
    "desc": "周末的时候凑单拿了根玉米，还有包云吞匀了点瘦肉留着炒菜，所以今晚吃的是：香菇玉米粒炒肉片。这道菜我很喜欢，以前有时候带饭去公司也会做它，没有太多汤汤水水，又有荤有素有粗粮，而且做法简单还便宜。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/02/20220223002231.jpg?x-oss-process=image/interlace,1",
    "content": "周末的时候凑单拿了根玉米，还有包云吞匀了点瘦肉留着炒菜，所以今晚吃的是：香菇玉米粒炒肉片。这道菜我很喜欢，以前有时候带饭去公司也会做它，没有太多汤汤水水，又有荤有素有粗粮，而且做法简单还便宜。成品图：香菇玉米粒炒肉片## 主要食材1、玉米 1 根，不用讲究颜值，反正要剥粒，便宜就好，今晚这根 1.5 元2、瘦肉约 3 元3、香菇 3 朵，估计也就 0.5 元左右，之前提前买了一大包经常要做菜用准备了一根这么大的玉米## 准备工作1、先煮壶开水，香菇需要热水泡发，顺便等下洗碗也用得着2、然后准备好盘子、笊篱、水果刀去剥玉米粒，水果刀沿着玉米的缝隙插进去，刀背朝自己，往外侧稍微一撬，一整排的玉米粒就下来了，非常简单（期间如果水开了就先去泡香菇，再回来继续剥）水果刀沿着玉米的缝隙插进去往外侧稍微一撬3、剥好的玉米粒洗净，用笊篱滤水抖干用笊篱滤水抖干4、香菇泡开了就切丝备用5、瘦肉切薄片备用6、准备半碗清水备用准备好的食材## 下锅烹饪1、炒锅加一点点油预热（平时炒菜的一半就可以了），香菇丝先下锅爆香香菇先爆香2、玉米粒倒进去翻炒，让它们都过一下油3、倒入半碗清水继续翻炒（爆米花你知道吧？如果水份不够的话，玉米粒过热会 BiuBiuBiu… ），当然水的作用也是让玉米粒可以炒得口感更软嫩多汁加水一起翻炒4、等水被吸收的差不多了，倒入瘦肉翻炒到熟5、加盐调味，装盘好吃！！！## 其他事项1、剥玉米粒的时候注意安全，刀背一定要向着自己这一侧，往外侧用力，避免划到手，实在不行就买现成的包装好的玉米粒吧，不过每次送过来都是冷冻，还是新鲜的好吃！2、我熟练工剥玉米粒大概耗时 2min ，下锅翻炒也就 3min 左右， 5 分钟就能吃到啦！（前提是先煮好饭哈哈哈"
  },
  {
    "slug": "chunrou-yuntun",
    "title": "省钱菜谱：2.7元一碗的纯肉云吞（10min）",
    "desc": "云吞虽然都是肉，但因为做法实在太多，所以不太挑剔的话，成本其实可以很低！分享一个省钱的做法，平均一个云吞1毛8，按照15个一碗的话，2块7毛钱解决晚餐。",
    "cover": "https://cdn.chengpeiquan.com/img/2022/01/20220110235534.jpg?x-oss-process=image/interlace,1",
    "content": "云吞虽然都是肉，但因为做法实在太多，所以不太挑剔的话，成本其实可以很低！分享一个省钱的做法，平均一个云吞1 毛 8 ，按照 15 个一碗的话， 2 块 7 毛钱解决晚餐。成品图：一碗汤云吞因为是周末，所以我买的材料比较多，最终包了 71 个云吞，煮了两碗（早上睡懒觉中午只是随便吃了点东西，所以云吞吃了两碗哈哈哈），一碗汤云吞，一碗拌云吞，剩下的放冰箱以后再煮。虽然看起来包了很多，但实际就花了我 10 分钟左右在包，贼快！## 主要材料1、我买了10块钱瘦肉，也可以选择肥瘦相间的梅头肉，不过价格会高一点2、再买3块钱的云吞皮，实际情况根据你的肉量买就好3、调料我是用了花椒粉（增香）和鱼露（提鲜），家里有，不用买## 调馅过程走的朴素路线，瘦肉先切片再剁成肉末，洒上一层花椒粉再剁匀，再加上适量的鱼露调咸味，再剁匀，就好了，因为过程实在太简单，我就没拍下来。## 云吞包法跟包饺子一样，需要准备一碗清水备用，用来帮助云吞粘合，避免煮的过程中被煮散。1、拿一张云吞皮，放上适量的肉馅拿一张云吞皮，放上适量的肉馅2、拉起对角盖向中心点拉起对角盖向中心点3、朝中心点卷一下朝中心点卷一下4、右手食指沾点水，点在左上角右手食指沾点水，点在左上角5、右手拉起另一侧，去与左侧粘合右手拉起另一侧，去与左侧粘合6、一个云吞就包好了， 10 秒钟都不到一个云吞就包好了今晚的材料一共包了71个，可以吃好几顿！云吞这东西可以煮，可以拌，可以炸，吃的花样很多，省钱不一定要天天煮汤面，纯肉云吞也是可选方案哟！全部包好的样子"
  }
]